alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw4.0/hw/hw40_rtc_wlan_reg.h
// Copyright (c) Qualcomm Atheros, Inc.
// All rights reserved.
// Redistribution and use in source and binary forms, with or without modification, are permitted (subject to
// the limitations in the disclaimer below) provided that the following conditions are met:
//
// · Redistributions of source code must retain the above copyright notice, this list of conditions and the
//   following disclaimer.
// · Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the
//   following disclaimer in the documentation and/or other materials provided with the distribution.
// · Neither the name of nor the names of its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE. THIS SOFTWARE IS
// PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING,
// BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
// DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
// INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
// ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//==============================================================================
// Author(s): ="Atheros"
//==============================================================================

#ifndef _RTC_WLAN_REG_REG_H_
#define _RTC_WLAN_REG_REG_H_

#define WLAN_RESET_CONTROL_ADDRESS 0x00000000
#define WLAN_RESET_CONTROL_OFFSET 0x00000000
#define WLAN_RESET_CONTROL_DEBUG_UART_RST_MSB 14
#define WLAN_RESET_CONTROL_DEBUG_UART_RST_LSB 14
#define WLAN_RESET_CONTROL_DEBUG_UART_RST_MASK 0x00004000
#define WLAN_RESET_CONTROL_DEBUG_UART_RST_GET(x) \
    (((x)&WLAN_RESET_CONTROL_DEBUG_UART_RST_MASK) >> WLAN_RESET_CONTROL_DEBUG_UART_RST_LSB)
#define WLAN_RESET_CONTROL_DEBUG_UART_RST_SET(x) \
    (((x) << WLAN_RESET_CONTROL_DEBUG_UART_RST_LSB) & WLAN_RESET_CONTROL_DEBUG_UART_RST_MASK)
#define WLAN_RESET_CONTROL_BB_COLD_RST_MSB 13
#define WLAN_RESET_CONTROL_BB_COLD_RST_LSB 13
#define WLAN_RESET_CONTROL_BB_COLD_RST_MASK 0x00002000
#define WLAN_RESET_CONTROL_BB_COLD_RST_GET(x) \
    (((x)&WLAN_RESET_CONTROL_BB_COLD_RST_MASK) >> WLAN_RESET_CONTROL_BB_COLD_RST_LSB)
#define WLAN_RESET_CONTROL_BB_COLD_RST_SET(x) \
    (((x) << WLAN_RESET_CONTROL_BB_COLD_RST_LSB) & WLAN_RESET_CONTROL_BB_COLD_RST_MASK)
#define WLAN_RESET_CONTROL_BB_WARM_RST_MSB 12
#define WLAN_RESET_CONTROL_BB_WARM_RST_LSB 12
#define WLAN_RESET_CONTROL_BB_WARM_RST_MASK 0x00001000
#define WLAN_RESET_CONTROL_BB_WARM_RST_GET(x) \
    (((x)&WLAN_RESET_CONTROL_BB_WARM_RST_MASK) >> WLAN_RESET_CONTROL_BB_WARM_RST_LSB)
#define WLAN_RESET_CONTROL_BB_WARM_RST_SET(x) \
    (((x) << WLAN_RESET_CONTROL_BB_WARM_RST_LSB) & WLAN_RESET_CONTROL_BB_WARM_RST_MASK)
#define WLAN_RESET_CONTROL_CPU_INIT_RESET_MSB 11
#define WLAN_RESET_CONTROL_CPU_INIT_RESET_LSB 11
#define WLAN_RESET_CONTROL_CPU_INIT_RESET_MASK 0x00000800
#define WLAN_RESET_CONTROL_CPU_INIT_RESET_GET(x) \
    (((x)&WLAN_RESET_CONTROL_CPU_INIT_RESET_MASK) >> WLAN_RESET_CONTROL_CPU_INIT_RESET_LSB)
#define WLAN_RESET_CONTROL_CPU_INIT_RESET_SET(x) \
    (((x) << WLAN_RESET_CONTROL_CPU_INIT_RESET_LSB) & WLAN_RESET_CONTROL_CPU_INIT_RESET_MASK)
#define WLAN_RESET_CONTROL_VMC_REMAP_RESET_MSB 10
#define WLAN_RESET_CONTROL_VMC_REMAP_RESET_LSB 10
#define WLAN_RESET_CONTROL_VMC_REMAP_RESET_MASK 0x00000400
#define WLAN_RESET_CONTROL_VMC_REMAP_RESET_GET(x) \
    (((x)&WLAN_RESET_CONTROL_VMC_REMAP_RESET_MASK) >> WLAN_RESET_CONTROL_VMC_REMAP_RESET_LSB)
#define WLAN_RESET_CONTROL_VMC_REMAP_RESET_SET(x) \
    (((x) << WLAN_RESET_CONTROL_VMC_REMAP_RESET_LSB) & WLAN_RESET_CONTROL_VMC_REMAP_RESET_MASK)
#define WLAN_RESET_CONTROL_RST_OUT_MSB 9
#define WLAN_RESET_CONTROL_RST_OUT_LSB 9
#define WLAN_RESET_CONTROL_RST_OUT_MASK 0x00000200
#define WLAN_RESET_CONTROL_RST_OUT_GET(x) (((x)&WLAN_RESET_CONTROL_RST_OUT_MASK) >> WLAN_RESET_CONTROL_RST_OUT_LSB)
#define WLAN_RESET_CONTROL_RST_OUT_SET(x) (((x) << WLAN_RESET_CONTROL_RST_OUT_LSB) & WLAN_RESET_CONTROL_RST_OUT_MASK)
#define WLAN_RESET_CONTROL_COLD_RST_MSB 8
#define WLAN_RESET_CONTROL_COLD_RST_LSB 8
#define WLAN_RESET_CONTROL_COLD_RST_MASK 0x00000100
#define WLAN_RESET_CONTROL_COLD_RST_GET(x) (((x)&WLAN_RESET_CONTROL_COLD_RST_MASK) >> WLAN_RESET_CONTROL_COLD_RST_LSB)
#define WLAN_RESET_CONTROL_COLD_RST_SET(x) (((x) << WLAN_RESET_CONTROL_COLD_RST_LSB) & WLAN_RESET_CONTROL_COLD_RST_MASK)
#define WLAN_RESET_CONTROL_WARM_RST_MSB 7
#define WLAN_RESET_CONTROL_WARM_RST_LSB 7
#define WLAN_RESET_CONTROL_WARM_RST_MASK 0x00000080
#define WLAN_RESET_CONTROL_WARM_RST_GET(x) (((x)&WLAN_RESET_CONTROL_WARM_RST_MASK) >> WLAN_RESET_CONTROL_WARM_RST_LSB)
#define WLAN_RESET_CONTROL_WARM_RST_SET(x) (((x) << WLAN_RESET_CONTROL_WARM_RST_LSB) & WLAN_RESET_CONTROL_WARM_RST_MASK)
#define WLAN_RESET_CONTROL_CPU_WARM_RST_MSB 6
#define WLAN_RESET_CONTROL_CPU_WARM_RST_LSB 6
#define WLAN_RESET_CONTROL_CPU_WARM_RST_MASK 0x00000040
#define WLAN_RESET_CONTROL_CPU_WARM_RST_GET(x) \
    (((x)&WLAN_RESET_CONTROL_CPU_WARM_RST_MASK) >> WLAN_RESET_CONTROL_CPU_WARM_RST_LSB)
#define WLAN_RESET_CONTROL_CPU_WARM_RST_SET(x) \
    (((x) << WLAN_RESET_CONTROL_CPU_WARM_RST_LSB) & WLAN_RESET_CONTROL_CPU_WARM_RST_MASK)
#define WLAN_RESET_CONTROL_MAC_COLD_RST_MSB 5
#define WLAN_RESET_CONTROL_MAC_COLD_RST_LSB 5
#define WLAN_RESET_CONTROL_MAC_COLD_RST_MASK 0x00000020
#define WLAN_RESET_CONTROL_MAC_COLD_RST_GET(x) \
    (((x)&WLAN_RESET_CONTROL_MAC_COLD_RST_MASK) >> WLAN_RESET_CONTROL_MAC_COLD_RST_LSB)
#define WLAN_RESET_CONTROL_MAC_COLD_RST_SET(x) \
    (((x) << WLAN_RESET_CONTROL_MAC_COLD_RST_LSB) & WLAN_RESET_CONTROL_MAC_COLD_RST_MASK)
#define WLAN_RESET_CONTROL_MAC_WARM_RST_MSB 4
#define WLAN_RESET_CONTROL_MAC_WARM_RST_LSB 4
#define WLAN_RESET_CONTROL_MAC_WARM_RST_MASK 0x00000010
#define WLAN_RESET_CONTROL_MAC_WARM_RST_GET(x) \
    (((x)&WLAN_RESET_CONTROL_MAC_WARM_RST_MASK) >> WLAN_RESET_CONTROL_MAC_WARM_RST_LSB)
#define WLAN_RESET_CONTROL_MAC_WARM_RST_SET(x) \
    (((x) << WLAN_RESET_CONTROL_MAC_WARM_RST_LSB) & WLAN_RESET_CONTROL_MAC_WARM_RST_MASK)
#define WLAN_RESET_CONTROL_MBOX_RST_MSB 2
#define WLAN_RESET_CONTROL_MBOX_RST_LSB 2
#define WLAN_RESET_CONTROL_MBOX_RST_MASK 0x00000004
#define WLAN_RESET_CONTROL_MBOX_RST_GET(x) (((x)&WLAN_RESET_CONTROL_MBOX_RST_MASK) >> WLAN_RESET_CONTROL_MBOX_RST_LSB)
#define WLAN_RESET_CONTROL_MBOX_RST_SET(x) (((x) << WLAN_RESET_CONTROL_MBOX_RST_LSB) & WLAN_RESET_CONTROL_MBOX_RST_MASK)
#define WLAN_RESET_CONTROL_UART_RST_MSB 1
#define WLAN_RESET_CONTROL_UART_RST_LSB 1
#define WLAN_RESET_CONTROL_UART_RST_MASK 0x00000002
#define WLAN_RESET_CONTROL_UART_RST_GET(x) (((x)&WLAN_RESET_CONTROL_UART_RST_MASK) >> WLAN_RESET_CONTROL_UART_RST_LSB)
#define WLAN_RESET_CONTROL_UART_RST_SET(x) (((x) << WLAN_RESET_CONTROL_UART_RST_LSB) & WLAN_RESET_CONTROL_UART_RST_MASK)
#define WLAN_RESET_CONTROL_SI0_RST_MSB 0
#define WLAN_RESET_CONTROL_SI0_RST_LSB 0
#define WLAN_RESET_CONTROL_SI0_RST_MASK 0x00000001
#define WLAN_RESET_CONTROL_SI0_RST_GET(x) (((x)&WLAN_RESET_CONTROL_SI0_RST_MASK) >> WLAN_RESET_CONTROL_SI0_RST_LSB)
#define WLAN_RESET_CONTROL_SI0_RST_SET(x) (((x) << WLAN_RESET_CONTROL_SI0_RST_LSB) & WLAN_RESET_CONTROL_SI0_RST_MASK)

