alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw4.0/hw/hw40_rtc_wlan_reg.h
#define WLAN_XTAL_CONTROL_ADDRESS 0x00000004
#define WLAN_XTAL_CONTROL_OFFSET 0x00000004
#define WLAN_XTAL_CONTROL_TCXO_MSB 0
#define WLAN_XTAL_CONTROL_TCXO_LSB 0
#define WLAN_XTAL_CONTROL_TCXO_MASK 0x00000001
#define WLAN_XTAL_CONTROL_TCXO_GET(x) (((x)&WLAN_XTAL_CONTROL_TCXO_MASK) >> WLAN_XTAL_CONTROL_TCXO_LSB)
#define WLAN_XTAL_CONTROL_TCXO_SET(x) (((x) << WLAN_XTAL_CONTROL_TCXO_LSB) & WLAN_XTAL_CONTROL_TCXO_MASK)

#define WLAN_TCXO_DETECT_ADDRESS 0x00000008
#define WLAN_TCXO_DETECT_OFFSET 0x00000008
#define WLAN_TCXO_DETECT_PRESENT_MSB 0
#define WLAN_TCXO_DETECT_PRESENT_LSB 0
#define WLAN_TCXO_DETECT_PRESENT_MASK 0x00000001
#define WLAN_TCXO_DETECT_PRESENT_GET(x) (((x)&WLAN_TCXO_DETECT_PRESENT_MASK) >> WLAN_TCXO_DETECT_PRESENT_LSB)
#define WLAN_TCXO_DETECT_PRESENT_SET(x) (((x) << WLAN_TCXO_DETECT_PRESENT_LSB) & WLAN_TCXO_DETECT_PRESENT_MASK)

#define WLAN_XTAL_TEST_ADDRESS 0x0000000c
#define WLAN_XTAL_TEST_OFFSET 0x0000000c
#define WLAN_XTAL_TEST_NOTCXODET_MSB 0
#define WLAN_XTAL_TEST_NOTCXODET_LSB 0
#define WLAN_XTAL_TEST_NOTCXODET_MASK 0x00000001
#define WLAN_XTAL_TEST_NOTCXODET_GET(x) (((x)&WLAN_XTAL_TEST_NOTCXODET_MASK) >> WLAN_XTAL_TEST_NOTCXODET_LSB)
#define WLAN_XTAL_TEST_NOTCXODET_SET(x) (((x) << WLAN_XTAL_TEST_NOTCXODET_LSB) & WLAN_XTAL_TEST_NOTCXODET_MASK)

#define WLAN_QUADRATURE_ADDRESS 0x00000010
#define WLAN_QUADRATURE_OFFSET 0x00000010
#define WLAN_QUADRATURE_ADC_MSB 7
#define WLAN_QUADRATURE_ADC_LSB 4
#define WLAN_QUADRATURE_ADC_MASK 0x000000f0
#define WLAN_QUADRATURE_ADC_GET(x) (((x)&WLAN_QUADRATURE_ADC_MASK) >> WLAN_QUADRATURE_ADC_LSB)
#define WLAN_QUADRATURE_ADC_SET(x) (((x) << WLAN_QUADRATURE_ADC_LSB) & WLAN_QUADRATURE_ADC_MASK)
#define WLAN_QUADRATURE_SEL_MSB 2
#define WLAN_QUADRATURE_SEL_LSB 2
#define WLAN_QUADRATURE_SEL_MASK 0x00000004
#define WLAN_QUADRATURE_SEL_GET(x) (((x)&WLAN_QUADRATURE_SEL_MASK) >> WLAN_QUADRATURE_SEL_LSB)
#define WLAN_QUADRATURE_SEL_SET(x) (((x) << WLAN_QUADRATURE_SEL_LSB) & WLAN_QUADRATURE_SEL_MASK)
#define WLAN_QUADRATURE_DAC_MSB 1
#define WLAN_QUADRATURE_DAC_LSB 0
#define WLAN_QUADRATURE_DAC_MASK 0x00000003
#define WLAN_QUADRATURE_DAC_GET(x) (((x)&WLAN_QUADRATURE_DAC_MASK) >> WLAN_QUADRATURE_DAC_LSB)
#define WLAN_QUADRATURE_DAC_SET(x) (((x) << WLAN_QUADRATURE_DAC_LSB) & WLAN_QUADRATURE_DAC_MASK)

#define WLAN_PLL_CONTROL_ADDRESS 0x00000014
#define WLAN_PLL_CONTROL_OFFSET 0x00000014
#define WLAN_PLL_CONTROL_DIG_TEST_CLK_MSB 20
#define WLAN_PLL_CONTROL_DIG_TEST_CLK_LSB 20
#define WLAN_PLL_CONTROL_DIG_TEST_CLK_MASK 0x00100000
#define WLAN_PLL_CONTROL_DIG_TEST_CLK_GET(x) \
    (((x)&WLAN_PLL_CONTROL_DIG_TEST_CLK_MASK) >> WLAN_PLL_CONTROL_DIG_TEST_CLK_LSB)
#define WLAN_PLL_CONTROL_DIG_TEST_CLK_SET(x) \
    (((x) << WLAN_PLL_CONTROL_DIG_TEST_CLK_LSB) & WLAN_PLL_CONTROL_DIG_TEST_CLK_MASK)
#define WLAN_PLL_CONTROL_MAC_OVERRIDE_MSB 19
#define WLAN_PLL_CONTROL_MAC_OVERRIDE_LSB 19
#define WLAN_PLL_CONTROL_MAC_OVERRIDE_MASK 0x00080000
#define WLAN_PLL_CONTROL_MAC_OVERRIDE_GET(x) \
    (((x)&WLAN_PLL_CONTROL_MAC_OVERRIDE_MASK) >> WLAN_PLL_CONTROL_MAC_OVERRIDE_LSB)
#define WLAN_PLL_CONTROL_MAC_OVERRIDE_SET(x) \
    (((x) << WLAN_PLL_CONTROL_MAC_OVERRIDE_LSB) & WLAN_PLL_CONTROL_MAC_OVERRIDE_MASK)
#define WLAN_PLL_CONTROL_NOPWD_MSB 18
#define WLAN_PLL_CONTROL_NOPWD_LSB 18
#define WLAN_PLL_CONTROL_NOPWD_MASK 0x00040000
#define WLAN_PLL_CONTROL_NOPWD_GET(x) (((x)&WLAN_PLL_CONTROL_NOPWD_MASK) >> WLAN_PLL_CONTROL_NOPWD_LSB)
#define WLAN_PLL_CONTROL_NOPWD_SET(x) (((x) << WLAN_PLL_CONTROL_NOPWD_LSB) & WLAN_PLL_CONTROL_NOPWD_MASK)
#define WLAN_PLL_CONTROL_UPDATING_MSB 17
#define WLAN_PLL_CONTROL_UPDATING_LSB 17
#define WLAN_PLL_CONTROL_UPDATING_MASK 0x00020000
#define WLAN_PLL_CONTROL_UPDATING_GET(x) (((x)&WLAN_PLL_CONTROL_UPDATING_MASK) >> WLAN_PLL_CONTROL_UPDATING_LSB)
#define WLAN_PLL_CONTROL_UPDATING_SET(x) (((x) << WLAN_PLL_CONTROL_UPDATING_LSB) & WLAN_PLL_CONTROL_UPDATING_MASK)
#define WLAN_PLL_CONTROL_BYPASS_MSB 16
#define WLAN_PLL_CONTROL_BYPASS_LSB 16
#define WLAN_PLL_CONTROL_BYPASS_MASK 0x00010000
#define WLAN_PLL_CONTROL_BYPASS_GET(x) (((x)&WLAN_PLL_CONTROL_BYPASS_MASK) >> WLAN_PLL_CONTROL_BYPASS_LSB)
#define WLAN_PLL_CONTROL_BYPASS_SET(x) (((x) << WLAN_PLL_CONTROL_BYPASS_LSB) & WLAN_PLL_CONTROL_BYPASS_MASK)
#define WLAN_PLL_CONTROL_REFDIV_MSB 15
#define WLAN_PLL_CONTROL_REFDIV_LSB 12
#define WLAN_PLL_CONTROL_REFDIV_MASK 0x0000f000
#define WLAN_PLL_CONTROL_REFDIV_GET(x) (((x)&WLAN_PLL_CONTROL_REFDIV_MASK) >> WLAN_PLL_CONTROL_REFDIV_LSB)
#define WLAN_PLL_CONTROL_REFDIV_SET(x) (((x) << WLAN_PLL_CONTROL_REFDIV_LSB) & WLAN_PLL_CONTROL_REFDIV_MASK)
#define WLAN_PLL_CONTROL_DIV_MSB 9
#define WLAN_PLL_CONTROL_DIV_LSB 0
#define WLAN_PLL_CONTROL_DIV_MASK 0x000003ff
#define WLAN_PLL_CONTROL_DIV_GET(x) (((x)&WLAN_PLL_CONTROL_DIV_MASK) >> WLAN_PLL_CONTROL_DIV_LSB)
#define WLAN_PLL_CONTROL_DIV_SET(x) (((x) << WLAN_PLL_CONTROL_DIV_LSB) & WLAN_PLL_CONTROL_DIV_MASK)

#define WLAN_PLL_SETTLE_ADDRESS 0x00000018
#define WLAN_PLL_SETTLE_OFFSET 0x00000018
#define WLAN_PLL_SETTLE_TIME_MSB 11
#define WLAN_PLL_SETTLE_TIME_LSB 0
#define WLAN_PLL_SETTLE_TIME_MASK 0x00000fff
#define WLAN_PLL_SETTLE_TIME_GET(x) (((x)&WLAN_PLL_SETTLE_TIME_MASK) >> WLAN_PLL_SETTLE_TIME_LSB)
#define WLAN_PLL_SETTLE_TIME_SET(x) (((x) << WLAN_PLL_SETTLE_TIME_LSB) & WLAN_PLL_SETTLE_TIME_MASK)

#define WLAN_XTAL_SETTLE_ADDRESS 0x0000001c
#define WLAN_XTAL_SETTLE_OFFSET 0x0000001c
#define WLAN_XTAL_SETTLE_TIME_MSB 7
#define WLAN_XTAL_SETTLE_TIME_LSB 0
#define WLAN_XTAL_SETTLE_TIME_MASK 0x000000ff
#define WLAN_XTAL_SETTLE_TIME_GET(x) (((x)&WLAN_XTAL_SETTLE_TIME_MASK) >> WLAN_XTAL_SETTLE_TIME_LSB)
#define WLAN_XTAL_SETTLE_TIME_SET(x) (((x) << WLAN_XTAL_SETTLE_TIME_LSB) & WLAN_XTAL_SETTLE_TIME_MASK)

#define WLAN_CPU_CLOCK_ADDRESS 0x00000020
#define WLAN_CPU_CLOCK_OFFSET 0x00000020
#define WLAN_CPU_CLOCK_STANDARD_MSB 1
#define WLAN_CPU_CLOCK_STANDARD_LSB 0
#define WLAN_CPU_CLOCK_STANDARD_MASK 0x00000003
#define WLAN_CPU_CLOCK_STANDARD_GET(x) (((x)&WLAN_CPU_CLOCK_STANDARD_MASK) >> WLAN_CPU_CLOCK_STANDARD_LSB)
#define WLAN_CPU_CLOCK_STANDARD_SET(x) (((x) << WLAN_CPU_CLOCK_STANDARD_LSB) & WLAN_CPU_CLOCK_STANDARD_MASK)

#define WLAN_CLOCK_OUT_ADDRESS 0x00000024
#define WLAN_CLOCK_OUT_OFFSET 0x00000024
#define WLAN_CLOCK_OUT_SELECT_MSB 3
#define WLAN_CLOCK_OUT_SELECT_LSB 0
#define WLAN_CLOCK_OUT_SELECT_MASK 0x0000000f
#define WLAN_CLOCK_OUT_SELECT_GET(x) (((x)&WLAN_CLOCK_OUT_SELECT_MASK) >> WLAN_CLOCK_OUT_SELECT_LSB)
#define WLAN_CLOCK_OUT_SELECT_SET(x) (((x) << WLAN_CLOCK_OUT_SELECT_LSB) & WLAN_CLOCK_OUT_SELECT_MASK)

#define WLAN_CLOCK_CONTROL_ADDRESS 0x00000028
#define WLAN_CLOCK_CONTROL_OFFSET 0x00000028
#define WLAN_CLOCK_CONTROL_LF_CLK32_MSB 2
#define WLAN_CLOCK_CONTROL_LF_CLK32_LSB 2
#define WLAN_CLOCK_CONTROL_LF_CLK32_MASK 0x00000004
#define WLAN_CLOCK_CONTROL_LF_CLK32_GET(x) (((x)&WLAN_CLOCK_CONTROL_LF_CLK32_MASK) >> WLAN_CLOCK_CONTROL_LF_CLK32_LSB)
#define WLAN_CLOCK_CONTROL_LF_CLK32_SET(x) (((x) << WLAN_CLOCK_CONTROL_LF_CLK32_LSB) & WLAN_CLOCK_CONTROL_LF_CLK32_MASK)
#define WLAN_CLOCK_CONTROL_SI0_CLK_MSB 0
#define WLAN_CLOCK_CONTROL_SI0_CLK_LSB 0
#define WLAN_CLOCK_CONTROL_SI0_CLK_MASK 0x00000001
#define WLAN_CLOCK_CONTROL_SI0_CLK_GET(x) (((x)&WLAN_CLOCK_CONTROL_SI0_CLK_MASK) >> WLAN_CLOCK_CONTROL_SI0_CLK_LSB)
#define WLAN_CLOCK_CONTROL_SI0_CLK_SET(x) (((x) << WLAN_CLOCK_CONTROL_SI0_CLK_LSB) & WLAN_CLOCK_CONTROL_SI0_CLK_MASK)

#define WLAN_BIAS_OVERRIDE_ADDRESS 0x0000002c
#define WLAN_BIAS_OVERRIDE_OFFSET 0x0000002c
#define WLAN_BIAS_OVERRIDE_ON_MSB 0
#define WLAN_BIAS_OVERRIDE_ON_LSB 0
#define WLAN_BIAS_OVERRIDE_ON_MASK 0x00000001
#define WLAN_BIAS_OVERRIDE_ON_GET(x) (((x)&WLAN_BIAS_OVERRIDE_ON_MASK) >> WLAN_BIAS_OVERRIDE_ON_LSB)
#define WLAN_BIAS_OVERRIDE_ON_SET(x) (((x) << WLAN_BIAS_OVERRIDE_ON_LSB) & WLAN_BIAS_OVERRIDE_ON_MASK)

