alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw4.0/hw/hw40_rtc_wlan_reg.h
#define WLAN_WDT_CONTROL_ADDRESS 0x00000030
#define WLAN_WDT_CONTROL_OFFSET 0x00000030
#define WLAN_WDT_CONTROL_ACTION_MSB 2
#define WLAN_WDT_CONTROL_ACTION_LSB 0
#define WLAN_WDT_CONTROL_ACTION_MASK 0x00000007
#define WLAN_WDT_CONTROL_ACTION_GET(x) (((x)&WLAN_WDT_CONTROL_ACTION_MASK) >> WLAN_WDT_CONTROL_ACTION_LSB)
#define WLAN_WDT_CONTROL_ACTION_SET(x) (((x) << WLAN_WDT_CONTROL_ACTION_LSB) & WLAN_WDT_CONTROL_ACTION_MASK)

#define WLAN_WDT_STATUS_ADDRESS 0x00000034
#define WLAN_WDT_STATUS_OFFSET 0x00000034
#define WLAN_WDT_STATUS_INTERRUPT_MSB 0
#define WLAN_WDT_STATUS_INTERRUPT_LSB 0
#define WLAN_WDT_STATUS_INTERRUPT_MASK 0x00000001
#define WLAN_WDT_STATUS_INTERRUPT_GET(x) (((x)&WLAN_WDT_STATUS_INTERRUPT_MASK) >> WLAN_WDT_STATUS_INTERRUPT_LSB)
#define WLAN_WDT_STATUS_INTERRUPT_SET(x) (((x) << WLAN_WDT_STATUS_INTERRUPT_LSB) & WLAN_WDT_STATUS_INTERRUPT_MASK)

#define WLAN_WDT_ADDRESS 0x00000038
#define WLAN_WDT_OFFSET 0x00000038
#define WLAN_WDT_TARGET_MSB 21
#define WLAN_WDT_TARGET_LSB 0
#define WLAN_WDT_TARGET_MASK 0x003fffff
#define WLAN_WDT_TARGET_GET(x) (((x)&WLAN_WDT_TARGET_MASK) >> WLAN_WDT_TARGET_LSB)
#define WLAN_WDT_TARGET_SET(x) (((x) << WLAN_WDT_TARGET_LSB) & WLAN_WDT_TARGET_MASK)

#define WLAN_WDT_COUNT_ADDRESS 0x0000003c
#define WLAN_WDT_COUNT_OFFSET 0x0000003c
#define WLAN_WDT_COUNT_VALUE_MSB 21
#define WLAN_WDT_COUNT_VALUE_LSB 0
#define WLAN_WDT_COUNT_VALUE_MASK 0x003fffff
#define WLAN_WDT_COUNT_VALUE_GET(x) (((x)&WLAN_WDT_COUNT_VALUE_MASK) >> WLAN_WDT_COUNT_VALUE_LSB)
#define WLAN_WDT_COUNT_VALUE_SET(x) (((x) << WLAN_WDT_COUNT_VALUE_LSB) & WLAN_WDT_COUNT_VALUE_MASK)

#define WLAN_WDT_RESET_ADDRESS 0x00000040
#define WLAN_WDT_RESET_OFFSET 0x00000040
#define WLAN_WDT_RESET_VALUE_MSB 0
#define WLAN_WDT_RESET_VALUE_LSB 0
#define WLAN_WDT_RESET_VALUE_MASK 0x00000001
#define WLAN_WDT_RESET_VALUE_GET(x) (((x)&WLAN_WDT_RESET_VALUE_MASK) >> WLAN_WDT_RESET_VALUE_LSB)
#define WLAN_WDT_RESET_VALUE_SET(x) (((x) << WLAN_WDT_RESET_VALUE_LSB) & WLAN_WDT_RESET_VALUE_MASK)

#define WLAN_INT_STATUS_ADDRESS 0x00000044
#define WLAN_INT_STATUS_OFFSET 0x00000044
#define WLAN_INT_STATUS_HCI_UART_MSB 21
#define WLAN_INT_STATUS_HCI_UART_LSB 21
#define WLAN_INT_STATUS_HCI_UART_MASK 0x00200000
#define WLAN_INT_STATUS_HCI_UART_GET(x) (((x)&WLAN_INT_STATUS_HCI_UART_MASK) >> WLAN_INT_STATUS_HCI_UART_LSB)
#define WLAN_INT_STATUS_HCI_UART_SET(x) (((x) << WLAN_INT_STATUS_HCI_UART_LSB) & WLAN_INT_STATUS_HCI_UART_MASK)
#define WLAN_INT_STATUS_THERM_MSB 20
#define WLAN_INT_STATUS_THERM_LSB 20
#define WLAN_INT_STATUS_THERM_MASK 0x00100000
#define WLAN_INT_STATUS_THERM_GET(x) (((x)&WLAN_INT_STATUS_THERM_MASK) >> WLAN_INT_STATUS_THERM_LSB)
#define WLAN_INT_STATUS_THERM_SET(x) (((x) << WLAN_INT_STATUS_THERM_LSB) & WLAN_INT_STATUS_THERM_MASK)
#define WLAN_INT_STATUS_EFUSE_OVERWRITE_MSB 19
#define WLAN_INT_STATUS_EFUSE_OVERWRITE_LSB 19
#define WLAN_INT_STATUS_EFUSE_OVERWRITE_MASK 0x00080000
#define WLAN_INT_STATUS_EFUSE_OVERWRITE_GET(x) \
    (((x)&WLAN_INT_STATUS_EFUSE_OVERWRITE_MASK) >> WLAN_INT_STATUS_EFUSE_OVERWRITE_LSB)
#define WLAN_INT_STATUS_EFUSE_OVERWRITE_SET(x) \
    (((x) << WLAN_INT_STATUS_EFUSE_OVERWRITE_LSB) & WLAN_INT_STATUS_EFUSE_OVERWRITE_MASK)
#define WLAN_INT_STATUS_UART_MBOX_MSB 18
#define WLAN_INT_STATUS_UART_MBOX_LSB 18
#define WLAN_INT_STATUS_UART_MBOX_MASK 0x00040000
#define WLAN_INT_STATUS_UART_MBOX_GET(x) (((x)&WLAN_INT_STATUS_UART_MBOX_MASK) >> WLAN_INT_STATUS_UART_MBOX_LSB)
#define WLAN_INT_STATUS_UART_MBOX_SET(x) (((x) << WLAN_INT_STATUS_UART_MBOX_LSB) & WLAN_INT_STATUS_UART_MBOX_MASK)
#define WLAN_INT_STATUS_GENERIC_MBOX_MSB 17
#define WLAN_INT_STATUS_GENERIC_MBOX_LSB 17
#define WLAN_INT_STATUS_GENERIC_MBOX_MASK 0x00020000
#define WLAN_INT_STATUS_GENERIC_MBOX_GET(x) \
    (((x)&WLAN_INT_STATUS_GENERIC_MBOX_MASK) >> WLAN_INT_STATUS_GENERIC_MBOX_LSB)
#define WLAN_INT_STATUS_GENERIC_MBOX_SET(x) \
    (((x) << WLAN_INT_STATUS_GENERIC_MBOX_LSB) & WLAN_INT_STATUS_GENERIC_MBOX_MASK)
#define WLAN_INT_STATUS_RDMA_MSB 16
#define WLAN_INT_STATUS_RDMA_LSB 16
#define WLAN_INT_STATUS_RDMA_MASK 0x00010000
#define WLAN_INT_STATUS_RDMA_GET(x) (((x)&WLAN_INT_STATUS_RDMA_MASK) >> WLAN_INT_STATUS_RDMA_LSB)
#define WLAN_INT_STATUS_RDMA_SET(x) (((x) << WLAN_INT_STATUS_RDMA_LSB) & WLAN_INT_STATUS_RDMA_MASK)
#define WLAN_INT_STATUS_BTCOEX_MSB 15
#define WLAN_INT_STATUS_BTCOEX_LSB 15
#define WLAN_INT_STATUS_BTCOEX_MASK 0x00008000
#define WLAN_INT_STATUS_BTCOEX_GET(x) (((x)&WLAN_INT_STATUS_BTCOEX_MASK) >> WLAN_INT_STATUS_BTCOEX_LSB)
#define WLAN_INT_STATUS_BTCOEX_SET(x) (((x) << WLAN_INT_STATUS_BTCOEX_LSB) & WLAN_INT_STATUS_BTCOEX_MASK)
#define WLAN_INT_STATUS_RTC_POWER_MSB 14
#define WLAN_INT_STATUS_RTC_POWER_LSB 14
#define WLAN_INT_STATUS_RTC_POWER_MASK 0x00004000
#define WLAN_INT_STATUS_RTC_POWER_GET(x) (((x)&WLAN_INT_STATUS_RTC_POWER_MASK) >> WLAN_INT_STATUS_RTC_POWER_LSB)
#define WLAN_INT_STATUS_RTC_POWER_SET(x) (((x) << WLAN_INT_STATUS_RTC_POWER_LSB) & WLAN_INT_STATUS_RTC_POWER_MASK)
#define WLAN_INT_STATUS_MAC_MSB 13
#define WLAN_INT_STATUS_MAC_LSB 13
#define WLAN_INT_STATUS_MAC_MASK 0x00002000
#define WLAN_INT_STATUS_MAC_GET(x) (((x)&WLAN_INT_STATUS_MAC_MASK) >> WLAN_INT_STATUS_MAC_LSB)
#define WLAN_INT_STATUS_MAC_SET(x) (((x) << WLAN_INT_STATUS_MAC_LSB) & WLAN_INT_STATUS_MAC_MASK)
#define WLAN_INT_STATUS_MAILBOX_MSB 12
#define WLAN_INT_STATUS_MAILBOX_LSB 12
#define WLAN_INT_STATUS_MAILBOX_MASK 0x00001000
#define WLAN_INT_STATUS_MAILBOX_GET(x) (((x)&WLAN_INT_STATUS_MAILBOX_MASK) >> WLAN_INT_STATUS_MAILBOX_LSB)
#define WLAN_INT_STATUS_MAILBOX_SET(x) (((x) << WLAN_INT_STATUS_MAILBOX_LSB) & WLAN_INT_STATUS_MAILBOX_MASK)
#define WLAN_INT_STATUS_RTC_ALARM_MSB 11
#define WLAN_INT_STATUS_RTC_ALARM_LSB 11
#define WLAN_INT_STATUS_RTC_ALARM_MASK 0x00000800
#define WLAN_INT_STATUS_RTC_ALARM_GET(x) (((x)&WLAN_INT_STATUS_RTC_ALARM_MASK) >> WLAN_INT_STATUS_RTC_ALARM_LSB)
#define WLAN_INT_STATUS_RTC_ALARM_SET(x) (((x) << WLAN_INT_STATUS_RTC_ALARM_LSB) & WLAN_INT_STATUS_RTC_ALARM_MASK)
#define WLAN_INT_STATUS_HF_TIMER_MSB 10
#define WLAN_INT_STATUS_HF_TIMER_LSB 10
#define WLAN_INT_STATUS_HF_TIMER_MASK 0x00000400
#define WLAN_INT_STATUS_HF_TIMER_GET(x) (((x)&WLAN_INT_STATUS_HF_TIMER_MASK) >> WLAN_INT_STATUS_HF_TIMER_LSB)
#define WLAN_INT_STATUS_HF_TIMER_SET(x) (((x) << WLAN_INT_STATUS_HF_TIMER_LSB) & WLAN_INT_STATUS_HF_TIMER_MASK)
#define WLAN_INT_STATUS_LF_TIMER3_MSB 9
#define WLAN_INT_STATUS_LF_TIMER3_LSB 9
#define WLAN_INT_STATUS_LF_TIMER3_MASK 0x00000200
#define WLAN_INT_STATUS_LF_TIMER3_GET(x) (((x)&WLAN_INT_STATUS_LF_TIMER3_MASK) >> WLAN_INT_STATUS_LF_TIMER3_LSB)
#define WLAN_INT_STATUS_LF_TIMER3_SET(x) (((x) << WLAN_INT_STATUS_LF_TIMER3_LSB) & WLAN_INT_STATUS_LF_TIMER3_MASK)
#define WLAN_INT_STATUS_LF_TIMER2_MSB 8
#define WLAN_INT_STATUS_LF_TIMER2_LSB 8
#define WLAN_INT_STATUS_LF_TIMER2_MASK 0x00000100
#define WLAN_INT_STATUS_LF_TIMER2_GET(x) (((x)&WLAN_INT_STATUS_LF_TIMER2_MASK) >> WLAN_INT_STATUS_LF_TIMER2_LSB)
#define WLAN_INT_STATUS_LF_TIMER2_SET(x) (((x) << WLAN_INT_STATUS_LF_TIMER2_LSB) & WLAN_INT_STATUS_LF_TIMER2_MASK)
#define WLAN_INT_STATUS_LF_TIMER1_MSB 7
#define WLAN_INT_STATUS_LF_TIMER1_LSB 7
#define WLAN_INT_STATUS_LF_TIMER1_MASK 0x00000080
#define WLAN_INT_STATUS_LF_TIMER1_GET(x) (((x)&WLAN_INT_STATUS_LF_TIMER1_MASK) >> WLAN_INT_STATUS_LF_TIMER1_LSB)
#define WLAN_INT_STATUS_LF_TIMER1_SET(x) (((x) << WLAN_INT_STATUS_LF_TIMER1_LSB) & WLAN_INT_STATUS_LF_TIMER1_MASK)
#define WLAN_INT_STATUS_LF_TIMER0_MSB 6
#define WLAN_INT_STATUS_LF_TIMER0_LSB 6
#define WLAN_INT_STATUS_LF_TIMER0_MASK 0x00000040
#define WLAN_INT_STATUS_LF_TIMER0_GET(x) (((x)&WLAN_INT_STATUS_LF_TIMER0_MASK) >> WLAN_INT_STATUS_LF_TIMER0_LSB)
#define WLAN_INT_STATUS_LF_TIMER0_SET(x) (((x) << WLAN_INT_STATUS_LF_TIMER0_LSB) & WLAN_INT_STATUS_LF_TIMER0_MASK)
#define WLAN_INT_STATUS_KEYPAD_MSB 5
#define WLAN_INT_STATUS_KEYPAD_LSB 5
#define WLAN_INT_STATUS_KEYPAD_MASK 0x00000020
#define WLAN_INT_STATUS_KEYPAD_GET(x) (((x)&WLAN_INT_STATUS_KEYPAD_MASK) >> WLAN_INT_STATUS_KEYPAD_LSB)
#define WLAN_INT_STATUS_KEYPAD_SET(x) (((x) << WLAN_INT_STATUS_KEYPAD_LSB) & WLAN_INT_STATUS_KEYPAD_MASK)
#define WLAN_INT_STATUS_SI_MSB 4
#define WLAN_INT_STATUS_SI_LSB 4
#define WLAN_INT_STATUS_SI_MASK 0x00000010
#define WLAN_INT_STATUS_SI_GET(x) (((x)&WLAN_INT_STATUS_SI_MASK) >> WLAN_INT_STATUS_SI_LSB)
#define WLAN_INT_STATUS_SI_SET(x) (((x) << WLAN_INT_STATUS_SI_LSB) & WLAN_INT_STATUS_SI_MASK)
#define WLAN_INT_STATUS_GPIO_MSB 3
#define WLAN_INT_STATUS_GPIO_LSB 3
#define WLAN_INT_STATUS_GPIO_MASK 0x00000008
#define WLAN_INT_STATUS_GPIO_GET(x) (((x)&WLAN_INT_STATUS_GPIO_MASK) >> WLAN_INT_STATUS_GPIO_LSB)
#define WLAN_INT_STATUS_GPIO_SET(x) (((x) << WLAN_INT_STATUS_GPIO_LSB) & WLAN_INT_STATUS_GPIO_MASK)
#define WLAN_INT_STATUS_UART_MSB 2
#define WLAN_INT_STATUS_UART_LSB 2
#define WLAN_INT_STATUS_UART_MASK 0x00000004
#define WLAN_INT_STATUS_UART_GET(x) (((x)&WLAN_INT_STATUS_UART_MASK) >> WLAN_INT_STATUS_UART_LSB)
#define WLAN_INT_STATUS_UART_SET(x) (((x) << WLAN_INT_STATUS_UART_LSB) & WLAN_INT_STATUS_UART_MASK)
#define WLAN_INT_STATUS_ERROR_MSB 1
#define WLAN_INT_STATUS_ERROR_LSB 1
#define WLAN_INT_STATUS_ERROR_MASK 0x00000002
#define WLAN_INT_STATUS_ERROR_GET(x) (((x)&WLAN_INT_STATUS_ERROR_MASK) >> WLAN_INT_STATUS_ERROR_LSB)
#define WLAN_INT_STATUS_ERROR_SET(x) (((x) << WLAN_INT_STATUS_ERROR_LSB) & WLAN_INT_STATUS_ERROR_MASK)
#define WLAN_INT_STATUS_WDT_INT_MSB 0
#define WLAN_INT_STATUS_WDT_INT_LSB 0
#define WLAN_INT_STATUS_WDT_INT_MASK 0x00000001
#define WLAN_INT_STATUS_WDT_INT_GET(x) (((x)&WLAN_INT_STATUS_WDT_INT_MASK) >> WLAN_INT_STATUS_WDT_INT_LSB)
#define WLAN_INT_STATUS_WDT_INT_SET(x) (((x) << WLAN_INT_STATUS_WDT_INT_LSB) & WLAN_INT_STATUS_WDT_INT_MASK)

#define WLAN_LF_TIMER0_ADDRESS 0x00000048
#define WLAN_LF_TIMER0_OFFSET 0x00000048
#define WLAN_LF_TIMER0_TARGET_MSB 31
#define WLAN_LF_TIMER0_TARGET_LSB 0
#define WLAN_LF_TIMER0_TARGET_MASK 0xffffffff
#define WLAN_LF_TIMER0_TARGET_GET(x) (((x)&WLAN_LF_TIMER0_TARGET_MASK) >> WLAN_LF_TIMER0_TARGET_LSB)
#define WLAN_LF_TIMER0_TARGET_SET(x) (((x) << WLAN_LF_TIMER0_TARGET_LSB) & WLAN_LF_TIMER0_TARGET_MASK)

#define WLAN_LF_TIMER_COUNT0_ADDRESS 0x0000004c
#define WLAN_LF_TIMER_COUNT0_OFFSET 0x0000004c
#define WLAN_LF_TIMER_COUNT0_VALUE_MSB 31
#define WLAN_LF_TIMER_COUNT0_VALUE_LSB 0
#define WLAN_LF_TIMER_COUNT0_VALUE_MASK 0xffffffff
#define WLAN_LF_TIMER_COUNT0_VALUE_GET(x) (((x)&WLAN_LF_TIMER_COUNT0_VALUE_MASK) >> WLAN_LF_TIMER_COUNT0_VALUE_LSB)
#define WLAN_LF_TIMER_COUNT0_VALUE_SET(x) (((x) << WLAN_LF_TIMER_COUNT0_VALUE_LSB) & WLAN_LF_TIMER_COUNT0_VALUE_MASK)

#define WLAN_LF_TIMER_CONTROL0_ADDRESS 0x00000050
#define WLAN_LF_TIMER_CONTROL0_OFFSET 0x00000050
#define WLAN_LF_TIMER_CONTROL0_ENABLE_MSB 2
#define WLAN_LF_TIMER_CONTROL0_ENABLE_LSB 2
#define WLAN_LF_TIMER_CONTROL0_ENABLE_MASK 0x00000004
#define WLAN_LF_TIMER_CONTROL0_ENABLE_GET(x) \
    (((x)&WLAN_LF_TIMER_CONTROL0_ENABLE_MASK) >> WLAN_LF_TIMER_CONTROL0_ENABLE_LSB)
#define WLAN_LF_TIMER_CONTROL0_ENABLE_SET(x) \
    (((x) << WLAN_LF_TIMER_CONTROL0_ENABLE_LSB) & WLAN_LF_TIMER_CONTROL0_ENABLE_MASK)
#define WLAN_LF_TIMER_CONTROL0_AUTO_RESTART_MSB 1
#define WLAN_LF_TIMER_CONTROL0_AUTO_RESTART_LSB 1
#define WLAN_LF_TIMER_CONTROL0_AUTO_RESTART_MASK 0x00000002
#define WLAN_LF_TIMER_CONTROL0_AUTO_RESTART_GET(x) \
    (((x)&WLAN_LF_TIMER_CONTROL0_AUTO_RESTART_MASK) >> WLAN_LF_TIMER_CONTROL0_AUTO_RESTART_LSB)
#define WLAN_LF_TIMER_CONTROL0_AUTO_RESTART_SET(x) \
    (((x) << WLAN_LF_TIMER_CONTROL0_AUTO_RESTART_LSB) & WLAN_LF_TIMER_CONTROL0_AUTO_RESTART_MASK)
#define WLAN_LF_TIMER_CONTROL0_RESET_MSB 0
#define WLAN_LF_TIMER_CONTROL0_RESET_LSB 0
#define WLAN_LF_TIMER_CONTROL0_RESET_MASK 0x00000001
#define WLAN_LF_TIMER_CONTROL0_RESET_GET(x) \
    (((x)&WLAN_LF_TIMER_CONTROL0_RESET_MASK) >> WLAN_LF_TIMER_CONTROL0_RESET_LSB)
#define WLAN_LF_TIMER_CONTROL0_RESET_SET(x) \
    (((x) << WLAN_LF_TIMER_CONTROL0_RESET_LSB) & WLAN_LF_TIMER_CONTROL0_RESET_MASK)

#define WLAN_LF_TIMER_STATUS0_ADDRESS 0x00000054
#define WLAN_LF_TIMER_STATUS0_OFFSET 0x00000054
#define WLAN_LF_TIMER_STATUS0_INTERRUPT_MSB 0
#define WLAN_LF_TIMER_STATUS0_INTERRUPT_LSB 0
#define WLAN_LF_TIMER_STATUS0_INTERRUPT_MASK 0x00000001
#define WLAN_LF_TIMER_STATUS0_INTERRUPT_GET(x) \
    (((x)&WLAN_LF_TIMER_STATUS0_INTERRUPT_MASK) >> WLAN_LF_TIMER_STATUS0_INTERRUPT_LSB)
#define WLAN_LF_TIMER_STATUS0_INTERRUPT_SET(x) \
    (((x) << WLAN_LF_TIMER_STATUS0_INTERRUPT_LSB) & WLAN_LF_TIMER_STATUS0_INTERRUPT_MASK)

#define WLAN_LF_TIMER1_ADDRESS 0x00000058
#define WLAN_LF_TIMER1_OFFSET 0x00000058
#define WLAN_LF_TIMER1_TARGET_MSB 31
#define WLAN_LF_TIMER1_TARGET_LSB 0
#define WLAN_LF_TIMER1_TARGET_MASK 0xffffffff
#define WLAN_LF_TIMER1_TARGET_GET(x) (((x)&WLAN_LF_TIMER1_TARGET_MASK) >> WLAN_LF_TIMER1_TARGET_LSB)
#define WLAN_LF_TIMER1_TARGET_SET(x) (((x) << WLAN_LF_TIMER1_TARGET_LSB) & WLAN_LF_TIMER1_TARGET_MASK)

