alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw4.0/hw/hw40_rtc_wlan_reg.h
#define WLAN_HF_TIMER_COUNT_ADDRESS 0x0000008c
#define WLAN_HF_TIMER_COUNT_OFFSET 0x0000008c
#define WLAN_HF_TIMER_COUNT_VALUE_MSB 31
#define WLAN_HF_TIMER_COUNT_VALUE_LSB 12
#define WLAN_HF_TIMER_COUNT_VALUE_MASK 0xfffff000
#define WLAN_HF_TIMER_COUNT_VALUE_GET(x) (((x)&WLAN_HF_TIMER_COUNT_VALUE_MASK) >> WLAN_HF_TIMER_COUNT_VALUE_LSB)
#define WLAN_HF_TIMER_COUNT_VALUE_SET(x) (((x) << WLAN_HF_TIMER_COUNT_VALUE_LSB) & WLAN_HF_TIMER_COUNT_VALUE_MASK)

#define WLAN_HF_LF_COUNT_ADDRESS 0x00000090
#define WLAN_HF_LF_COUNT_OFFSET 0x00000090
#define WLAN_HF_LF_COUNT_VALUE_MSB 31
#define WLAN_HF_LF_COUNT_VALUE_LSB 0
#define WLAN_HF_LF_COUNT_VALUE_MASK 0xffffffff
#define WLAN_HF_LF_COUNT_VALUE_GET(x) (((x)&WLAN_HF_LF_COUNT_VALUE_MASK) >> WLAN_HF_LF_COUNT_VALUE_LSB)
#define WLAN_HF_LF_COUNT_VALUE_SET(x) (((x) << WLAN_HF_LF_COUNT_VALUE_LSB) & WLAN_HF_LF_COUNT_VALUE_MASK)

#define WLAN_HF_TIMER_CONTROL_ADDRESS 0x00000094
#define WLAN_HF_TIMER_CONTROL_OFFSET 0x00000094
#define WLAN_HF_TIMER_CONTROL_ENABLE_MSB 3
#define WLAN_HF_TIMER_CONTROL_ENABLE_LSB 3
#define WLAN_HF_TIMER_CONTROL_ENABLE_MASK 0x00000008
#define WLAN_HF_TIMER_CONTROL_ENABLE_GET(x) \
    (((x)&WLAN_HF_TIMER_CONTROL_ENABLE_MASK) >> WLAN_HF_TIMER_CONTROL_ENABLE_LSB)
#define WLAN_HF_TIMER_CONTROL_ENABLE_SET(x) \
    (((x) << WLAN_HF_TIMER_CONTROL_ENABLE_LSB) & WLAN_HF_TIMER_CONTROL_ENABLE_MASK)
#define WLAN_HF_TIMER_CONTROL_ON_MSB 2
#define WLAN_HF_TIMER_CONTROL_ON_LSB 2
#define WLAN_HF_TIMER_CONTROL_ON_MASK 0x00000004
#define WLAN_HF_TIMER_CONTROL_ON_GET(x) (((x)&WLAN_HF_TIMER_CONTROL_ON_MASK) >> WLAN_HF_TIMER_CONTROL_ON_LSB)
#define WLAN_HF_TIMER_CONTROL_ON_SET(x) (((x) << WLAN_HF_TIMER_CONTROL_ON_LSB) & WLAN_HF_TIMER_CONTROL_ON_MASK)
#define WLAN_HF_TIMER_CONTROL_AUTO_RESTART_MSB 1
#define WLAN_HF_TIMER_CONTROL_AUTO_RESTART_LSB 1
#define WLAN_HF_TIMER_CONTROL_AUTO_RESTART_MASK 0x00000002
#define WLAN_HF_TIMER_CONTROL_AUTO_RESTART_GET(x) \
    (((x)&WLAN_HF_TIMER_CONTROL_AUTO_RESTART_MASK) >> WLAN_HF_TIMER_CONTROL_AUTO_RESTART_LSB)
#define WLAN_HF_TIMER_CONTROL_AUTO_RESTART_SET(x) \
    (((x) << WLAN_HF_TIMER_CONTROL_AUTO_RESTART_LSB) & WLAN_HF_TIMER_CONTROL_AUTO_RESTART_MASK)
#define WLAN_HF_TIMER_CONTROL_RESET_MSB 0
#define WLAN_HF_TIMER_CONTROL_RESET_LSB 0
#define WLAN_HF_TIMER_CONTROL_RESET_MASK 0x00000001
#define WLAN_HF_TIMER_CONTROL_RESET_GET(x) (((x)&WLAN_HF_TIMER_CONTROL_RESET_MASK) >> WLAN_HF_TIMER_CONTROL_RESET_LSB)
#define WLAN_HF_TIMER_CONTROL_RESET_SET(x) (((x) << WLAN_HF_TIMER_CONTROL_RESET_LSB) & WLAN_HF_TIMER_CONTROL_RESET_MASK)

#define WLAN_HF_TIMER_STATUS_ADDRESS 0x00000098
#define WLAN_HF_TIMER_STATUS_OFFSET 0x00000098
#define WLAN_HF_TIMER_STATUS_INTERRUPT_MSB 0
#define WLAN_HF_TIMER_STATUS_INTERRUPT_LSB 0
#define WLAN_HF_TIMER_STATUS_INTERRUPT_MASK 0x00000001
#define WLAN_HF_TIMER_STATUS_INTERRUPT_GET(x) \
    (((x)&WLAN_HF_TIMER_STATUS_INTERRUPT_MASK) >> WLAN_HF_TIMER_STATUS_INTERRUPT_LSB)
#define WLAN_HF_TIMER_STATUS_INTERRUPT_SET(x) \
    (((x) << WLAN_HF_TIMER_STATUS_INTERRUPT_LSB) & WLAN_HF_TIMER_STATUS_INTERRUPT_MASK)

#define WLAN_RTC_CONTROL_ADDRESS 0x0000009c
#define WLAN_RTC_CONTROL_OFFSET 0x0000009c
#define WLAN_RTC_CONTROL_ENABLE_MSB 2
#define WLAN_RTC_CONTROL_ENABLE_LSB 2
#define WLAN_RTC_CONTROL_ENABLE_MASK 0x00000004
#define WLAN_RTC_CONTROL_ENABLE_GET(x) (((x)&WLAN_RTC_CONTROL_ENABLE_MASK) >> WLAN_RTC_CONTROL_ENABLE_LSB)
#define WLAN_RTC_CONTROL_ENABLE_SET(x) (((x) << WLAN_RTC_CONTROL_ENABLE_LSB) & WLAN_RTC_CONTROL_ENABLE_MASK)
#define WLAN_RTC_CONTROL_LOAD_RTC_MSB 1
#define WLAN_RTC_CONTROL_LOAD_RTC_LSB 1
#define WLAN_RTC_CONTROL_LOAD_RTC_MASK 0x00000002
#define WLAN_RTC_CONTROL_LOAD_RTC_GET(x) (((x)&WLAN_RTC_CONTROL_LOAD_RTC_MASK) >> WLAN_RTC_CONTROL_LOAD_RTC_LSB)
#define WLAN_RTC_CONTROL_LOAD_RTC_SET(x) (((x) << WLAN_RTC_CONTROL_LOAD_RTC_LSB) & WLAN_RTC_CONTROL_LOAD_RTC_MASK)
#define WLAN_RTC_CONTROL_LOAD_ALARM_MSB 0
#define WLAN_RTC_CONTROL_LOAD_ALARM_LSB 0
#define WLAN_RTC_CONTROL_LOAD_ALARM_MASK 0x00000001
#define WLAN_RTC_CONTROL_LOAD_ALARM_GET(x) (((x)&WLAN_RTC_CONTROL_LOAD_ALARM_MASK) >> WLAN_RTC_CONTROL_LOAD_ALARM_LSB)
#define WLAN_RTC_CONTROL_LOAD_ALARM_SET(x) (((x) << WLAN_RTC_CONTROL_LOAD_ALARM_LSB) & WLAN_RTC_CONTROL_LOAD_ALARM_MASK)

#define WLAN_RTC_TIME_ADDRESS 0x000000a0
#define WLAN_RTC_TIME_OFFSET 0x000000a0
#define WLAN_RTC_TIME_WEEK_DAY_MSB 26
#define WLAN_RTC_TIME_WEEK_DAY_LSB 24
#define WLAN_RTC_TIME_WEEK_DAY_MASK 0x07000000
#define WLAN_RTC_TIME_WEEK_DAY_GET(x) (((x)&WLAN_RTC_TIME_WEEK_DAY_MASK) >> WLAN_RTC_TIME_WEEK_DAY_LSB)
#define WLAN_RTC_TIME_WEEK_DAY_SET(x) (((x) << WLAN_RTC_TIME_WEEK_DAY_LSB) & WLAN_RTC_TIME_WEEK_DAY_MASK)
#define WLAN_RTC_TIME_HOUR_MSB 21
#define WLAN_RTC_TIME_HOUR_LSB 16
#define WLAN_RTC_TIME_HOUR_MASK 0x003f0000
#define WLAN_RTC_TIME_HOUR_GET(x) (((x)&WLAN_RTC_TIME_HOUR_MASK) >> WLAN_RTC_TIME_HOUR_LSB)
#define WLAN_RTC_TIME_HOUR_SET(x) (((x) << WLAN_RTC_TIME_HOUR_LSB) & WLAN_RTC_TIME_HOUR_MASK)
#define WLAN_RTC_TIME_MINUTE_MSB 14
#define WLAN_RTC_TIME_MINUTE_LSB 8
#define WLAN_RTC_TIME_MINUTE_MASK 0x00007f00
#define WLAN_RTC_TIME_MINUTE_GET(x) (((x)&WLAN_RTC_TIME_MINUTE_MASK) >> WLAN_RTC_TIME_MINUTE_LSB)
#define WLAN_RTC_TIME_MINUTE_SET(x) (((x) << WLAN_RTC_TIME_MINUTE_LSB) & WLAN_RTC_TIME_MINUTE_MASK)
#define WLAN_RTC_TIME_SECOND_MSB 6
#define WLAN_RTC_TIME_SECOND_LSB 0
#define WLAN_RTC_TIME_SECOND_MASK 0x0000007f
#define WLAN_RTC_TIME_SECOND_GET(x) (((x)&WLAN_RTC_TIME_SECOND_MASK) >> WLAN_RTC_TIME_SECOND_LSB)
#define WLAN_RTC_TIME_SECOND_SET(x) (((x) << WLAN_RTC_TIME_SECOND_LSB) & WLAN_RTC_TIME_SECOND_MASK)

#define WLAN_RTC_DATE_ADDRESS 0x000000a4
#define WLAN_RTC_DATE_OFFSET 0x000000a4
#define WLAN_RTC_DATE_YEAR_MSB 23
#define WLAN_RTC_DATE_YEAR_LSB 16
#define WLAN_RTC_DATE_YEAR_MASK 0x00ff0000
#define WLAN_RTC_DATE_YEAR_GET(x) (((x)&WLAN_RTC_DATE_YEAR_MASK) >> WLAN_RTC_DATE_YEAR_LSB)
#define WLAN_RTC_DATE_YEAR_SET(x) (((x) << WLAN_RTC_DATE_YEAR_LSB) & WLAN_RTC_DATE_YEAR_MASK)
#define WLAN_RTC_DATE_MONTH_MSB 12
#define WLAN_RTC_DATE_MONTH_LSB 8
#define WLAN_RTC_DATE_MONTH_MASK 0x00001f00
#define WLAN_RTC_DATE_MONTH_GET(x) (((x)&WLAN_RTC_DATE_MONTH_MASK) >> WLAN_RTC_DATE_MONTH_LSB)
#define WLAN_RTC_DATE_MONTH_SET(x) (((x) << WLAN_RTC_DATE_MONTH_LSB) & WLAN_RTC_DATE_MONTH_MASK)
#define WLAN_RTC_DATE_MONTH_DAY_MSB 5
#define WLAN_RTC_DATE_MONTH_DAY_LSB 0
#define WLAN_RTC_DATE_MONTH_DAY_MASK 0x0000003f
#define WLAN_RTC_DATE_MONTH_DAY_GET(x) (((x)&WLAN_RTC_DATE_MONTH_DAY_MASK) >> WLAN_RTC_DATE_MONTH_DAY_LSB)
#define WLAN_RTC_DATE_MONTH_DAY_SET(x) (((x) << WLAN_RTC_DATE_MONTH_DAY_LSB) & WLAN_RTC_DATE_MONTH_DAY_MASK)

#define WLAN_RTC_SET_TIME_ADDRESS 0x000000a8
#define WLAN_RTC_SET_TIME_OFFSET 0x000000a8
#define WLAN_RTC_SET_TIME_WEEK_DAY_MSB 26
#define WLAN_RTC_SET_TIME_WEEK_DAY_LSB 24
#define WLAN_RTC_SET_TIME_WEEK_DAY_MASK 0x07000000
#define WLAN_RTC_SET_TIME_WEEK_DAY_GET(x) (((x)&WLAN_RTC_SET_TIME_WEEK_DAY_MASK) >> WLAN_RTC_SET_TIME_WEEK_DAY_LSB)
#define WLAN_RTC_SET_TIME_WEEK_DAY_SET(x) (((x) << WLAN_RTC_SET_TIME_WEEK_DAY_LSB) & WLAN_RTC_SET_TIME_WEEK_DAY_MASK)
#define WLAN_RTC_SET_TIME_HOUR_MSB 21
#define WLAN_RTC_SET_TIME_HOUR_LSB 16
#define WLAN_RTC_SET_TIME_HOUR_MASK 0x003f0000
#define WLAN_RTC_SET_TIME_HOUR_GET(x) (((x)&WLAN_RTC_SET_TIME_HOUR_MASK) >> WLAN_RTC_SET_TIME_HOUR_LSB)
#define WLAN_RTC_SET_TIME_HOUR_SET(x) (((x) << WLAN_RTC_SET_TIME_HOUR_LSB) & WLAN_RTC_SET_TIME_HOUR_MASK)
#define WLAN_RTC_SET_TIME_MINUTE_MSB 14
#define WLAN_RTC_SET_TIME_MINUTE_LSB 8
#define WLAN_RTC_SET_TIME_MINUTE_MASK 0x00007f00
#define WLAN_RTC_SET_TIME_MINUTE_GET(x) (((x)&WLAN_RTC_SET_TIME_MINUTE_MASK) >> WLAN_RTC_SET_TIME_MINUTE_LSB)
#define WLAN_RTC_SET_TIME_MINUTE_SET(x) (((x) << WLAN_RTC_SET_TIME_MINUTE_LSB) & WLAN_RTC_SET_TIME_MINUTE_MASK)
#define WLAN_RTC_SET_TIME_SECOND_MSB 6
#define WLAN_RTC_SET_TIME_SECOND_LSB 0
#define WLAN_RTC_SET_TIME_SECOND_MASK 0x0000007f
#define WLAN_RTC_SET_TIME_SECOND_GET(x) (((x)&WLAN_RTC_SET_TIME_SECOND_MASK) >> WLAN_RTC_SET_TIME_SECOND_LSB)
#define WLAN_RTC_SET_TIME_SECOND_SET(x) (((x) << WLAN_RTC_SET_TIME_SECOND_LSB) & WLAN_RTC_SET_TIME_SECOND_MASK)

#define WLAN_RTC_SET_DATE_ADDRESS 0x000000ac
#define WLAN_RTC_SET_DATE_OFFSET 0x000000ac
#define WLAN_RTC_SET_DATE_YEAR_MSB 23
#define WLAN_RTC_SET_DATE_YEAR_LSB 16
#define WLAN_RTC_SET_DATE_YEAR_MASK 0x00ff0000
#define WLAN_RTC_SET_DATE_YEAR_GET(x) (((x)&WLAN_RTC_SET_DATE_YEAR_MASK) >> WLAN_RTC_SET_DATE_YEAR_LSB)
#define WLAN_RTC_SET_DATE_YEAR_SET(x) (((x) << WLAN_RTC_SET_DATE_YEAR_LSB) & WLAN_RTC_SET_DATE_YEAR_MASK)
#define WLAN_RTC_SET_DATE_MONTH_MSB 12
#define WLAN_RTC_SET_DATE_MONTH_LSB 8
#define WLAN_RTC_SET_DATE_MONTH_MASK 0x00001f00
#define WLAN_RTC_SET_DATE_MONTH_GET(x) (((x)&WLAN_RTC_SET_DATE_MONTH_MASK) >> WLAN_RTC_SET_DATE_MONTH_LSB)
#define WLAN_RTC_SET_DATE_MONTH_SET(x) (((x) << WLAN_RTC_SET_DATE_MONTH_LSB) & WLAN_RTC_SET_DATE_MONTH_MASK)
#define WLAN_RTC_SET_DATE_MONTH_DAY_MSB 5
#define WLAN_RTC_SET_DATE_MONTH_DAY_LSB 0
#define WLAN_RTC_SET_DATE_MONTH_DAY_MASK 0x0000003f
#define WLAN_RTC_SET_DATE_MONTH_DAY_GET(x) (((x)&WLAN_RTC_SET_DATE_MONTH_DAY_MASK) >> WLAN_RTC_SET_DATE_MONTH_DAY_LSB)
#define WLAN_RTC_SET_DATE_MONTH_DAY_SET(x) (((x) << WLAN_RTC_SET_DATE_MONTH_DAY_LSB) & WLAN_RTC_SET_DATE_MONTH_DAY_MASK)

#define WLAN_RTC_SET_ALARM_ADDRESS 0x000000b0
#define WLAN_RTC_SET_ALARM_OFFSET 0x000000b0
#define WLAN_RTC_SET_ALARM_HOUR_MSB 21
#define WLAN_RTC_SET_ALARM_HOUR_LSB 16
#define WLAN_RTC_SET_ALARM_HOUR_MASK 0x003f0000
#define WLAN_RTC_SET_ALARM_HOUR_GET(x) (((x)&WLAN_RTC_SET_ALARM_HOUR_MASK) >> WLAN_RTC_SET_ALARM_HOUR_LSB)
#define WLAN_RTC_SET_ALARM_HOUR_SET(x) (((x) << WLAN_RTC_SET_ALARM_HOUR_LSB) & WLAN_RTC_SET_ALARM_HOUR_MASK)
#define WLAN_RTC_SET_ALARM_MINUTE_MSB 14
#define WLAN_RTC_SET_ALARM_MINUTE_LSB 8
#define WLAN_RTC_SET_ALARM_MINUTE_MASK 0x00007f00
#define WLAN_RTC_SET_ALARM_MINUTE_GET(x) (((x)&WLAN_RTC_SET_ALARM_MINUTE_MASK) >> WLAN_RTC_SET_ALARM_MINUTE_LSB)
#define WLAN_RTC_SET_ALARM_MINUTE_SET(x) (((x) << WLAN_RTC_SET_ALARM_MINUTE_LSB) & WLAN_RTC_SET_ALARM_MINUTE_MASK)
#define WLAN_RTC_SET_ALARM_SECOND_MSB 6
#define WLAN_RTC_SET_ALARM_SECOND_LSB 0
#define WLAN_RTC_SET_ALARM_SECOND_MASK 0x0000007f
#define WLAN_RTC_SET_ALARM_SECOND_GET(x) (((x)&WLAN_RTC_SET_ALARM_SECOND_MASK) >> WLAN_RTC_SET_ALARM_SECOND_LSB)
#define WLAN_RTC_SET_ALARM_SECOND_SET(x) (((x) << WLAN_RTC_SET_ALARM_SECOND_LSB) & WLAN_RTC_SET_ALARM_SECOND_MASK)

#define WLAN_RTC_CONFIG_ADDRESS 0x000000b4
#define WLAN_RTC_CONFIG_OFFSET 0x000000b4
#define WLAN_RTC_CONFIG_BCD_MSB 2
#define WLAN_RTC_CONFIG_BCD_LSB 2
#define WLAN_RTC_CONFIG_BCD_MASK 0x00000004
#define WLAN_RTC_CONFIG_BCD_GET(x) (((x)&WLAN_RTC_CONFIG_BCD_MASK) >> WLAN_RTC_CONFIG_BCD_LSB)
#define WLAN_RTC_CONFIG_BCD_SET(x) (((x) << WLAN_RTC_CONFIG_BCD_LSB) & WLAN_RTC_CONFIG_BCD_MASK)
#define WLAN_RTC_CONFIG_TWELVE_HOUR_MSB 1
#define WLAN_RTC_CONFIG_TWELVE_HOUR_LSB 1
#define WLAN_RTC_CONFIG_TWELVE_HOUR_MASK 0x00000002
#define WLAN_RTC_CONFIG_TWELVE_HOUR_GET(x) (((x)&WLAN_RTC_CONFIG_TWELVE_HOUR_MASK) >> WLAN_RTC_CONFIG_TWELVE_HOUR_LSB)
#define WLAN_RTC_CONFIG_TWELVE_HOUR_SET(x) (((x) << WLAN_RTC_CONFIG_TWELVE_HOUR_LSB) & WLAN_RTC_CONFIG_TWELVE_HOUR_MASK)
#define WLAN_RTC_CONFIG_DSE_MSB 0
#define WLAN_RTC_CONFIG_DSE_LSB 0
#define WLAN_RTC_CONFIG_DSE_MASK 0x00000001
#define WLAN_RTC_CONFIG_DSE_GET(x) (((x)&WLAN_RTC_CONFIG_DSE_MASK) >> WLAN_RTC_CONFIG_DSE_LSB)
#define WLAN_RTC_CONFIG_DSE_SET(x) (((x) << WLAN_RTC_CONFIG_DSE_LSB) & WLAN_RTC_CONFIG_DSE_MASK)

#define WLAN_RTC_ALARM_STATUS_ADDRESS 0x000000b8
#define WLAN_RTC_ALARM_STATUS_OFFSET 0x000000b8
#define WLAN_RTC_ALARM_STATUS_ENABLE_MSB 1
#define WLAN_RTC_ALARM_STATUS_ENABLE_LSB 1
#define WLAN_RTC_ALARM_STATUS_ENABLE_MASK 0x00000002
#define WLAN_RTC_ALARM_STATUS_ENABLE_GET(x) \
    (((x)&WLAN_RTC_ALARM_STATUS_ENABLE_MASK) >> WLAN_RTC_ALARM_STATUS_ENABLE_LSB)
#define WLAN_RTC_ALARM_STATUS_ENABLE_SET(x) \
    (((x) << WLAN_RTC_ALARM_STATUS_ENABLE_LSB) & WLAN_RTC_ALARM_STATUS_ENABLE_MASK)
#define WLAN_RTC_ALARM_STATUS_INTERRUPT_MSB 0
#define WLAN_RTC_ALARM_STATUS_INTERRUPT_LSB 0
#define WLAN_RTC_ALARM_STATUS_INTERRUPT_MASK 0x00000001
#define WLAN_RTC_ALARM_STATUS_INTERRUPT_GET(x) \
    (((x)&WLAN_RTC_ALARM_STATUS_INTERRUPT_MASK) >> WLAN_RTC_ALARM_STATUS_INTERRUPT_LSB)
#define WLAN_RTC_ALARM_STATUS_INTERRUPT_SET(x) \
    (((x) << WLAN_RTC_ALARM_STATUS_INTERRUPT_LSB) & WLAN_RTC_ALARM_STATUS_INTERRUPT_MASK)

#define WLAN_UART_WAKEUP_ADDRESS 0x000000bc
#define WLAN_UART_WAKEUP_OFFSET 0x000000bc
#define WLAN_UART_WAKEUP_ENABLE_MSB 0
#define WLAN_UART_WAKEUP_ENABLE_LSB 0
#define WLAN_UART_WAKEUP_ENABLE_MASK 0x00000001
#define WLAN_UART_WAKEUP_ENABLE_GET(x) (((x)&WLAN_UART_WAKEUP_ENABLE_MASK) >> WLAN_UART_WAKEUP_ENABLE_LSB)
#define WLAN_UART_WAKEUP_ENABLE_SET(x) (((x) << WLAN_UART_WAKEUP_ENABLE_LSB) & WLAN_UART_WAKEUP_ENABLE_MASK)

#define WLAN_RESET_CAUSE_ADDRESS 0x000000c0
#define WLAN_RESET_CAUSE_OFFSET 0x000000c0
#define WLAN_RESET_CAUSE_LAST_MSB 2
#define WLAN_RESET_CAUSE_LAST_LSB 0
#define WLAN_RESET_CAUSE_LAST_MASK 0x00000007
#define WLAN_RESET_CAUSE_LAST_GET(x) (((x)&WLAN_RESET_CAUSE_LAST_MASK) >> WLAN_RESET_CAUSE_LAST_LSB)
#define WLAN_RESET_CAUSE_LAST_SET(x) (((x) << WLAN_RESET_CAUSE_LAST_LSB) & WLAN_RESET_CAUSE_LAST_MASK)

#define WLAN_SYSTEM_SLEEP_ADDRESS 0x000000c4
#define WLAN_SYSTEM_SLEEP_OFFSET 0x000000c4
#define WLAN_SYSTEM_SLEEP_HOST_IF_MSB 4
#define WLAN_SYSTEM_SLEEP_HOST_IF_LSB 4
#define WLAN_SYSTEM_SLEEP_HOST_IF_MASK 0x00000010
#define WLAN_SYSTEM_SLEEP_HOST_IF_GET(x) (((x)&WLAN_SYSTEM_SLEEP_HOST_IF_MASK) >> WLAN_SYSTEM_SLEEP_HOST_IF_LSB)
#define WLAN_SYSTEM_SLEEP_HOST_IF_SET(x) (((x) << WLAN_SYSTEM_SLEEP_HOST_IF_LSB) & WLAN_SYSTEM_SLEEP_HOST_IF_MASK)
#define WLAN_SYSTEM_SLEEP_MBOX_MSB 3
#define WLAN_SYSTEM_SLEEP_MBOX_LSB 3
#define WLAN_SYSTEM_SLEEP_MBOX_MASK 0x00000008
#define WLAN_SYSTEM_SLEEP_MBOX_GET(x) (((x)&WLAN_SYSTEM_SLEEP_MBOX_MASK) >> WLAN_SYSTEM_SLEEP_MBOX_LSB)
#define WLAN_SYSTEM_SLEEP_MBOX_SET(x) (((x) << WLAN_SYSTEM_SLEEP_MBOX_LSB) & WLAN_SYSTEM_SLEEP_MBOX_MASK)
#define WLAN_SYSTEM_SLEEP_MAC_IF_MSB 2
#define WLAN_SYSTEM_SLEEP_MAC_IF_LSB 2
#define WLAN_SYSTEM_SLEEP_MAC_IF_MASK 0x00000004
#define WLAN_SYSTEM_SLEEP_MAC_IF_GET(x) (((x)&WLAN_SYSTEM_SLEEP_MAC_IF_MASK) >> WLAN_SYSTEM_SLEEP_MAC_IF_LSB)
#define WLAN_SYSTEM_SLEEP_MAC_IF_SET(x) (((x) << WLAN_SYSTEM_SLEEP_MAC_IF_LSB) & WLAN_SYSTEM_SLEEP_MAC_IF_MASK)
#define WLAN_SYSTEM_SLEEP_LIGHT_MSB 1
#define WLAN_SYSTEM_SLEEP_LIGHT_LSB 1
#define WLAN_SYSTEM_SLEEP_LIGHT_MASK 0x00000002
#define WLAN_SYSTEM_SLEEP_LIGHT_GET(x) (((x)&WLAN_SYSTEM_SLEEP_LIGHT_MASK) >> WLAN_SYSTEM_SLEEP_LIGHT_LSB)
#define WLAN_SYSTEM_SLEEP_LIGHT_SET(x) (((x) << WLAN_SYSTEM_SLEEP_LIGHT_LSB) & WLAN_SYSTEM_SLEEP_LIGHT_MASK)
#define WLAN_SYSTEM_SLEEP_DISABLE_MSB 0
#define WLAN_SYSTEM_SLEEP_DISABLE_LSB 0
#define WLAN_SYSTEM_SLEEP_DISABLE_MASK 0x00000001
#define WLAN_SYSTEM_SLEEP_DISABLE_GET(x) (((x)&WLAN_SYSTEM_SLEEP_DISABLE_MASK) >> WLAN_SYSTEM_SLEEP_DISABLE_LSB)
#define WLAN_SYSTEM_SLEEP_DISABLE_SET(x) (((x) << WLAN_SYSTEM_SLEEP_DISABLE_LSB) & WLAN_SYSTEM_SLEEP_DISABLE_MASK)

#define WLAN_SDIO_WRAPPER_ADDRESS 0x000000c8
#define WLAN_SDIO_WRAPPER_OFFSET 0x000000c8
#define WLAN_SDIO_WRAPPER_SLEEP_MSB 3
#define WLAN_SDIO_WRAPPER_SLEEP_LSB 3
#define WLAN_SDIO_WRAPPER_SLEEP_MASK 0x00000008
#define WLAN_SDIO_WRAPPER_SLEEP_GET(x) (((x)&WLAN_SDIO_WRAPPER_SLEEP_MASK) >> WLAN_SDIO_WRAPPER_SLEEP_LSB)
#define WLAN_SDIO_WRAPPER_SLEEP_SET(x) (((x) << WLAN_SDIO_WRAPPER_SLEEP_LSB) & WLAN_SDIO_WRAPPER_SLEEP_MASK)
#define WLAN_SDIO_WRAPPER_WAKEUP_MSB 2
#define WLAN_SDIO_WRAPPER_WAKEUP_LSB 2
#define WLAN_SDIO_WRAPPER_WAKEUP_MASK 0x00000004
#define WLAN_SDIO_WRAPPER_WAKEUP_GET(x) (((x)&WLAN_SDIO_WRAPPER_WAKEUP_MASK) >> WLAN_SDIO_WRAPPER_WAKEUP_LSB)
#define WLAN_SDIO_WRAPPER_WAKEUP_SET(x) (((x) << WLAN_SDIO_WRAPPER_WAKEUP_LSB) & WLAN_SDIO_WRAPPER_WAKEUP_MASK)
#define WLAN_SDIO_WRAPPER_SOC_ON_MSB 1
#define WLAN_SDIO_WRAPPER_SOC_ON_LSB 1
#define WLAN_SDIO_WRAPPER_SOC_ON_MASK 0x00000002
#define WLAN_SDIO_WRAPPER_SOC_ON_GET(x) (((x)&WLAN_SDIO_WRAPPER_SOC_ON_MASK) >> WLAN_SDIO_WRAPPER_SOC_ON_LSB)
#define WLAN_SDIO_WRAPPER_SOC_ON_SET(x) (((x) << WLAN_SDIO_WRAPPER_SOC_ON_LSB) & WLAN_SDIO_WRAPPER_SOC_ON_MASK)
#define WLAN_SDIO_WRAPPER_ON_MSB 0
#define WLAN_SDIO_WRAPPER_ON_LSB 0
#define WLAN_SDIO_WRAPPER_ON_MASK 0x00000001
#define WLAN_SDIO_WRAPPER_ON_GET(x) (((x)&WLAN_SDIO_WRAPPER_ON_MASK) >> WLAN_SDIO_WRAPPER_ON_LSB)
#define WLAN_SDIO_WRAPPER_ON_SET(x) (((x) << WLAN_SDIO_WRAPPER_ON_LSB) & WLAN_SDIO_WRAPPER_ON_MASK)

#define WLAN_MAC_SLEEP_CONTROL_ADDRESS 0x000000cc
#define WLAN_MAC_SLEEP_CONTROL_OFFSET 0x000000cc
#define WLAN_MAC_SLEEP_CONTROL_ENABLE_MSB 1
#define WLAN_MAC_SLEEP_CONTROL_ENABLE_LSB 0
#define WLAN_MAC_SLEEP_CONTROL_ENABLE_MASK 0x00000003
#define WLAN_MAC_SLEEP_CONTROL_ENABLE_GET(x) \
    (((x)&WLAN_MAC_SLEEP_CONTROL_ENABLE_MASK) >> WLAN_MAC_SLEEP_CONTROL_ENABLE_LSB)
#define WLAN_MAC_SLEEP_CONTROL_ENABLE_SET(x) \
    (((x) << WLAN_MAC_SLEEP_CONTROL_ENABLE_LSB) & WLAN_MAC_SLEEP_CONTROL_ENABLE_MASK)

