alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw4.0/hw/hw40_rtc_wlan_reg.h
#define WLAN_KEEP_AWAKE_ADDRESS 0x000000d0
#define WLAN_KEEP_AWAKE_OFFSET 0x000000d0
#define WLAN_KEEP_AWAKE_COUNT_MSB 7
#define WLAN_KEEP_AWAKE_COUNT_LSB 0
#define WLAN_KEEP_AWAKE_COUNT_MASK 0x000000ff
#define WLAN_KEEP_AWAKE_COUNT_GET(x) (((x)&WLAN_KEEP_AWAKE_COUNT_MASK) >> WLAN_KEEP_AWAKE_COUNT_LSB)
#define WLAN_KEEP_AWAKE_COUNT_SET(x) (((x) << WLAN_KEEP_AWAKE_COUNT_LSB) & WLAN_KEEP_AWAKE_COUNT_MASK)

#define WLAN_LPO_CAL_TIME_ADDRESS 0x000000d4
#define WLAN_LPO_CAL_TIME_OFFSET 0x000000d4
#define WLAN_LPO_CAL_TIME_LENGTH_MSB 13
#define WLAN_LPO_CAL_TIME_LENGTH_LSB 0
#define WLAN_LPO_CAL_TIME_LENGTH_MASK 0x00003fff
#define WLAN_LPO_CAL_TIME_LENGTH_GET(x) (((x)&WLAN_LPO_CAL_TIME_LENGTH_MASK) >> WLAN_LPO_CAL_TIME_LENGTH_LSB)
#define WLAN_LPO_CAL_TIME_LENGTH_SET(x) (((x) << WLAN_LPO_CAL_TIME_LENGTH_LSB) & WLAN_LPO_CAL_TIME_LENGTH_MASK)

#define WLAN_LPO_INIT_DIVIDEND_INT_ADDRESS 0x000000d8
#define WLAN_LPO_INIT_DIVIDEND_INT_OFFSET 0x000000d8
#define WLAN_LPO_INIT_DIVIDEND_INT_VALUE_MSB 23
#define WLAN_LPO_INIT_DIVIDEND_INT_VALUE_LSB 0
#define WLAN_LPO_INIT_DIVIDEND_INT_VALUE_MASK 0x00ffffff
#define WLAN_LPO_INIT_DIVIDEND_INT_VALUE_GET(x) \
    (((x)&WLAN_LPO_INIT_DIVIDEND_INT_VALUE_MASK) >> WLAN_LPO_INIT_DIVIDEND_INT_VALUE_LSB)
#define WLAN_LPO_INIT_DIVIDEND_INT_VALUE_SET(x) \
    (((x) << WLAN_LPO_INIT_DIVIDEND_INT_VALUE_LSB) & WLAN_LPO_INIT_DIVIDEND_INT_VALUE_MASK)

#define WLAN_LPO_INIT_DIVIDEND_FRACTION_ADDRESS 0x000000dc
#define WLAN_LPO_INIT_DIVIDEND_FRACTION_OFFSET 0x000000dc
#define WLAN_LPO_INIT_DIVIDEND_FRACTION_VALUE_MSB 10
#define WLAN_LPO_INIT_DIVIDEND_FRACTION_VALUE_LSB 0
#define WLAN_LPO_INIT_DIVIDEND_FRACTION_VALUE_MASK 0x000007ff
#define WLAN_LPO_INIT_DIVIDEND_FRACTION_VALUE_GET(x) \
    (((x)&WLAN_LPO_INIT_DIVIDEND_FRACTION_VALUE_MASK) >> WLAN_LPO_INIT_DIVIDEND_FRACTION_VALUE_LSB)
#define WLAN_LPO_INIT_DIVIDEND_FRACTION_VALUE_SET(x) \
    (((x) << WLAN_LPO_INIT_DIVIDEND_FRACTION_VALUE_LSB) & WLAN_LPO_INIT_DIVIDEND_FRACTION_VALUE_MASK)

#define WLAN_LPO_CAL_ADDRESS 0x000000e0
#define WLAN_LPO_CAL_OFFSET 0x000000e0
#define WLAN_LPO_CAL_ENABLE_MSB 20
#define WLAN_LPO_CAL_ENABLE_LSB 20
#define WLAN_LPO_CAL_ENABLE_MASK 0x00100000
#define WLAN_LPO_CAL_ENABLE_GET(x) (((x)&WLAN_LPO_CAL_ENABLE_MASK) >> WLAN_LPO_CAL_ENABLE_LSB)
#define WLAN_LPO_CAL_ENABLE_SET(x) (((x) << WLAN_LPO_CAL_ENABLE_LSB) & WLAN_LPO_CAL_ENABLE_MASK)
#define WLAN_LPO_CAL_COUNT_MSB 19
#define WLAN_LPO_CAL_COUNT_LSB 0
#define WLAN_LPO_CAL_COUNT_MASK 0x000fffff
#define WLAN_LPO_CAL_COUNT_GET(x) (((x)&WLAN_LPO_CAL_COUNT_MASK) >> WLAN_LPO_CAL_COUNT_LSB)
#define WLAN_LPO_CAL_COUNT_SET(x) (((x) << WLAN_LPO_CAL_COUNT_LSB) & WLAN_LPO_CAL_COUNT_MASK)

#define WLAN_LPO_CAL_TEST_CONTROL_ADDRESS 0x000000e4
#define WLAN_LPO_CAL_TEST_CONTROL_OFFSET 0x000000e4
#define WLAN_LPO_CAL_TEST_CONTROL_ENABLE_MSB 5
#define WLAN_LPO_CAL_TEST_CONTROL_ENABLE_LSB 5
#define WLAN_LPO_CAL_TEST_CONTROL_ENABLE_MASK 0x00000020
#define WLAN_LPO_CAL_TEST_CONTROL_ENABLE_GET(x) \
    (((x)&WLAN_LPO_CAL_TEST_CONTROL_ENABLE_MASK) >> WLAN_LPO_CAL_TEST_CONTROL_ENABLE_LSB)
#define WLAN_LPO_CAL_TEST_CONTROL_ENABLE_SET(x) \
    (((x) << WLAN_LPO_CAL_TEST_CONTROL_ENABLE_LSB) & WLAN_LPO_CAL_TEST_CONTROL_ENABLE_MASK)
#define WLAN_LPO_CAL_TEST_CONTROL_RTC_CYCLES_MSB 4
#define WLAN_LPO_CAL_TEST_CONTROL_RTC_CYCLES_LSB 0
#define WLAN_LPO_CAL_TEST_CONTROL_RTC_CYCLES_MASK 0x0000001f
#define WLAN_LPO_CAL_TEST_CONTROL_RTC_CYCLES_GET(x) \
    (((x)&WLAN_LPO_CAL_TEST_CONTROL_RTC_CYCLES_MASK) >> WLAN_LPO_CAL_TEST_CONTROL_RTC_CYCLES_LSB)
#define WLAN_LPO_CAL_TEST_CONTROL_RTC_CYCLES_SET(x) \
    (((x) << WLAN_LPO_CAL_TEST_CONTROL_RTC_CYCLES_LSB) & WLAN_LPO_CAL_TEST_CONTROL_RTC_CYCLES_MASK)

#define WLAN_LPO_CAL_TEST_STATUS_ADDRESS 0x000000e8
#define WLAN_LPO_CAL_TEST_STATUS_OFFSET 0x000000e8
#define WLAN_LPO_CAL_TEST_STATUS_READY_MSB 16
#define WLAN_LPO_CAL_TEST_STATUS_READY_LSB 16
#define WLAN_LPO_CAL_TEST_STATUS_READY_MASK 0x00010000
#define WLAN_LPO_CAL_TEST_STATUS_READY_GET(x) \
    (((x)&WLAN_LPO_CAL_TEST_STATUS_READY_MASK) >> WLAN_LPO_CAL_TEST_STATUS_READY_LSB)
#define WLAN_LPO_CAL_TEST_STATUS_READY_SET(x) \
    (((x) << WLAN_LPO_CAL_TEST_STATUS_READY_LSB) & WLAN_LPO_CAL_TEST_STATUS_READY_MASK)
#define WLAN_LPO_CAL_TEST_STATUS_COUNT_MSB 15
#define WLAN_LPO_CAL_TEST_STATUS_COUNT_LSB 0
#define WLAN_LPO_CAL_TEST_STATUS_COUNT_MASK 0x0000ffff
#define WLAN_LPO_CAL_TEST_STATUS_COUNT_GET(x) \
    (((x)&WLAN_LPO_CAL_TEST_STATUS_COUNT_MASK) >> WLAN_LPO_CAL_TEST_STATUS_COUNT_LSB)
#define WLAN_LPO_CAL_TEST_STATUS_COUNT_SET(x) \
    (((x) << WLAN_LPO_CAL_TEST_STATUS_COUNT_LSB) & WLAN_LPO_CAL_TEST_STATUS_COUNT_MASK)

#define WLAN_CHIP_ID_ADDRESS 0x000000ec
#define WLAN_CHIP_ID_OFFSET 0x000000ec
#define WLAN_CHIP_ID_DEVICE_ID_MSB 31
#define WLAN_CHIP_ID_DEVICE_ID_LSB 16
#define WLAN_CHIP_ID_DEVICE_ID_MASK 0xffff0000
#define WLAN_CHIP_ID_DEVICE_ID_GET(x) (((x)&WLAN_CHIP_ID_DEVICE_ID_MASK) >> WLAN_CHIP_ID_DEVICE_ID_LSB)
#define WLAN_CHIP_ID_DEVICE_ID_SET(x) (((x) << WLAN_CHIP_ID_DEVICE_ID_LSB) & WLAN_CHIP_ID_DEVICE_ID_MASK)
#define WLAN_CHIP_ID_CONFIG_ID_MSB 15
#define WLAN_CHIP_ID_CONFIG_ID_LSB 4
#define WLAN_CHIP_ID_CONFIG_ID_MASK 0x0000fff0
#define WLAN_CHIP_ID_CONFIG_ID_GET(x) (((x)&WLAN_CHIP_ID_CONFIG_ID_MASK) >> WLAN_CHIP_ID_CONFIG_ID_LSB)
#define WLAN_CHIP_ID_CONFIG_ID_SET(x) (((x) << WLAN_CHIP_ID_CONFIG_ID_LSB) & WLAN_CHIP_ID_CONFIG_ID_MASK)
#define WLAN_CHIP_ID_VERSION_ID_MSB 3
#define WLAN_CHIP_ID_VERSION_ID_LSB 0
#define WLAN_CHIP_ID_VERSION_ID_MASK 0x0000000f
#define WLAN_CHIP_ID_VERSION_ID_GET(x) (((x)&WLAN_CHIP_ID_VERSION_ID_MASK) >> WLAN_CHIP_ID_VERSION_ID_LSB)
#define WLAN_CHIP_ID_VERSION_ID_SET(x) (((x) << WLAN_CHIP_ID_VERSION_ID_LSB) & WLAN_CHIP_ID_VERSION_ID_MASK)

#define WLAN_DERIVED_RTC_CLK_ADDRESS 0x000000f0
#define WLAN_DERIVED_RTC_CLK_OFFSET 0x000000f0
#define WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_MSB 20
#define WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_LSB 20
#define WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_MASK 0x00100000
#define WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_GET(x) \
    (((x)&WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_MASK) >> WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_LSB)
#define WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_SET(x) \
    (((x) << WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_LSB) & WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_MASK)
#define WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_MSB 18
#define WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_LSB 18
#define WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_MASK 0x00040000
#define WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_GET(x) \
    (((x)&WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_MASK) >> WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_LSB)
#define WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_SET(x) \
    (((x) << WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_LSB) & WLAN_DERIVED_RTC_CLK_EXTERNAL_DETECT_MASK)
#define WLAN_DERIVED_RTC_CLK_FORCE_MSB 17
#define WLAN_DERIVED_RTC_CLK_FORCE_LSB 16
#define WLAN_DERIVED_RTC_CLK_FORCE_MASK 0x00030000
#define WLAN_DERIVED_RTC_CLK_FORCE_GET(x) (((x)&WLAN_DERIVED_RTC_CLK_FORCE_MASK) >> WLAN_DERIVED_RTC_CLK_FORCE_LSB)
#define WLAN_DERIVED_RTC_CLK_FORCE_SET(x) (((x) << WLAN_DERIVED_RTC_CLK_FORCE_LSB) & WLAN_DERIVED_RTC_CLK_FORCE_MASK)
#define WLAN_DERIVED_RTC_CLK_PERIOD_MSB 15
#define WLAN_DERIVED_RTC_CLK_PERIOD_LSB 1
#define WLAN_DERIVED_RTC_CLK_PERIOD_MASK 0x0000fffe
#define WLAN_DERIVED_RTC_CLK_PERIOD_GET(x) (((x)&WLAN_DERIVED_RTC_CLK_PERIOD_MASK) >> WLAN_DERIVED_RTC_CLK_PERIOD_LSB)
#define WLAN_DERIVED_RTC_CLK_PERIOD_SET(x) (((x) << WLAN_DERIVED_RTC_CLK_PERIOD_LSB) & WLAN_DERIVED_RTC_CLK_PERIOD_MASK)

#define MAC_PCU_SLP32_MODE_ADDRESS 0x000000f4
#define MAC_PCU_SLP32_MODE_OFFSET 0x000000f4
#define MAC_PCU_SLP32_MODE_TSF2_WRITE_STATUS_MSB 24
#define MAC_PCU_SLP32_MODE_TSF2_WRITE_STATUS_LSB 24
#define MAC_PCU_SLP32_MODE_TSF2_WRITE_STATUS_MASK 0x01000000
#define MAC_PCU_SLP32_MODE_TSF2_WRITE_STATUS_GET(x) \
    (((x)&MAC_PCU_SLP32_MODE_TSF2_WRITE_STATUS_MASK) >> MAC_PCU_SLP32_MODE_TSF2_WRITE_STATUS_LSB)
#define MAC_PCU_SLP32_MODE_TSF2_WRITE_STATUS_SET(x) \
    (((x) << MAC_PCU_SLP32_MODE_TSF2_WRITE_STATUS_LSB) & MAC_PCU_SLP32_MODE_TSF2_WRITE_STATUS_MASK)
#define MAC_PCU_SLP32_MODE_FORCE_BIAS_BLOCK_ON_MSB 23
#define MAC_PCU_SLP32_MODE_FORCE_BIAS_BLOCK_ON_LSB 23
#define MAC_PCU_SLP32_MODE_FORCE_BIAS_BLOCK_ON_MASK 0x00800000
#define MAC_PCU_SLP32_MODE_FORCE_BIAS_BLOCK_ON_GET(x) \
    (((x)&MAC_PCU_SLP32_MODE_FORCE_BIAS_BLOCK_ON_MASK) >> MAC_PCU_SLP32_MODE_FORCE_BIAS_BLOCK_ON_LSB)
#define MAC_PCU_SLP32_MODE_FORCE_BIAS_BLOCK_ON_SET(x) \
    (((x) << MAC_PCU_SLP32_MODE_FORCE_BIAS_BLOCK_ON_LSB) & MAC_PCU_SLP32_MODE_FORCE_BIAS_BLOCK_ON_MASK)
#define MAC_PCU_SLP32_MODE_DISABLE_32KHZ_MSB 22
#define MAC_PCU_SLP32_MODE_DISABLE_32KHZ_LSB 22
#define MAC_PCU_SLP32_MODE_DISABLE_32KHZ_MASK 0x00400000
#define MAC_PCU_SLP32_MODE_DISABLE_32KHZ_GET(x) \
    (((x)&MAC_PCU_SLP32_MODE_DISABLE_32KHZ_MASK) >> MAC_PCU_SLP32_MODE_DISABLE_32KHZ_LSB)
#define MAC_PCU_SLP32_MODE_DISABLE_32KHZ_SET(x) \
    (((x) << MAC_PCU_SLP32_MODE_DISABLE_32KHZ_LSB) & MAC_PCU_SLP32_MODE_DISABLE_32KHZ_MASK)
#define MAC_PCU_SLP32_MODE_TSF_WRITE_STATUS_MSB 21
#define MAC_PCU_SLP32_MODE_TSF_WRITE_STATUS_LSB 21
#define MAC_PCU_SLP32_MODE_TSF_WRITE_STATUS_MASK 0x00200000
#define MAC_PCU_SLP32_MODE_TSF_WRITE_STATUS_GET(x) \
    (((x)&MAC_PCU_SLP32_MODE_TSF_WRITE_STATUS_MASK) >> MAC_PCU_SLP32_MODE_TSF_WRITE_STATUS_LSB)
#define MAC_PCU_SLP32_MODE_TSF_WRITE_STATUS_SET(x) \
    (((x) << MAC_PCU_SLP32_MODE_TSF_WRITE_STATUS_LSB) & MAC_PCU_SLP32_MODE_TSF_WRITE_STATUS_MASK)
#define MAC_PCU_SLP32_MODE_ENABLE_MSB 20
#define MAC_PCU_SLP32_MODE_ENABLE_LSB 20
#define MAC_PCU_SLP32_MODE_ENABLE_MASK 0x00100000
#define MAC_PCU_SLP32_MODE_ENABLE_GET(x) (((x)&MAC_PCU_SLP32_MODE_ENABLE_MASK) >> MAC_PCU_SLP32_MODE_ENABLE_LSB)
#define MAC_PCU_SLP32_MODE_ENABLE_SET(x) (((x) << MAC_PCU_SLP32_MODE_ENABLE_LSB) & MAC_PCU_SLP32_MODE_ENABLE_MASK)
#define MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_MSB 19
#define MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_LSB 0
#define MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_MASK 0x000fffff
#define MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_GET(x) \
    (((x)&MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_MASK) >> MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_LSB)
#define MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_SET(x) \
    (((x) << MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_LSB) & MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_MASK)

#define MAC_PCU_SLP32_WAKE_ADDRESS 0x000000f8
#define MAC_PCU_SLP32_WAKE_OFFSET 0x000000f8
#define MAC_PCU_SLP32_WAKE_XTL_TIME_MSB 15
#define MAC_PCU_SLP32_WAKE_XTL_TIME_LSB 0
#define MAC_PCU_SLP32_WAKE_XTL_TIME_MASK 0x0000ffff
#define MAC_PCU_SLP32_WAKE_XTL_TIME_GET(x) (((x)&MAC_PCU_SLP32_WAKE_XTL_TIME_MASK) >> MAC_PCU_SLP32_WAKE_XTL_TIME_LSB)
#define MAC_PCU_SLP32_WAKE_XTL_TIME_SET(x) (((x) << MAC_PCU_SLP32_WAKE_XTL_TIME_LSB) & MAC_PCU_SLP32_WAKE_XTL_TIME_MASK)

#define MAC_PCU_SLP32_INC_ADDRESS 0x000000fc
#define MAC_PCU_SLP32_INC_OFFSET 0x000000fc
#define MAC_PCU_SLP32_INC_TSF_INC_MSB 19
#define MAC_PCU_SLP32_INC_TSF_INC_LSB 0
#define MAC_PCU_SLP32_INC_TSF_INC_MASK 0x000fffff
#define MAC_PCU_SLP32_INC_TSF_INC_GET(x) (((x)&MAC_PCU_SLP32_INC_TSF_INC_MASK) >> MAC_PCU_SLP32_INC_TSF_INC_LSB)
#define MAC_PCU_SLP32_INC_TSF_INC_SET(x) (((x) << MAC_PCU_SLP32_INC_TSF_INC_LSB) & MAC_PCU_SLP32_INC_TSF_INC_MASK)

#define MAC_PCU_SLP_MIB1_ADDRESS 0x00000100
#define MAC_PCU_SLP_MIB1_OFFSET 0x00000100
#define MAC_PCU_SLP_MIB1_SLEEP_CNT_MSB 31
#define MAC_PCU_SLP_MIB1_SLEEP_CNT_LSB 0
#define MAC_PCU_SLP_MIB1_SLEEP_CNT_MASK 0xffffffff
#define MAC_PCU_SLP_MIB1_SLEEP_CNT_GET(x) (((x)&MAC_PCU_SLP_MIB1_SLEEP_CNT_MASK) >> MAC_PCU_SLP_MIB1_SLEEP_CNT_LSB)
#define MAC_PCU_SLP_MIB1_SLEEP_CNT_SET(x) (((x) << MAC_PCU_SLP_MIB1_SLEEP_CNT_LSB) & MAC_PCU_SLP_MIB1_SLEEP_CNT_MASK)

#define MAC_PCU_SLP_MIB2_ADDRESS 0x00000104
#define MAC_PCU_SLP_MIB2_OFFSET 0x00000104
#define MAC_PCU_SLP_MIB2_CYCLE_CNT_MSB 31
#define MAC_PCU_SLP_MIB2_CYCLE_CNT_LSB 0
#define MAC_PCU_SLP_MIB2_CYCLE_CNT_MASK 0xffffffff
#define MAC_PCU_SLP_MIB2_CYCLE_CNT_GET(x) (((x)&MAC_PCU_SLP_MIB2_CYCLE_CNT_MASK) >> MAC_PCU_SLP_MIB2_CYCLE_CNT_LSB)
#define MAC_PCU_SLP_MIB2_CYCLE_CNT_SET(x) (((x) << MAC_PCU_SLP_MIB2_CYCLE_CNT_LSB) & MAC_PCU_SLP_MIB2_CYCLE_CNT_MASK)

#define MAC_PCU_SLP_MIB3_ADDRESS 0x00000108
#define MAC_PCU_SLP_MIB3_OFFSET 0x00000108
#define MAC_PCU_SLP_MIB3_PENDING_MSB 1
#define MAC_PCU_SLP_MIB3_PENDING_LSB 1
#define MAC_PCU_SLP_MIB3_PENDING_MASK 0x00000002
#define MAC_PCU_SLP_MIB3_PENDING_GET(x) (((x)&MAC_PCU_SLP_MIB3_PENDING_MASK) >> MAC_PCU_SLP_MIB3_PENDING_LSB)
#define MAC_PCU_SLP_MIB3_PENDING_SET(x) (((x) << MAC_PCU_SLP_MIB3_PENDING_LSB) & MAC_PCU_SLP_MIB3_PENDING_MASK)
#define MAC_PCU_SLP_MIB3_CLR_CNT_MSB 0
#define MAC_PCU_SLP_MIB3_CLR_CNT_LSB 0
#define MAC_PCU_SLP_MIB3_CLR_CNT_MASK 0x00000001
#define MAC_PCU_SLP_MIB3_CLR_CNT_GET(x) (((x)&MAC_PCU_SLP_MIB3_CLR_CNT_MASK) >> MAC_PCU_SLP_MIB3_CLR_CNT_LSB)
#define MAC_PCU_SLP_MIB3_CLR_CNT_SET(x) (((x) << MAC_PCU_SLP_MIB3_CLR_CNT_LSB) & MAC_PCU_SLP_MIB3_CLR_CNT_MASK)

#define WLAN_POWER_REG_ADDRESS 0x0000010c
#define WLAN_POWER_REG_OFFSET 0x0000010c
#define WLAN_POWER_REG_SLEEP_MAKE_N_BREAK_EN_MSB 15
#define WLAN_POWER_REG_SLEEP_MAKE_N_BREAK_EN_LSB 15
#define WLAN_POWER_REG_SLEEP_MAKE_N_BREAK_EN_MASK 0x00008000
#define WLAN_POWER_REG_SLEEP_MAKE_N_BREAK_EN_GET(x) \
    (((x)&WLAN_POWER_REG_SLEEP_MAKE_N_BREAK_EN_MASK) >> WLAN_POWER_REG_SLEEP_MAKE_N_BREAK_EN_LSB)
#define WLAN_POWER_REG_SLEEP_MAKE_N_BREAK_EN_SET(x) \
    (((x) << WLAN_POWER_REG_SLEEP_MAKE_N_BREAK_EN_LSB) & WLAN_POWER_REG_SLEEP_MAKE_N_BREAK_EN_MASK)
#define WLAN_POWER_REG_DEBUG_EN_MSB 14
#define WLAN_POWER_REG_DEBUG_EN_LSB 14
#define WLAN_POWER_REG_DEBUG_EN_MASK 0x00004000
#define WLAN_POWER_REG_DEBUG_EN_GET(x) (((x)&WLAN_POWER_REG_DEBUG_EN_MASK) >> WLAN_POWER_REG_DEBUG_EN_LSB)
#define WLAN_POWER_REG_DEBUG_EN_SET(x) (((x) << WLAN_POWER_REG_DEBUG_EN_LSB) & WLAN_POWER_REG_DEBUG_EN_MASK)
#define WLAN_POWER_REG_WLAN_BB_PWD_EN_MSB 13
#define WLAN_POWER_REG_WLAN_BB_PWD_EN_LSB 13
#define WLAN_POWER_REG_WLAN_BB_PWD_EN_MASK 0x00002000
#define WLAN_POWER_REG_WLAN_BB_PWD_EN_GET(x) \
    (((x)&WLAN_POWER_REG_WLAN_BB_PWD_EN_MASK) >> WLAN_POWER_REG_WLAN_BB_PWD_EN_LSB)
#define WLAN_POWER_REG_WLAN_BB_PWD_EN_SET(x) \
    (((x) << WLAN_POWER_REG_WLAN_BB_PWD_EN_LSB) & WLAN_POWER_REG_WLAN_BB_PWD_EN_MASK)
#define WLAN_POWER_REG_WLAN_MAC_PWD_EN_MSB 12
#define WLAN_POWER_REG_WLAN_MAC_PWD_EN_LSB 12
#define WLAN_POWER_REG_WLAN_MAC_PWD_EN_MASK 0x00001000
#define WLAN_POWER_REG_WLAN_MAC_PWD_EN_GET(x) \
    (((x)&WLAN_POWER_REG_WLAN_MAC_PWD_EN_MASK) >> WLAN_POWER_REG_WLAN_MAC_PWD_EN_LSB)
#define WLAN_POWER_REG_WLAN_MAC_PWD_EN_SET(x) \
    (((x) << WLAN_POWER_REG_WLAN_MAC_PWD_EN_LSB) & WLAN_POWER_REG_WLAN_MAC_PWD_EN_MASK)
#define WLAN_POWER_REG_VLVL_MSB 11
#define WLAN_POWER_REG_VLVL_LSB 8
#define WLAN_POWER_REG_VLVL_MASK 0x00000f00
#define WLAN_POWER_REG_VLVL_GET(x) (((x)&WLAN_POWER_REG_VLVL_MASK) >> WLAN_POWER_REG_VLVL_LSB)
#define WLAN_POWER_REG_VLVL_SET(x) (((x) << WLAN_POWER_REG_VLVL_LSB) & WLAN_POWER_REG_VLVL_MASK)
#define WLAN_POWER_REG_CPU_INT_ENABLE_MSB 7
#define WLAN_POWER_REG_CPU_INT_ENABLE_LSB 7
#define WLAN_POWER_REG_CPU_INT_ENABLE_MASK 0x00000080
#define WLAN_POWER_REG_CPU_INT_ENABLE_GET(x) \
    (((x)&WLAN_POWER_REG_CPU_INT_ENABLE_MASK) >> WLAN_POWER_REG_CPU_INT_ENABLE_LSB)
#define WLAN_POWER_REG_CPU_INT_ENABLE_SET(x) \
    (((x) << WLAN_POWER_REG_CPU_INT_ENABLE_LSB) & WLAN_POWER_REG_CPU_INT_ENABLE_MASK)
#define WLAN_POWER_REG_WLAN_ISO_DIS_MSB 6
#define WLAN_POWER_REG_WLAN_ISO_DIS_LSB 6
#define WLAN_POWER_REG_WLAN_ISO_DIS_MASK 0x00000040
#define WLAN_POWER_REG_WLAN_ISO_DIS_GET(x) (((x)&WLAN_POWER_REG_WLAN_ISO_DIS_MASK) >> WLAN_POWER_REG_WLAN_ISO_DIS_LSB)
#define WLAN_POWER_REG_WLAN_ISO_DIS_SET(x) (((x) << WLAN_POWER_REG_WLAN_ISO_DIS_LSB) & WLAN_POWER_REG_WLAN_ISO_DIS_MASK)
#define WLAN_POWER_REG_WLAN_ISO_CNTL_MSB 5
#define WLAN_POWER_REG_WLAN_ISO_CNTL_LSB 5
#define WLAN_POWER_REG_WLAN_ISO_CNTL_MASK 0x00000020
#define WLAN_POWER_REG_WLAN_ISO_CNTL_GET(x) \
    (((x)&WLAN_POWER_REG_WLAN_ISO_CNTL_MASK) >> WLAN_POWER_REG_WLAN_ISO_CNTL_LSB)
#define WLAN_POWER_REG_WLAN_ISO_CNTL_SET(x) \
    (((x) << WLAN_POWER_REG_WLAN_ISO_CNTL_LSB) & WLAN_POWER_REG_WLAN_ISO_CNTL_MASK)
#define WLAN_POWER_REG_RADIO_PWD_EN_MSB 4
#define WLAN_POWER_REG_RADIO_PWD_EN_LSB 4
#define WLAN_POWER_REG_RADIO_PWD_EN_MASK 0x00000010
#define WLAN_POWER_REG_RADIO_PWD_EN_GET(x) (((x)&WLAN_POWER_REG_RADIO_PWD_EN_MASK) >> WLAN_POWER_REG_RADIO_PWD_EN_LSB)
#define WLAN_POWER_REG_RADIO_PWD_EN_SET(x) (((x) << WLAN_POWER_REG_RADIO_PWD_EN_LSB) & WLAN_POWER_REG_RADIO_PWD_EN_MASK)
#define WLAN_POWER_REG_SOC_ISO_EN_MSB 3
#define WLAN_POWER_REG_SOC_ISO_EN_LSB 3
#define WLAN_POWER_REG_SOC_ISO_EN_MASK 0x00000008
#define WLAN_POWER_REG_SOC_ISO_EN_GET(x) (((x)&WLAN_POWER_REG_SOC_ISO_EN_MASK) >> WLAN_POWER_REG_SOC_ISO_EN_LSB)
#define WLAN_POWER_REG_SOC_ISO_EN_SET(x) (((x) << WLAN_POWER_REG_SOC_ISO_EN_LSB) & WLAN_POWER_REG_SOC_ISO_EN_MASK)
#define WLAN_POWER_REG_WLAN_ISO_EN_MSB 2
#define WLAN_POWER_REG_WLAN_ISO_EN_LSB 2
#define WLAN_POWER_REG_WLAN_ISO_EN_MASK 0x00000004
#define WLAN_POWER_REG_WLAN_ISO_EN_GET(x) (((x)&WLAN_POWER_REG_WLAN_ISO_EN_MASK) >> WLAN_POWER_REG_WLAN_ISO_EN_LSB)
#define WLAN_POWER_REG_WLAN_ISO_EN_SET(x) (((x) << WLAN_POWER_REG_WLAN_ISO_EN_LSB) & WLAN_POWER_REG_WLAN_ISO_EN_MASK)
#define WLAN_POWER_REG_WLAN_PWD_EN_MSB 1
#define WLAN_POWER_REG_WLAN_PWD_EN_LSB 1
#define WLAN_POWER_REG_WLAN_PWD_EN_MASK 0x00000002
#define WLAN_POWER_REG_WLAN_PWD_EN_GET(x) (((x)&WLAN_POWER_REG_WLAN_PWD_EN_MASK) >> WLAN_POWER_REG_WLAN_PWD_EN_LSB)
#define WLAN_POWER_REG_WLAN_PWD_EN_SET(x) (((x) << WLAN_POWER_REG_WLAN_PWD_EN_LSB) & WLAN_POWER_REG_WLAN_PWD_EN_MASK)
#define WLAN_POWER_REG_POWER_EN_MSB 0
#define WLAN_POWER_REG_POWER_EN_LSB 0
#define WLAN_POWER_REG_POWER_EN_MASK 0x00000001
#define WLAN_POWER_REG_POWER_EN_GET(x) (((x)&WLAN_POWER_REG_POWER_EN_MASK) >> WLAN_POWER_REG_POWER_EN_LSB)
#define WLAN_POWER_REG_POWER_EN_SET(x) (((x) << WLAN_POWER_REG_POWER_EN_LSB) & WLAN_POWER_REG_POWER_EN_MASK)

#define WLAN_CORE_CLK_CTRL_ADDRESS 0x00000110
#define WLAN_CORE_CLK_CTRL_OFFSET 0x00000110
#define WLAN_CORE_CLK_CTRL_DIV_MSB 2
#define WLAN_CORE_CLK_CTRL_DIV_LSB 0
#define WLAN_CORE_CLK_CTRL_DIV_MASK 0x00000007
#define WLAN_CORE_CLK_CTRL_DIV_GET(x) (((x)&WLAN_CORE_CLK_CTRL_DIV_MASK) >> WLAN_CORE_CLK_CTRL_DIV_LSB)
#define WLAN_CORE_CLK_CTRL_DIV_SET(x) (((x) << WLAN_CORE_CLK_CTRL_DIV_LSB) & WLAN_CORE_CLK_CTRL_DIV_MASK)

#define WLAN_GPIO_WAKEUP_CONTROL_ADDRESS 0x00000114
#define WLAN_GPIO_WAKEUP_CONTROL_OFFSET 0x00000114
#define WLAN_GPIO_WAKEUP_CONTROL_ENABLE_MSB 0
#define WLAN_GPIO_WAKEUP_CONTROL_ENABLE_LSB 0
#define WLAN_GPIO_WAKEUP_CONTROL_ENABLE_MASK 0x00000001
#define WLAN_GPIO_WAKEUP_CONTROL_ENABLE_GET(x) \
    (((x)&WLAN_GPIO_WAKEUP_CONTROL_ENABLE_MASK) >> WLAN_GPIO_WAKEUP_CONTROL_ENABLE_LSB)
#define WLAN_GPIO_WAKEUP_CONTROL_ENABLE_SET(x) \
    (((x) << WLAN_GPIO_WAKEUP_CONTROL_ENABLE_LSB) & WLAN_GPIO_WAKEUP_CONTROL_ENABLE_MASK)

#define HT_ADDRESS 0x00000118
#define HT_OFFSET 0x00000118
#define HT_MODE_MSB 0
#define HT_MODE_LSB 0
#define HT_MODE_MASK 0x00000001
#define HT_MODE_GET(x) (((x)&HT_MODE_MASK) >> HT_MODE_LSB)
#define HT_MODE_SET(x) (((x) << HT_MODE_LSB) & HT_MODE_MASK)

#define MAC_PCU_TSF_L32_ADDRESS 0x0000011c
#define MAC_PCU_TSF_L32_OFFSET 0x0000011c
#define MAC_PCU_TSF_L32_VALUE_MSB 31
#define MAC_PCU_TSF_L32_VALUE_LSB 0
#define MAC_PCU_TSF_L32_VALUE_MASK 0xffffffff
#define MAC_PCU_TSF_L32_VALUE_GET(x) (((x)&MAC_PCU_TSF_L32_VALUE_MASK) >> MAC_PCU_TSF_L32_VALUE_LSB)
#define MAC_PCU_TSF_L32_VALUE_SET(x) (((x) << MAC_PCU_TSF_L32_VALUE_LSB) & MAC_PCU_TSF_L32_VALUE_MASK)

#define MAC_PCU_TSF_U32_ADDRESS 0x00000120
#define MAC_PCU_TSF_U32_OFFSET 0x00000120
#define MAC_PCU_TSF_U32_VALUE_MSB 31
#define MAC_PCU_TSF_U32_VALUE_LSB 0
#define MAC_PCU_TSF_U32_VALUE_MASK 0xffffffff
#define MAC_PCU_TSF_U32_VALUE_GET(x) (((x)&MAC_PCU_TSF_U32_VALUE_MASK) >> MAC_PCU_TSF_U32_VALUE_LSB)
#define MAC_PCU_TSF_U32_VALUE_SET(x) (((x) << MAC_PCU_TSF_U32_VALUE_LSB) & MAC_PCU_TSF_U32_VALUE_MASK)

#define MAC_PCU_WBTIMER_ADDRESS 0x00000124
#define MAC_PCU_WBTIMER_OFFSET 0x00000124
#define MAC_PCU_WBTIMER_VALUE_MSB 31
#define MAC_PCU_WBTIMER_VALUE_LSB 0
#define MAC_PCU_WBTIMER_VALUE_MASK 0xffffffff
#define MAC_PCU_WBTIMER_VALUE_GET(x) (((x)&MAC_PCU_WBTIMER_VALUE_MASK) >> MAC_PCU_WBTIMER_VALUE_LSB)
#define MAC_PCU_WBTIMER_VALUE_SET(x) (((x) << MAC_PCU_WBTIMER_VALUE_LSB) & MAC_PCU_WBTIMER_VALUE_MASK)

#define MAC_PCU_GENERIC_TIMERS_ADDRESS 0x00000140
#define MAC_PCU_GENERIC_TIMERS_OFFSET 0x00000140
#define MAC_PCU_GENERIC_TIMERS_DATA_MSB 31
#define MAC_PCU_GENERIC_TIMERS_DATA_LSB 0
#define MAC_PCU_GENERIC_TIMERS_DATA_MASK 0xffffffff
#define MAC_PCU_GENERIC_TIMERS_DATA_GET(x) (((x)&MAC_PCU_GENERIC_TIMERS_DATA_MASK) >> MAC_PCU_GENERIC_TIMERS_DATA_LSB)
#define MAC_PCU_GENERIC_TIMERS_DATA_SET(x) (((x) << MAC_PCU_GENERIC_TIMERS_DATA_LSB) & MAC_PCU_GENERIC_TIMERS_DATA_MASK)

