alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw4.0/hw/hw40_rtc_wlan_reg.h
#define MAC_PCU_GENERIC_TIMERS_MODE_ADDRESS 0x00000180
#define MAC_PCU_GENERIC_TIMERS_MODE_OFFSET 0x00000180
#define MAC_PCU_GENERIC_TIMERS_MODE_ENABLE_MSB 15
#define MAC_PCU_GENERIC_TIMERS_MODE_ENABLE_LSB 0
#define MAC_PCU_GENERIC_TIMERS_MODE_ENABLE_MASK 0x0000ffff
#define MAC_PCU_GENERIC_TIMERS_MODE_ENABLE_GET(x) \
    (((x)&MAC_PCU_GENERIC_TIMERS_MODE_ENABLE_MASK) >> MAC_PCU_GENERIC_TIMERS_MODE_ENABLE_LSB)
#define MAC_PCU_GENERIC_TIMERS_MODE_ENABLE_SET(x) \
    (((x) << MAC_PCU_GENERIC_TIMERS_MODE_ENABLE_LSB) & MAC_PCU_GENERIC_TIMERS_MODE_ENABLE_MASK)

#define MAC_PCU_GENERIC_TIMERS2_ADDRESS 0x000001c0
#define MAC_PCU_GENERIC_TIMERS2_OFFSET 0x000001c0
#define MAC_PCU_GENERIC_TIMERS2_DATA_MSB 31
#define MAC_PCU_GENERIC_TIMERS2_DATA_LSB 0
#define MAC_PCU_GENERIC_TIMERS2_DATA_MASK 0xffffffff
#define MAC_PCU_GENERIC_TIMERS2_DATA_GET(x) \
    (((x)&MAC_PCU_GENERIC_TIMERS2_DATA_MASK) >> MAC_PCU_GENERIC_TIMERS2_DATA_LSB)
#define MAC_PCU_GENERIC_TIMERS2_DATA_SET(x) \
    (((x) << MAC_PCU_GENERIC_TIMERS2_DATA_LSB) & MAC_PCU_GENERIC_TIMERS2_DATA_MASK)

#define MAC_PCU_GENERIC_TIMERS_MODE2_ADDRESS 0x00000200
#define MAC_PCU_GENERIC_TIMERS_MODE2_OFFSET 0x00000200
#define MAC_PCU_GENERIC_TIMERS_MODE2_ENABLE_MSB 15
#define MAC_PCU_GENERIC_TIMERS_MODE2_ENABLE_LSB 0
#define MAC_PCU_GENERIC_TIMERS_MODE2_ENABLE_MASK 0x0000ffff
#define MAC_PCU_GENERIC_TIMERS_MODE2_ENABLE_GET(x) \
    (((x)&MAC_PCU_GENERIC_TIMERS_MODE2_ENABLE_MASK) >> MAC_PCU_GENERIC_TIMERS_MODE2_ENABLE_LSB)
#define MAC_PCU_GENERIC_TIMERS_MODE2_ENABLE_SET(x) \
    (((x) << MAC_PCU_GENERIC_TIMERS_MODE2_ENABLE_LSB) & MAC_PCU_GENERIC_TIMERS_MODE2_ENABLE_MASK)

#define MAC_PCU_SLP1_ADDRESS 0x00000204
#define MAC_PCU_SLP1_OFFSET 0x00000204
#define MAC_PCU_SLP1_ASSUME_DTIM_MSB 19
#define MAC_PCU_SLP1_ASSUME_DTIM_LSB 19
#define MAC_PCU_SLP1_ASSUME_DTIM_MASK 0x00080000
#define MAC_PCU_SLP1_ASSUME_DTIM_GET(x) (((x)&MAC_PCU_SLP1_ASSUME_DTIM_MASK) >> MAC_PCU_SLP1_ASSUME_DTIM_LSB)
#define MAC_PCU_SLP1_ASSUME_DTIM_SET(x) (((x) << MAC_PCU_SLP1_ASSUME_DTIM_LSB) & MAC_PCU_SLP1_ASSUME_DTIM_MASK)
#define MAC_PCU_SLP1_CAB_TIMEOUT_MSB 15
#define MAC_PCU_SLP1_CAB_TIMEOUT_LSB 0
#define MAC_PCU_SLP1_CAB_TIMEOUT_MASK 0x0000ffff
#define MAC_PCU_SLP1_CAB_TIMEOUT_GET(x) (((x)&MAC_PCU_SLP1_CAB_TIMEOUT_MASK) >> MAC_PCU_SLP1_CAB_TIMEOUT_LSB)
#define MAC_PCU_SLP1_CAB_TIMEOUT_SET(x) (((x) << MAC_PCU_SLP1_CAB_TIMEOUT_LSB) & MAC_PCU_SLP1_CAB_TIMEOUT_MASK)

#define MAC_PCU_SLP2_ADDRESS 0x00000208
#define MAC_PCU_SLP2_OFFSET 0x00000208
#define MAC_PCU_SLP2_BEACON_TIMEOUT_MSB 15
#define MAC_PCU_SLP2_BEACON_TIMEOUT_LSB 0
#define MAC_PCU_SLP2_BEACON_TIMEOUT_MASK 0x0000ffff
#define MAC_PCU_SLP2_BEACON_TIMEOUT_GET(x) (((x)&MAC_PCU_SLP2_BEACON_TIMEOUT_MASK) >> MAC_PCU_SLP2_BEACON_TIMEOUT_LSB)
#define MAC_PCU_SLP2_BEACON_TIMEOUT_SET(x) (((x) << MAC_PCU_SLP2_BEACON_TIMEOUT_LSB) & MAC_PCU_SLP2_BEACON_TIMEOUT_MASK)

#define MAC_PCU_RESET_TSF_ADDRESS 0x0000020c
#define MAC_PCU_RESET_TSF_OFFSET 0x0000020c
#define MAC_PCU_RESET_TSF_ONE_SHOT2_MSB 25
#define MAC_PCU_RESET_TSF_ONE_SHOT2_LSB 25
#define MAC_PCU_RESET_TSF_ONE_SHOT2_MASK 0x02000000
#define MAC_PCU_RESET_TSF_ONE_SHOT2_GET(x) (((x)&MAC_PCU_RESET_TSF_ONE_SHOT2_MASK) >> MAC_PCU_RESET_TSF_ONE_SHOT2_LSB)
#define MAC_PCU_RESET_TSF_ONE_SHOT2_SET(x) (((x) << MAC_PCU_RESET_TSF_ONE_SHOT2_LSB) & MAC_PCU_RESET_TSF_ONE_SHOT2_MASK)
#define MAC_PCU_RESET_TSF_ONE_SHOT_MSB 24
#define MAC_PCU_RESET_TSF_ONE_SHOT_LSB 24
#define MAC_PCU_RESET_TSF_ONE_SHOT_MASK 0x01000000
#define MAC_PCU_RESET_TSF_ONE_SHOT_GET(x) (((x)&MAC_PCU_RESET_TSF_ONE_SHOT_MASK) >> MAC_PCU_RESET_TSF_ONE_SHOT_LSB)
#define MAC_PCU_RESET_TSF_ONE_SHOT_SET(x) (((x) << MAC_PCU_RESET_TSF_ONE_SHOT_LSB) & MAC_PCU_RESET_TSF_ONE_SHOT_MASK)

#define MAC_PCU_TSF_ADD_PLL_ADDRESS 0x00000210
#define MAC_PCU_TSF_ADD_PLL_OFFSET 0x00000210
#define MAC_PCU_TSF_ADD_PLL_VALUE_MSB 7
#define MAC_PCU_TSF_ADD_PLL_VALUE_LSB 0
#define MAC_PCU_TSF_ADD_PLL_VALUE_MASK 0x000000ff
#define MAC_PCU_TSF_ADD_PLL_VALUE_GET(x) (((x)&MAC_PCU_TSF_ADD_PLL_VALUE_MASK) >> MAC_PCU_TSF_ADD_PLL_VALUE_LSB)
#define MAC_PCU_TSF_ADD_PLL_VALUE_SET(x) (((x) << MAC_PCU_TSF_ADD_PLL_VALUE_LSB) & MAC_PCU_TSF_ADD_PLL_VALUE_MASK)

#define SLEEP_RETENTION_ADDRESS 0x00000214
#define SLEEP_RETENTION_OFFSET 0x00000214
#define SLEEP_RETENTION_TIME_MSB 9
#define SLEEP_RETENTION_TIME_LSB 2
#define SLEEP_RETENTION_TIME_MASK 0x000003fc
#define SLEEP_RETENTION_TIME_GET(x) (((x)&SLEEP_RETENTION_TIME_MASK) >> SLEEP_RETENTION_TIME_LSB)
#define SLEEP_RETENTION_TIME_SET(x) (((x) << SLEEP_RETENTION_TIME_LSB) & SLEEP_RETENTION_TIME_MASK)
#define SLEEP_RETENTION_MODE_MSB 1
#define SLEEP_RETENTION_MODE_LSB 1
#define SLEEP_RETENTION_MODE_MASK 0x00000002
#define SLEEP_RETENTION_MODE_GET(x) (((x)&SLEEP_RETENTION_MODE_MASK) >> SLEEP_RETENTION_MODE_LSB)
#define SLEEP_RETENTION_MODE_SET(x) (((x) << SLEEP_RETENTION_MODE_LSB) & SLEEP_RETENTION_MODE_MASK)
#define SLEEP_RETENTION_ENABLE_MSB 0
#define SLEEP_RETENTION_ENABLE_LSB 0
#define SLEEP_RETENTION_ENABLE_MASK 0x00000001
#define SLEEP_RETENTION_ENABLE_GET(x) (((x)&SLEEP_RETENTION_ENABLE_MASK) >> SLEEP_RETENTION_ENABLE_LSB)
#define SLEEP_RETENTION_ENABLE_SET(x) (((x) << SLEEP_RETENTION_ENABLE_LSB) & SLEEP_RETENTION_ENABLE_MASK)

#define BTCOEXCTRL_ADDRESS 0x00000218
#define BTCOEXCTRL_OFFSET 0x00000218
#define BTCOEXCTRL_WBTIMER_ENABLE_MSB 26
#define BTCOEXCTRL_WBTIMER_ENABLE_LSB 26
#define BTCOEXCTRL_WBTIMER_ENABLE_MASK 0x04000000
#define BTCOEXCTRL_WBTIMER_ENABLE_GET(x) (((x)&BTCOEXCTRL_WBTIMER_ENABLE_MASK) >> BTCOEXCTRL_WBTIMER_ENABLE_LSB)
#define BTCOEXCTRL_WBTIMER_ENABLE_SET(x) (((x) << BTCOEXCTRL_WBTIMER_ENABLE_LSB) & BTCOEXCTRL_WBTIMER_ENABLE_MASK)
#define BTCOEXCTRL_WBSYNC_ON_BEACON_MSB 25
#define BTCOEXCTRL_WBSYNC_ON_BEACON_LSB 25
#define BTCOEXCTRL_WBSYNC_ON_BEACON_MASK 0x02000000
#define BTCOEXCTRL_WBSYNC_ON_BEACON_GET(x) (((x)&BTCOEXCTRL_WBSYNC_ON_BEACON_MASK) >> BTCOEXCTRL_WBSYNC_ON_BEACON_LSB)
#define BTCOEXCTRL_WBSYNC_ON_BEACON_SET(x) (((x) << BTCOEXCTRL_WBSYNC_ON_BEACON_LSB) & BTCOEXCTRL_WBSYNC_ON_BEACON_MASK)
#define BTCOEXCTRL_PTA_MODE_MSB 24
#define BTCOEXCTRL_PTA_MODE_LSB 23
#define BTCOEXCTRL_PTA_MODE_MASK 0x01800000
#define BTCOEXCTRL_PTA_MODE_GET(x) (((x)&BTCOEXCTRL_PTA_MODE_MASK) >> BTCOEXCTRL_PTA_MODE_LSB)
#define BTCOEXCTRL_PTA_MODE_SET(x) (((x) << BTCOEXCTRL_PTA_MODE_LSB) & BTCOEXCTRL_PTA_MODE_MASK)
#define BTCOEXCTRL_FREQ_TIME_MSB 22
#define BTCOEXCTRL_FREQ_TIME_LSB 18
#define BTCOEXCTRL_FREQ_TIME_MASK 0x007c0000
#define BTCOEXCTRL_FREQ_TIME_GET(x) (((x)&BTCOEXCTRL_FREQ_TIME_MASK) >> BTCOEXCTRL_FREQ_TIME_LSB)
#define BTCOEXCTRL_FREQ_TIME_SET(x) (((x) << BTCOEXCTRL_FREQ_TIME_LSB) & BTCOEXCTRL_FREQ_TIME_MASK)
#define BTCOEXCTRL_PRIORITY_TIME_MSB 17
#define BTCOEXCTRL_PRIORITY_TIME_LSB 12
#define BTCOEXCTRL_PRIORITY_TIME_MASK 0x0003f000
#define BTCOEXCTRL_PRIORITY_TIME_GET(x) (((x)&BTCOEXCTRL_PRIORITY_TIME_MASK) >> BTCOEXCTRL_PRIORITY_TIME_LSB)
#define BTCOEXCTRL_PRIORITY_TIME_SET(x) (((x) << BTCOEXCTRL_PRIORITY_TIME_LSB) & BTCOEXCTRL_PRIORITY_TIME_MASK)
#define BTCOEXCTRL_SYNC_DET_EN_MSB 11
#define BTCOEXCTRL_SYNC_DET_EN_LSB 11
#define BTCOEXCTRL_SYNC_DET_EN_MASK 0x00000800
#define BTCOEXCTRL_SYNC_DET_EN_GET(x) (((x)&BTCOEXCTRL_SYNC_DET_EN_MASK) >> BTCOEXCTRL_SYNC_DET_EN_LSB)
#define BTCOEXCTRL_SYNC_DET_EN_SET(x) (((x) << BTCOEXCTRL_SYNC_DET_EN_LSB) & BTCOEXCTRL_SYNC_DET_EN_MASK)
#define BTCOEXCTRL_IDLE_CNT_EN_MSB 10
#define BTCOEXCTRL_IDLE_CNT_EN_LSB 10
#define BTCOEXCTRL_IDLE_CNT_EN_MASK 0x00000400
#define BTCOEXCTRL_IDLE_CNT_EN_GET(x) (((x)&BTCOEXCTRL_IDLE_CNT_EN_MASK) >> BTCOEXCTRL_IDLE_CNT_EN_LSB)
#define BTCOEXCTRL_IDLE_CNT_EN_SET(x) (((x) << BTCOEXCTRL_IDLE_CNT_EN_LSB) & BTCOEXCTRL_IDLE_CNT_EN_MASK)
#define BTCOEXCTRL_FRAME_CNT_EN_MSB 9
#define BTCOEXCTRL_FRAME_CNT_EN_LSB 9
#define BTCOEXCTRL_FRAME_CNT_EN_MASK 0x00000200
#define BTCOEXCTRL_FRAME_CNT_EN_GET(x) (((x)&BTCOEXCTRL_FRAME_CNT_EN_MASK) >> BTCOEXCTRL_FRAME_CNT_EN_LSB)
#define BTCOEXCTRL_FRAME_CNT_EN_SET(x) (((x) << BTCOEXCTRL_FRAME_CNT_EN_LSB) & BTCOEXCTRL_FRAME_CNT_EN_MASK)
#define BTCOEXCTRL_CLK_CNT_EN_MSB 8
#define BTCOEXCTRL_CLK_CNT_EN_LSB 8
#define BTCOEXCTRL_CLK_CNT_EN_MASK 0x00000100
#define BTCOEXCTRL_CLK_CNT_EN_GET(x) (((x)&BTCOEXCTRL_CLK_CNT_EN_MASK) >> BTCOEXCTRL_CLK_CNT_EN_LSB)
#define BTCOEXCTRL_CLK_CNT_EN_SET(x) (((x) << BTCOEXCTRL_CLK_CNT_EN_LSB) & BTCOEXCTRL_CLK_CNT_EN_MASK)
#define BTCOEXCTRL_GAP_MSB 7
#define BTCOEXCTRL_GAP_LSB 0
#define BTCOEXCTRL_GAP_MASK 0x000000ff
#define BTCOEXCTRL_GAP_GET(x) (((x)&BTCOEXCTRL_GAP_MASK) >> BTCOEXCTRL_GAP_LSB)
#define BTCOEXCTRL_GAP_SET(x) (((x) << BTCOEXCTRL_GAP_LSB) & BTCOEXCTRL_GAP_MASK)

