alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw4.0/hw/hw40_rtc_wlan_reg.h
#define WBSYNC_PRIORITY1_ADDRESS 0x0000021c
#define WBSYNC_PRIORITY1_OFFSET 0x0000021c
#define WBSYNC_PRIORITY1_BITMAP_MSB 31
#define WBSYNC_PRIORITY1_BITMAP_LSB 0
#define WBSYNC_PRIORITY1_BITMAP_MASK 0xffffffff
#define WBSYNC_PRIORITY1_BITMAP_GET(x) (((x)&WBSYNC_PRIORITY1_BITMAP_MASK) >> WBSYNC_PRIORITY1_BITMAP_LSB)
#define WBSYNC_PRIORITY1_BITMAP_SET(x) (((x) << WBSYNC_PRIORITY1_BITMAP_LSB) & WBSYNC_PRIORITY1_BITMAP_MASK)

#define WBSYNC_PRIORITY2_ADDRESS 0x00000220
#define WBSYNC_PRIORITY2_OFFSET 0x00000220
#define WBSYNC_PRIORITY2_BITMAP_MSB 31
#define WBSYNC_PRIORITY2_BITMAP_LSB 0
#define WBSYNC_PRIORITY2_BITMAP_MASK 0xffffffff
#define WBSYNC_PRIORITY2_BITMAP_GET(x) (((x)&WBSYNC_PRIORITY2_BITMAP_MASK) >> WBSYNC_PRIORITY2_BITMAP_LSB)
#define WBSYNC_PRIORITY2_BITMAP_SET(x) (((x) << WBSYNC_PRIORITY2_BITMAP_LSB) & WBSYNC_PRIORITY2_BITMAP_MASK)

#define WBSYNC_PRIORITY3_ADDRESS 0x00000224
#define WBSYNC_PRIORITY3_OFFSET 0x00000224
#define WBSYNC_PRIORITY3_BITMAP_MSB 31
#define WBSYNC_PRIORITY3_BITMAP_LSB 0
#define WBSYNC_PRIORITY3_BITMAP_MASK 0xffffffff
#define WBSYNC_PRIORITY3_BITMAP_GET(x) (((x)&WBSYNC_PRIORITY3_BITMAP_MASK) >> WBSYNC_PRIORITY3_BITMAP_LSB)
#define WBSYNC_PRIORITY3_BITMAP_SET(x) (((x) << WBSYNC_PRIORITY3_BITMAP_LSB) & WBSYNC_PRIORITY3_BITMAP_MASK)

#define BTCOEX0_ADDRESS 0x00000228
#define BTCOEX0_OFFSET 0x00000228
#define BTCOEX0_SYNC_DUR_MSB 7
#define BTCOEX0_SYNC_DUR_LSB 0
#define BTCOEX0_SYNC_DUR_MASK 0x000000ff
#define BTCOEX0_SYNC_DUR_GET(x) (((x)&BTCOEX0_SYNC_DUR_MASK) >> BTCOEX0_SYNC_DUR_LSB)
#define BTCOEX0_SYNC_DUR_SET(x) (((x) << BTCOEX0_SYNC_DUR_LSB) & BTCOEX0_SYNC_DUR_MASK)

#define BTCOEX1_ADDRESS 0x0000022c
#define BTCOEX1_OFFSET 0x0000022c
#define BTCOEX1_CLK_THRES_MSB 20
#define BTCOEX1_CLK_THRES_LSB 0
#define BTCOEX1_CLK_THRES_MASK 0x001fffff
#define BTCOEX1_CLK_THRES_GET(x) (((x)&BTCOEX1_CLK_THRES_MASK) >> BTCOEX1_CLK_THRES_LSB)
#define BTCOEX1_CLK_THRES_SET(x) (((x) << BTCOEX1_CLK_THRES_LSB) & BTCOEX1_CLK_THRES_MASK)

#define BTCOEX2_ADDRESS 0x00000230
#define BTCOEX2_OFFSET 0x00000230
#define BTCOEX2_FRAME_THRES_MSB 7
#define BTCOEX2_FRAME_THRES_LSB 0
#define BTCOEX2_FRAME_THRES_MASK 0x000000ff
#define BTCOEX2_FRAME_THRES_GET(x) (((x)&BTCOEX2_FRAME_THRES_MASK) >> BTCOEX2_FRAME_THRES_LSB)
#define BTCOEX2_FRAME_THRES_SET(x) (((x) << BTCOEX2_FRAME_THRES_LSB) & BTCOEX2_FRAME_THRES_MASK)

#define BTCOEX3_ADDRESS 0x00000234
#define BTCOEX3_OFFSET 0x00000234
#define BTCOEX3_CLK_CNT_MSB 20
#define BTCOEX3_CLK_CNT_LSB 0
#define BTCOEX3_CLK_CNT_MASK 0x001fffff
#define BTCOEX3_CLK_CNT_GET(x) (((x)&BTCOEX3_CLK_CNT_MASK) >> BTCOEX3_CLK_CNT_LSB)
#define BTCOEX3_CLK_CNT_SET(x) (((x) << BTCOEX3_CLK_CNT_LSB) & BTCOEX3_CLK_CNT_MASK)

#define BTCOEX4_ADDRESS 0x00000238
#define BTCOEX4_OFFSET 0x00000238
#define BTCOEX4_FRAME_CNT_MSB 7
#define BTCOEX4_FRAME_CNT_LSB 0
#define BTCOEX4_FRAME_CNT_MASK 0x000000ff
#define BTCOEX4_FRAME_CNT_GET(x) (((x)&BTCOEX4_FRAME_CNT_MASK) >> BTCOEX4_FRAME_CNT_LSB)
#define BTCOEX4_FRAME_CNT_SET(x) (((x) << BTCOEX4_FRAME_CNT_LSB) & BTCOEX4_FRAME_CNT_MASK)

#define BTCOEX5_ADDRESS 0x0000023c
#define BTCOEX5_OFFSET 0x0000023c
#define BTCOEX5_IDLE_CNT_MSB 15
#define BTCOEX5_IDLE_CNT_LSB 0
#define BTCOEX5_IDLE_CNT_MASK 0x0000ffff
#define BTCOEX5_IDLE_CNT_GET(x) (((x)&BTCOEX5_IDLE_CNT_MASK) >> BTCOEX5_IDLE_CNT_LSB)
#define BTCOEX5_IDLE_CNT_SET(x) (((x) << BTCOEX5_IDLE_CNT_LSB) & BTCOEX5_IDLE_CNT_MASK)

#define BTCOEX6_ADDRESS 0x00000240
#define BTCOEX6_OFFSET 0x00000240
#define BTCOEX6_IDLE_RESET_LVL_BITMAP_MSB 31
#define BTCOEX6_IDLE_RESET_LVL_BITMAP_LSB 0
#define BTCOEX6_IDLE_RESET_LVL_BITMAP_MASK 0xffffffff
#define BTCOEX6_IDLE_RESET_LVL_BITMAP_GET(x) \
    (((x)&BTCOEX6_IDLE_RESET_LVL_BITMAP_MASK) >> BTCOEX6_IDLE_RESET_LVL_BITMAP_LSB)
#define BTCOEX6_IDLE_RESET_LVL_BITMAP_SET(x) \
    (((x) << BTCOEX6_IDLE_RESET_LVL_BITMAP_LSB) & BTCOEX6_IDLE_RESET_LVL_BITMAP_MASK)

#define LOCK_ADDRESS 0x00000244
#define LOCK_OFFSET 0x00000244
#define LOCK_TLOCK_SLAVE_MSB 31
#define LOCK_TLOCK_SLAVE_LSB 24
#define LOCK_TLOCK_SLAVE_MASK 0xff000000
#define LOCK_TLOCK_SLAVE_GET(x) (((x)&LOCK_TLOCK_SLAVE_MASK) >> LOCK_TLOCK_SLAVE_LSB)
#define LOCK_TLOCK_SLAVE_SET(x) (((x) << LOCK_TLOCK_SLAVE_LSB) & LOCK_TLOCK_SLAVE_MASK)
#define LOCK_TUNLOCK_SLAVE_MSB 23
#define LOCK_TUNLOCK_SLAVE_LSB 16
#define LOCK_TUNLOCK_SLAVE_MASK 0x00ff0000
#define LOCK_TUNLOCK_SLAVE_GET(x) (((x)&LOCK_TUNLOCK_SLAVE_MASK) >> LOCK_TUNLOCK_SLAVE_LSB)
#define LOCK_TUNLOCK_SLAVE_SET(x) (((x) << LOCK_TUNLOCK_SLAVE_LSB) & LOCK_TUNLOCK_SLAVE_MASK)
#define LOCK_TLOCK_MASTER_MSB 15
#define LOCK_TLOCK_MASTER_LSB 8
#define LOCK_TLOCK_MASTER_MASK 0x0000ff00
#define LOCK_TLOCK_MASTER_GET(x) (((x)&LOCK_TLOCK_MASTER_MASK) >> LOCK_TLOCK_MASTER_LSB)
#define LOCK_TLOCK_MASTER_SET(x) (((x) << LOCK_TLOCK_MASTER_LSB) & LOCK_TLOCK_MASTER_MASK)
#define LOCK_TUNLOCK_MASTER_MSB 7
#define LOCK_TUNLOCK_MASTER_LSB 0
#define LOCK_TUNLOCK_MASTER_MASK 0x000000ff
#define LOCK_TUNLOCK_MASTER_GET(x) (((x)&LOCK_TUNLOCK_MASTER_MASK) >> LOCK_TUNLOCK_MASTER_LSB)
#define LOCK_TUNLOCK_MASTER_SET(x) (((x) << LOCK_TUNLOCK_MASTER_LSB) & LOCK_TUNLOCK_MASTER_MASK)

#define NOLOCK_PRIORITY_ADDRESS 0x00000248
#define NOLOCK_PRIORITY_OFFSET 0x00000248
#define NOLOCK_PRIORITY_BITMAP_MSB 31
#define NOLOCK_PRIORITY_BITMAP_LSB 0
#define NOLOCK_PRIORITY_BITMAP_MASK 0xffffffff
#define NOLOCK_PRIORITY_BITMAP_GET(x) (((x)&NOLOCK_PRIORITY_BITMAP_MASK) >> NOLOCK_PRIORITY_BITMAP_LSB)
#define NOLOCK_PRIORITY_BITMAP_SET(x) (((x) << NOLOCK_PRIORITY_BITMAP_LSB) & NOLOCK_PRIORITY_BITMAP_MASK)

#define WBSYNC_ADDRESS 0x0000024c
#define WBSYNC_OFFSET 0x0000024c
#define WBSYNC_BTCLOCK_MSB 31
#define WBSYNC_BTCLOCK_LSB 0
#define WBSYNC_BTCLOCK_MASK 0xffffffff
#define WBSYNC_BTCLOCK_GET(x) (((x)&WBSYNC_BTCLOCK_MASK) >> WBSYNC_BTCLOCK_LSB)
#define WBSYNC_BTCLOCK_SET(x) (((x) << WBSYNC_BTCLOCK_LSB) & WBSYNC_BTCLOCK_MASK)

#define WBSYNC1_ADDRESS 0x00000250
#define WBSYNC1_OFFSET 0x00000250
#define WBSYNC1_BTCLOCK_MSB 31
#define WBSYNC1_BTCLOCK_LSB 0
#define WBSYNC1_BTCLOCK_MASK 0xffffffff
#define WBSYNC1_BTCLOCK_GET(x) (((x)&WBSYNC1_BTCLOCK_MASK) >> WBSYNC1_BTCLOCK_LSB)
#define WBSYNC1_BTCLOCK_SET(x) (((x) << WBSYNC1_BTCLOCK_LSB) & WBSYNC1_BTCLOCK_MASK)

#define WBSYNC2_ADDRESS 0x00000254
#define WBSYNC2_OFFSET 0x00000254
#define WBSYNC2_BTCLOCK_MSB 31
#define WBSYNC2_BTCLOCK_LSB 0
#define WBSYNC2_BTCLOCK_MASK 0xffffffff
#define WBSYNC2_BTCLOCK_GET(x) (((x)&WBSYNC2_BTCLOCK_MASK) >> WBSYNC2_BTCLOCK_LSB)
#define WBSYNC2_BTCLOCK_SET(x) (((x) << WBSYNC2_BTCLOCK_LSB) & WBSYNC2_BTCLOCK_MASK)

#define WBSYNC3_ADDRESS 0x00000258
#define WBSYNC3_OFFSET 0x00000258
#define WBSYNC3_BTCLOCK_MSB 31
#define WBSYNC3_BTCLOCK_LSB 0
#define WBSYNC3_BTCLOCK_MASK 0xffffffff
#define WBSYNC3_BTCLOCK_GET(x) (((x)&WBSYNC3_BTCLOCK_MASK) >> WBSYNC3_BTCLOCK_LSB)
#define WBSYNC3_BTCLOCK_SET(x) (((x) << WBSYNC3_BTCLOCK_LSB) & WBSYNC3_BTCLOCK_MASK)

