alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw4.0/hw/hw40_rtc_wlan_reg.h
#define WB_TIMER_TARGET_ADDRESS 0x0000025c
#define WB_TIMER_TARGET_OFFSET 0x0000025c
#define WB_TIMER_TARGET_VALUE_MSB 31
#define WB_TIMER_TARGET_VALUE_LSB 0
#define WB_TIMER_TARGET_VALUE_MASK 0xffffffff
#define WB_TIMER_TARGET_VALUE_GET(x) (((x)&WB_TIMER_TARGET_VALUE_MASK) >> WB_TIMER_TARGET_VALUE_LSB)
#define WB_TIMER_TARGET_VALUE_SET(x) (((x) << WB_TIMER_TARGET_VALUE_LSB) & WB_TIMER_TARGET_VALUE_MASK)

#define WB_TIMER_SLOP_ADDRESS 0x00000260
#define WB_TIMER_SLOP_OFFSET 0x00000260
#define WB_TIMER_SLOP_VALUE_MSB 9
#define WB_TIMER_SLOP_VALUE_LSB 0
#define WB_TIMER_SLOP_VALUE_MASK 0x000003ff
#define WB_TIMER_SLOP_VALUE_GET(x) (((x)&WB_TIMER_SLOP_VALUE_MASK) >> WB_TIMER_SLOP_VALUE_LSB)
#define WB_TIMER_SLOP_VALUE_SET(x) (((x) << WB_TIMER_SLOP_VALUE_LSB) & WB_TIMER_SLOP_VALUE_MASK)

#define BTCOEX_INT_EN_ADDRESS 0x00000264
#define BTCOEX_INT_EN_OFFSET 0x00000264
#define BTCOEX_INT_EN_I2C_RECV_OVERFLOW_MSB 11
#define BTCOEX_INT_EN_I2C_RECV_OVERFLOW_LSB 11
#define BTCOEX_INT_EN_I2C_RECV_OVERFLOW_MASK 0x00000800
#define BTCOEX_INT_EN_I2C_RECV_OVERFLOW_GET(x) \
    (((x)&BTCOEX_INT_EN_I2C_RECV_OVERFLOW_MASK) >> BTCOEX_INT_EN_I2C_RECV_OVERFLOW_LSB)
#define BTCOEX_INT_EN_I2C_RECV_OVERFLOW_SET(x) \
    (((x) << BTCOEX_INT_EN_I2C_RECV_OVERFLOW_LSB) & BTCOEX_INT_EN_I2C_RECV_OVERFLOW_MASK)
#define BTCOEX_INT_EN_I2C_TX_FAILED_MSB 10
#define BTCOEX_INT_EN_I2C_TX_FAILED_LSB 10
#define BTCOEX_INT_EN_I2C_TX_FAILED_MASK 0x00000400
#define BTCOEX_INT_EN_I2C_TX_FAILED_GET(x) (((x)&BTCOEX_INT_EN_I2C_TX_FAILED_MASK) >> BTCOEX_INT_EN_I2C_TX_FAILED_LSB)
#define BTCOEX_INT_EN_I2C_TX_FAILED_SET(x) (((x) << BTCOEX_INT_EN_I2C_TX_FAILED_LSB) & BTCOEX_INT_EN_I2C_TX_FAILED_MASK)
#define BTCOEX_INT_EN_I2C_MESG_SENT_MSB 9
#define BTCOEX_INT_EN_I2C_MESG_SENT_LSB 9
#define BTCOEX_INT_EN_I2C_MESG_SENT_MASK 0x00000200
#define BTCOEX_INT_EN_I2C_MESG_SENT_GET(x) (((x)&BTCOEX_INT_EN_I2C_MESG_SENT_MASK) >> BTCOEX_INT_EN_I2C_MESG_SENT_LSB)
#define BTCOEX_INT_EN_I2C_MESG_SENT_SET(x) (((x) << BTCOEX_INT_EN_I2C_MESG_SENT_LSB) & BTCOEX_INT_EN_I2C_MESG_SENT_MASK)
#define BTCOEX_INT_EN_ST_MESG_RECV_MSB 8
#define BTCOEX_INT_EN_ST_MESG_RECV_LSB 8
#define BTCOEX_INT_EN_ST_MESG_RECV_MASK 0x00000100
#define BTCOEX_INT_EN_ST_MESG_RECV_GET(x) (((x)&BTCOEX_INT_EN_ST_MESG_RECV_MASK) >> BTCOEX_INT_EN_ST_MESG_RECV_LSB)
#define BTCOEX_INT_EN_ST_MESG_RECV_SET(x) (((x) << BTCOEX_INT_EN_ST_MESG_RECV_LSB) & BTCOEX_INT_EN_ST_MESG_RECV_MASK)
#define BTCOEX_INT_EN_WB_TIMER_MSB 7
#define BTCOEX_INT_EN_WB_TIMER_LSB 7
#define BTCOEX_INT_EN_WB_TIMER_MASK 0x00000080
#define BTCOEX_INT_EN_WB_TIMER_GET(x) (((x)&BTCOEX_INT_EN_WB_TIMER_MASK) >> BTCOEX_INT_EN_WB_TIMER_LSB)
#define BTCOEX_INT_EN_WB_TIMER_SET(x) (((x) << BTCOEX_INT_EN_WB_TIMER_LSB) & BTCOEX_INT_EN_WB_TIMER_MASK)
#define BTCOEX_INT_EN_NOSYNC_MSB 4
#define BTCOEX_INT_EN_NOSYNC_LSB 4
#define BTCOEX_INT_EN_NOSYNC_MASK 0x00000010
#define BTCOEX_INT_EN_NOSYNC_GET(x) (((x)&BTCOEX_INT_EN_NOSYNC_MASK) >> BTCOEX_INT_EN_NOSYNC_LSB)
#define BTCOEX_INT_EN_NOSYNC_SET(x) (((x) << BTCOEX_INT_EN_NOSYNC_LSB) & BTCOEX_INT_EN_NOSYNC_MASK)
#define BTCOEX_INT_EN_SYNC_MSB 3
#define BTCOEX_INT_EN_SYNC_LSB 3
#define BTCOEX_INT_EN_SYNC_MASK 0x00000008
#define BTCOEX_INT_EN_SYNC_GET(x) (((x)&BTCOEX_INT_EN_SYNC_MASK) >> BTCOEX_INT_EN_SYNC_LSB)
#define BTCOEX_INT_EN_SYNC_SET(x) (((x) << BTCOEX_INT_EN_SYNC_LSB) & BTCOEX_INT_EN_SYNC_MASK)
#define BTCOEX_INT_EN_END_MSB 2
#define BTCOEX_INT_EN_END_LSB 2
#define BTCOEX_INT_EN_END_MASK 0x00000004
#define BTCOEX_INT_EN_END_GET(x) (((x)&BTCOEX_INT_EN_END_MASK) >> BTCOEX_INT_EN_END_LSB)
#define BTCOEX_INT_EN_END_SET(x) (((x) << BTCOEX_INT_EN_END_LSB) & BTCOEX_INT_EN_END_MASK)
#define BTCOEX_INT_EN_FRAME_CNT_MSB 1
#define BTCOEX_INT_EN_FRAME_CNT_LSB 1
#define BTCOEX_INT_EN_FRAME_CNT_MASK 0x00000002
#define BTCOEX_INT_EN_FRAME_CNT_GET(x) (((x)&BTCOEX_INT_EN_FRAME_CNT_MASK) >> BTCOEX_INT_EN_FRAME_CNT_LSB)
#define BTCOEX_INT_EN_FRAME_CNT_SET(x) (((x) << BTCOEX_INT_EN_FRAME_CNT_LSB) & BTCOEX_INT_EN_FRAME_CNT_MASK)
#define BTCOEX_INT_EN_CLK_CNT_MSB 0
#define BTCOEX_INT_EN_CLK_CNT_LSB 0
#define BTCOEX_INT_EN_CLK_CNT_MASK 0x00000001
#define BTCOEX_INT_EN_CLK_CNT_GET(x) (((x)&BTCOEX_INT_EN_CLK_CNT_MASK) >> BTCOEX_INT_EN_CLK_CNT_LSB)
#define BTCOEX_INT_EN_CLK_CNT_SET(x) (((x) << BTCOEX_INT_EN_CLK_CNT_LSB) & BTCOEX_INT_EN_CLK_CNT_MASK)

#define BTCOEX_INT_STAT_ADDRESS 0x00000268
#define BTCOEX_INT_STAT_OFFSET 0x00000268
#define BTCOEX_INT_STAT_I2C_RECV_OVERFLOW_MSB 11
#define BTCOEX_INT_STAT_I2C_RECV_OVERFLOW_LSB 11
#define BTCOEX_INT_STAT_I2C_RECV_OVERFLOW_MASK 0x00000800
#define BTCOEX_INT_STAT_I2C_RECV_OVERFLOW_GET(x) \
    (((x)&BTCOEX_INT_STAT_I2C_RECV_OVERFLOW_MASK) >> BTCOEX_INT_STAT_I2C_RECV_OVERFLOW_LSB)
#define BTCOEX_INT_STAT_I2C_RECV_OVERFLOW_SET(x) \
    (((x) << BTCOEX_INT_STAT_I2C_RECV_OVERFLOW_LSB) & BTCOEX_INT_STAT_I2C_RECV_OVERFLOW_MASK)
#define BTCOEX_INT_STAT_I2C_TX_FAILED_MSB 10
#define BTCOEX_INT_STAT_I2C_TX_FAILED_LSB 10
#define BTCOEX_INT_STAT_I2C_TX_FAILED_MASK 0x00000400
#define BTCOEX_INT_STAT_I2C_TX_FAILED_GET(x) \
    (((x)&BTCOEX_INT_STAT_I2C_TX_FAILED_MASK) >> BTCOEX_INT_STAT_I2C_TX_FAILED_LSB)
#define BTCOEX_INT_STAT_I2C_TX_FAILED_SET(x) \
    (((x) << BTCOEX_INT_STAT_I2C_TX_FAILED_LSB) & BTCOEX_INT_STAT_I2C_TX_FAILED_MASK)
#define BTCOEX_INT_STAT_I2C_MESG_SENT_MSB 9
#define BTCOEX_INT_STAT_I2C_MESG_SENT_LSB 9
#define BTCOEX_INT_STAT_I2C_MESG_SENT_MASK 0x00000200
#define BTCOEX_INT_STAT_I2C_MESG_SENT_GET(x) \
    (((x)&BTCOEX_INT_STAT_I2C_MESG_SENT_MASK) >> BTCOEX_INT_STAT_I2C_MESG_SENT_LSB)
#define BTCOEX_INT_STAT_I2C_MESG_SENT_SET(x) \
    (((x) << BTCOEX_INT_STAT_I2C_MESG_SENT_LSB) & BTCOEX_INT_STAT_I2C_MESG_SENT_MASK)
#define BTCOEX_INT_STAT_I2C_MESG_RECV_MSB 8
#define BTCOEX_INT_STAT_I2C_MESG_RECV_LSB 8
#define BTCOEX_INT_STAT_I2C_MESG_RECV_MASK 0x00000100
#define BTCOEX_INT_STAT_I2C_MESG_RECV_GET(x) \
    (((x)&BTCOEX_INT_STAT_I2C_MESG_RECV_MASK) >> BTCOEX_INT_STAT_I2C_MESG_RECV_LSB)
#define BTCOEX_INT_STAT_I2C_MESG_RECV_SET(x) \
    (((x) << BTCOEX_INT_STAT_I2C_MESG_RECV_LSB) & BTCOEX_INT_STAT_I2C_MESG_RECV_MASK)
#define BTCOEX_INT_STAT_WB_TIMER_MSB 7
#define BTCOEX_INT_STAT_WB_TIMER_LSB 7
#define BTCOEX_INT_STAT_WB_TIMER_MASK 0x00000080
#define BTCOEX_INT_STAT_WB_TIMER_GET(x) (((x)&BTCOEX_INT_STAT_WB_TIMER_MASK) >> BTCOEX_INT_STAT_WB_TIMER_LSB)
#define BTCOEX_INT_STAT_WB_TIMER_SET(x) (((x) << BTCOEX_INT_STAT_WB_TIMER_LSB) & BTCOEX_INT_STAT_WB_TIMER_MASK)
#define BTCOEX_INT_STAT_BTPRIORITY_STOMP_MSB 6
#define BTCOEX_INT_STAT_BTPRIORITY_STOMP_LSB 6
#define BTCOEX_INT_STAT_BTPRIORITY_STOMP_MASK 0x00000040
#define BTCOEX_INT_STAT_BTPRIORITY_STOMP_GET(x) \
    (((x)&BTCOEX_INT_STAT_BTPRIORITY_STOMP_MASK) >> BTCOEX_INT_STAT_BTPRIORITY_STOMP_LSB)
#define BTCOEX_INT_STAT_BTPRIORITY_STOMP_SET(x) \
    (((x) << BTCOEX_INT_STAT_BTPRIORITY_STOMP_LSB) & BTCOEX_INT_STAT_BTPRIORITY_STOMP_MASK)
#define BTCOEX_INT_STAT_BTPRIORITY_MSB 5
#define BTCOEX_INT_STAT_BTPRIORITY_LSB 5
#define BTCOEX_INT_STAT_BTPRIORITY_MASK 0x00000020
#define BTCOEX_INT_STAT_BTPRIORITY_GET(x) (((x)&BTCOEX_INT_STAT_BTPRIORITY_MASK) >> BTCOEX_INT_STAT_BTPRIORITY_LSB)
#define BTCOEX_INT_STAT_BTPRIORITY_SET(x) (((x) << BTCOEX_INT_STAT_BTPRIORITY_LSB) & BTCOEX_INT_STAT_BTPRIORITY_MASK)
#define BTCOEX_INT_STAT_NOSYNC_MSB 4
#define BTCOEX_INT_STAT_NOSYNC_LSB 4
#define BTCOEX_INT_STAT_NOSYNC_MASK 0x00000010
#define BTCOEX_INT_STAT_NOSYNC_GET(x) (((x)&BTCOEX_INT_STAT_NOSYNC_MASK) >> BTCOEX_INT_STAT_NOSYNC_LSB)
#define BTCOEX_INT_STAT_NOSYNC_SET(x) (((x) << BTCOEX_INT_STAT_NOSYNC_LSB) & BTCOEX_INT_STAT_NOSYNC_MASK)
#define BTCOEX_INT_STAT_SYNC_MSB 3
#define BTCOEX_INT_STAT_SYNC_LSB 3
#define BTCOEX_INT_STAT_SYNC_MASK 0x00000008
#define BTCOEX_INT_STAT_SYNC_GET(x) (((x)&BTCOEX_INT_STAT_SYNC_MASK) >> BTCOEX_INT_STAT_SYNC_LSB)
#define BTCOEX_INT_STAT_SYNC_SET(x) (((x) << BTCOEX_INT_STAT_SYNC_LSB) & BTCOEX_INT_STAT_SYNC_MASK)
#define BTCOEX_INT_STAT_END_MSB 2
#define BTCOEX_INT_STAT_END_LSB 2
#define BTCOEX_INT_STAT_END_MASK 0x00000004
#define BTCOEX_INT_STAT_END_GET(x) (((x)&BTCOEX_INT_STAT_END_MASK) >> BTCOEX_INT_STAT_END_LSB)
#define BTCOEX_INT_STAT_END_SET(x) (((x) << BTCOEX_INT_STAT_END_LSB) & BTCOEX_INT_STAT_END_MASK)
#define BTCOEX_INT_STAT_FRAME_CNT_MSB 1
#define BTCOEX_INT_STAT_FRAME_CNT_LSB 1
#define BTCOEX_INT_STAT_FRAME_CNT_MASK 0x00000002
#define BTCOEX_INT_STAT_FRAME_CNT_GET(x) (((x)&BTCOEX_INT_STAT_FRAME_CNT_MASK) >> BTCOEX_INT_STAT_FRAME_CNT_LSB)
#define BTCOEX_INT_STAT_FRAME_CNT_SET(x) (((x) << BTCOEX_INT_STAT_FRAME_CNT_LSB) & BTCOEX_INT_STAT_FRAME_CNT_MASK)
#define BTCOEX_INT_STAT_CLK_CNT_MSB 0
#define BTCOEX_INT_STAT_CLK_CNT_LSB 0
#define BTCOEX_INT_STAT_CLK_CNT_MASK 0x00000001
#define BTCOEX_INT_STAT_CLK_CNT_GET(x) (((x)&BTCOEX_INT_STAT_CLK_CNT_MASK) >> BTCOEX_INT_STAT_CLK_CNT_LSB)
#define BTCOEX_INT_STAT_CLK_CNT_SET(x) (((x) << BTCOEX_INT_STAT_CLK_CNT_LSB) & BTCOEX_INT_STAT_CLK_CNT_MASK)

#define BTPRIORITY_INT_EN_ADDRESS 0x0000026c
#define BTPRIORITY_INT_EN_OFFSET 0x0000026c
#define BTPRIORITY_INT_EN_BITMAP_MSB 31
#define BTPRIORITY_INT_EN_BITMAP_LSB 0
#define BTPRIORITY_INT_EN_BITMAP_MASK 0xffffffff
#define BTPRIORITY_INT_EN_BITMAP_GET(x) (((x)&BTPRIORITY_INT_EN_BITMAP_MASK) >> BTPRIORITY_INT_EN_BITMAP_LSB)
#define BTPRIORITY_INT_EN_BITMAP_SET(x) (((x) << BTPRIORITY_INT_EN_BITMAP_LSB) & BTPRIORITY_INT_EN_BITMAP_MASK)

#define BTPRIORITY_INT_STAT_ADDRESS 0x00000270
#define BTPRIORITY_INT_STAT_OFFSET 0x00000270
#define BTPRIORITY_INT_STAT_BITMAP_MSB 31
#define BTPRIORITY_INT_STAT_BITMAP_LSB 0
#define BTPRIORITY_INT_STAT_BITMAP_MASK 0xffffffff
#define BTPRIORITY_INT_STAT_BITMAP_GET(x) (((x)&BTPRIORITY_INT_STAT_BITMAP_MASK) >> BTPRIORITY_INT_STAT_BITMAP_LSB)
#define BTPRIORITY_INT_STAT_BITMAP_SET(x) (((x) << BTPRIORITY_INT_STAT_BITMAP_LSB) & BTPRIORITY_INT_STAT_BITMAP_MASK)

#define BTPRIORITY_STOMP_INT_EN_ADDRESS 0x00000274
#define BTPRIORITY_STOMP_INT_EN_OFFSET 0x00000274
#define BTPRIORITY_STOMP_INT_EN_BITMAP_MSB 31
#define BTPRIORITY_STOMP_INT_EN_BITMAP_LSB 0
#define BTPRIORITY_STOMP_INT_EN_BITMAP_MASK 0xffffffff
#define BTPRIORITY_STOMP_INT_EN_BITMAP_GET(x) \
    (((x)&BTPRIORITY_STOMP_INT_EN_BITMAP_MASK) >> BTPRIORITY_STOMP_INT_EN_BITMAP_LSB)
#define BTPRIORITY_STOMP_INT_EN_BITMAP_SET(x) \
    (((x) << BTPRIORITY_STOMP_INT_EN_BITMAP_LSB) & BTPRIORITY_STOMP_INT_EN_BITMAP_MASK)

#define BTPRIORITY_STOMP_INT_STAT_ADDRESS 0x00000278
#define BTPRIORITY_STOMP_INT_STAT_OFFSET 0x00000278
#define BTPRIORITY_STOMP_INT_STAT_BITMAP_MSB 31
#define BTPRIORITY_STOMP_INT_STAT_BITMAP_LSB 0
#define BTPRIORITY_STOMP_INT_STAT_BITMAP_MASK 0xffffffff
#define BTPRIORITY_STOMP_INT_STAT_BITMAP_GET(x) \
    (((x)&BTPRIORITY_STOMP_INT_STAT_BITMAP_MASK) >> BTPRIORITY_STOMP_INT_STAT_BITMAP_LSB)
#define BTPRIORITY_STOMP_INT_STAT_BITMAP_SET(x) \
    (((x) << BTPRIORITY_STOMP_INT_STAT_BITMAP_LSB) & BTPRIORITY_STOMP_INT_STAT_BITMAP_MASK)

