alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw4.0/hw/hw40_rtc_wlan_reg.h
#define MAC_PCU_BMISS_TIMEOUT_ADDRESS 0x0000027c
#define MAC_PCU_BMISS_TIMEOUT_OFFSET 0x0000027c
#define MAC_PCU_BMISS_TIMEOUT_ENABLE_MSB 24
#define MAC_PCU_BMISS_TIMEOUT_ENABLE_LSB 24
#define MAC_PCU_BMISS_TIMEOUT_ENABLE_MASK 0x01000000
#define MAC_PCU_BMISS_TIMEOUT_ENABLE_GET(x) \
    (((x)&MAC_PCU_BMISS_TIMEOUT_ENABLE_MASK) >> MAC_PCU_BMISS_TIMEOUT_ENABLE_LSB)
#define MAC_PCU_BMISS_TIMEOUT_ENABLE_SET(x) \
    (((x) << MAC_PCU_BMISS_TIMEOUT_ENABLE_LSB) & MAC_PCU_BMISS_TIMEOUT_ENABLE_MASK)
#define MAC_PCU_BMISS_TIMEOUT_VALUE_MSB 23
#define MAC_PCU_BMISS_TIMEOUT_VALUE_LSB 0
#define MAC_PCU_BMISS_TIMEOUT_VALUE_MASK 0x00ffffff
#define MAC_PCU_BMISS_TIMEOUT_VALUE_GET(x) (((x)&MAC_PCU_BMISS_TIMEOUT_VALUE_MASK) >> MAC_PCU_BMISS_TIMEOUT_VALUE_LSB)
#define MAC_PCU_BMISS_TIMEOUT_VALUE_SET(x) (((x) << MAC_PCU_BMISS_TIMEOUT_VALUE_LSB) & MAC_PCU_BMISS_TIMEOUT_VALUE_MASK)

#define MAC_PCU_CAB_AWAKE_ADDRESS 0x00000280
#define MAC_PCU_CAB_AWAKE_OFFSET 0x00000280
#define MAC_PCU_CAB_AWAKE_ENABLE_MSB 16
#define MAC_PCU_CAB_AWAKE_ENABLE_LSB 16
#define MAC_PCU_CAB_AWAKE_ENABLE_MASK 0x00010000
#define MAC_PCU_CAB_AWAKE_ENABLE_GET(x) (((x)&MAC_PCU_CAB_AWAKE_ENABLE_MASK) >> MAC_PCU_CAB_AWAKE_ENABLE_LSB)
#define MAC_PCU_CAB_AWAKE_ENABLE_SET(x) (((x) << MAC_PCU_CAB_AWAKE_ENABLE_LSB) & MAC_PCU_CAB_AWAKE_ENABLE_MASK)
#define MAC_PCU_CAB_AWAKE_DURATION_MSB 15
#define MAC_PCU_CAB_AWAKE_DURATION_LSB 0
#define MAC_PCU_CAB_AWAKE_DURATION_MASK 0x0000ffff
#define MAC_PCU_CAB_AWAKE_DURATION_GET(x) (((x)&MAC_PCU_CAB_AWAKE_DURATION_MASK) >> MAC_PCU_CAB_AWAKE_DURATION_LSB)
#define MAC_PCU_CAB_AWAKE_DURATION_SET(x) (((x) << MAC_PCU_CAB_AWAKE_DURATION_LSB) & MAC_PCU_CAB_AWAKE_DURATION_MASK)

#define LP_PERF_COUNTER_ADDRESS 0x00000284
#define LP_PERF_COUNTER_OFFSET 0x00000284
#define LP_PERF_COUNTER_EN_MSB 0
#define LP_PERF_COUNTER_EN_LSB 0
#define LP_PERF_COUNTER_EN_MASK 0x00000001
#define LP_PERF_COUNTER_EN_GET(x) (((x)&LP_PERF_COUNTER_EN_MASK) >> LP_PERF_COUNTER_EN_LSB)
#define LP_PERF_COUNTER_EN_SET(x) (((x) << LP_PERF_COUNTER_EN_LSB) & LP_PERF_COUNTER_EN_MASK)

#define LP_PERF_LIGHT_SLEEP_ADDRESS 0x00000288
#define LP_PERF_LIGHT_SLEEP_OFFSET 0x00000288
#define LP_PERF_LIGHT_SLEEP_CNT_MSB 31
#define LP_PERF_LIGHT_SLEEP_CNT_LSB 0
#define LP_PERF_LIGHT_SLEEP_CNT_MASK 0xffffffff
#define LP_PERF_LIGHT_SLEEP_CNT_GET(x) (((x)&LP_PERF_LIGHT_SLEEP_CNT_MASK) >> LP_PERF_LIGHT_SLEEP_CNT_LSB)
#define LP_PERF_LIGHT_SLEEP_CNT_SET(x) (((x) << LP_PERF_LIGHT_SLEEP_CNT_LSB) & LP_PERF_LIGHT_SLEEP_CNT_MASK)

#define LP_PERF_DEEP_SLEEP_ADDRESS 0x0000028c
#define LP_PERF_DEEP_SLEEP_OFFSET 0x0000028c
#define LP_PERF_DEEP_SLEEP_CNT_MSB 31
#define LP_PERF_DEEP_SLEEP_CNT_LSB 0
#define LP_PERF_DEEP_SLEEP_CNT_MASK 0xffffffff
#define LP_PERF_DEEP_SLEEP_CNT_GET(x) (((x)&LP_PERF_DEEP_SLEEP_CNT_MASK) >> LP_PERF_DEEP_SLEEP_CNT_LSB)
#define LP_PERF_DEEP_SLEEP_CNT_SET(x) (((x) << LP_PERF_DEEP_SLEEP_CNT_LSB) & LP_PERF_DEEP_SLEEP_CNT_MASK)

#define LP_PERF_ON_ADDRESS 0x00000290
#define LP_PERF_ON_OFFSET 0x00000290
#define LP_PERF_ON_CNT_MSB 31
#define LP_PERF_ON_CNT_LSB 0
#define LP_PERF_ON_CNT_MASK 0xffffffff
#define LP_PERF_ON_CNT_GET(x) (((x)&LP_PERF_ON_CNT_MASK) >> LP_PERF_ON_CNT_LSB)
#define LP_PERF_ON_CNT_SET(x) (((x) << LP_PERF_ON_CNT_LSB) & LP_PERF_ON_CNT_MASK)

#define ST_64_BIT_ADDRESS 0x00000294
#define ST_64_BIT_OFFSET 0x00000294
#define ST_64_BIT_TIMEOUT_MSB 26
#define ST_64_BIT_TIMEOUT_LSB 9
#define ST_64_BIT_TIMEOUT_MASK 0x07fffe00
#define ST_64_BIT_TIMEOUT_GET(x) (((x)&ST_64_BIT_TIMEOUT_MASK) >> ST_64_BIT_TIMEOUT_LSB)
#define ST_64_BIT_TIMEOUT_SET(x) (((x) << ST_64_BIT_TIMEOUT_LSB) & ST_64_BIT_TIMEOUT_MASK)
#define ST_64_BIT_REQ_ACK_NOT_PULLED_DOWN_MSB 8
#define ST_64_BIT_REQ_ACK_NOT_PULLED_DOWN_LSB 8
#define ST_64_BIT_REQ_ACK_NOT_PULLED_DOWN_MASK 0x00000100
#define ST_64_BIT_REQ_ACK_NOT_PULLED_DOWN_GET(x) \
    (((x)&ST_64_BIT_REQ_ACK_NOT_PULLED_DOWN_MASK) >> ST_64_BIT_REQ_ACK_NOT_PULLED_DOWN_LSB)
#define ST_64_BIT_REQ_ACK_NOT_PULLED_DOWN_SET(x) \
    (((x) << ST_64_BIT_REQ_ACK_NOT_PULLED_DOWN_LSB) & ST_64_BIT_REQ_ACK_NOT_PULLED_DOWN_MASK)
#define ST_64_BIT_DRIVE_MODE_MSB 7
#define ST_64_BIT_DRIVE_MODE_LSB 7
#define ST_64_BIT_DRIVE_MODE_MASK 0x00000080
#define ST_64_BIT_DRIVE_MODE_GET(x) (((x)&ST_64_BIT_DRIVE_MODE_MASK) >> ST_64_BIT_DRIVE_MODE_LSB)
#define ST_64_BIT_DRIVE_MODE_SET(x) (((x) << ST_64_BIT_DRIVE_MODE_LSB) & ST_64_BIT_DRIVE_MODE_MASK)
#define ST_64_BIT_CLOCK_GATE_MSB 6
#define ST_64_BIT_CLOCK_GATE_LSB 6
#define ST_64_BIT_CLOCK_GATE_MASK 0x00000040
#define ST_64_BIT_CLOCK_GATE_GET(x) (((x)&ST_64_BIT_CLOCK_GATE_MASK) >> ST_64_BIT_CLOCK_GATE_LSB)
#define ST_64_BIT_CLOCK_GATE_SET(x) (((x) << ST_64_BIT_CLOCK_GATE_LSB) & ST_64_BIT_CLOCK_GATE_MASK)
#define ST_64_BIT_SOC_CLK_DIVIDE_RATIO_MSB 5
#define ST_64_BIT_SOC_CLK_DIVIDE_RATIO_LSB 1
#define ST_64_BIT_SOC_CLK_DIVIDE_RATIO_MASK 0x0000003e
#define ST_64_BIT_SOC_CLK_DIVIDE_RATIO_GET(x) \
    (((x)&ST_64_BIT_SOC_CLK_DIVIDE_RATIO_MASK) >> ST_64_BIT_SOC_CLK_DIVIDE_RATIO_LSB)
#define ST_64_BIT_SOC_CLK_DIVIDE_RATIO_SET(x) \
    (((x) << ST_64_BIT_SOC_CLK_DIVIDE_RATIO_LSB) & ST_64_BIT_SOC_CLK_DIVIDE_RATIO_MASK)
#define ST_64_BIT_MODE_MSB 0
#define ST_64_BIT_MODE_LSB 0
#define ST_64_BIT_MODE_MASK 0x00000001
#define ST_64_BIT_MODE_GET(x) (((x)&ST_64_BIT_MODE_MASK) >> ST_64_BIT_MODE_LSB)
#define ST_64_BIT_MODE_SET(x) (((x) << ST_64_BIT_MODE_LSB) & ST_64_BIT_MODE_MASK)

#define MESSAGE_WR_ADDRESS 0x00000298
#define MESSAGE_WR_OFFSET 0x00000298
#define MESSAGE_WR_TYPE_MSB 31
#define MESSAGE_WR_TYPE_LSB 0
#define MESSAGE_WR_TYPE_MASK 0xffffffff
#define MESSAGE_WR_TYPE_GET(x) (((x)&MESSAGE_WR_TYPE_MASK) >> MESSAGE_WR_TYPE_LSB)
#define MESSAGE_WR_TYPE_SET(x) (((x) << MESSAGE_WR_TYPE_LSB) & MESSAGE_WR_TYPE_MASK)

#define MESSAGE_WR_P_ADDRESS 0x0000029c
#define MESSAGE_WR_P_OFFSET 0x0000029c
#define MESSAGE_WR_P_PARAMETER_MSB 31
#define MESSAGE_WR_P_PARAMETER_LSB 0
#define MESSAGE_WR_P_PARAMETER_MASK 0xffffffff
#define MESSAGE_WR_P_PARAMETER_GET(x) (((x)&MESSAGE_WR_P_PARAMETER_MASK) >> MESSAGE_WR_P_PARAMETER_LSB)
#define MESSAGE_WR_P_PARAMETER_SET(x) (((x) << MESSAGE_WR_P_PARAMETER_LSB) & MESSAGE_WR_P_PARAMETER_MASK)

#define MESSAGE_RD_ADDRESS 0x000002a0
#define MESSAGE_RD_OFFSET 0x000002a0
#define MESSAGE_RD_TYPE_MSB 31
#define MESSAGE_RD_TYPE_LSB 0
#define MESSAGE_RD_TYPE_MASK 0xffffffff
#define MESSAGE_RD_TYPE_GET(x) (((x)&MESSAGE_RD_TYPE_MASK) >> MESSAGE_RD_TYPE_LSB)
#define MESSAGE_RD_TYPE_SET(x) (((x) << MESSAGE_RD_TYPE_LSB) & MESSAGE_RD_TYPE_MASK)

#define MESSAGE_RD_P_ADDRESS 0x000002a4
#define MESSAGE_RD_P_OFFSET 0x000002a4
#define MESSAGE_RD_P_PARAMETER_MSB 31
#define MESSAGE_RD_P_PARAMETER_LSB 0
#define MESSAGE_RD_P_PARAMETER_MASK 0xffffffff
#define MESSAGE_RD_P_PARAMETER_GET(x) (((x)&MESSAGE_RD_P_PARAMETER_MASK) >> MESSAGE_RD_P_PARAMETER_LSB)
#define MESSAGE_RD_P_PARAMETER_SET(x) (((x) << MESSAGE_RD_P_PARAMETER_LSB) & MESSAGE_RD_P_PARAMETER_MASK)

