alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw4.0/hw/hw40_rtc_wlan_reg.h
#define CHIP_MODE_ADDRESS 0x000002a8
#define CHIP_MODE_OFFSET 0x000002a8
#define CHIP_MODE_BIT_MSB 1
#define CHIP_MODE_BIT_LSB 0
#define CHIP_MODE_BIT_MASK 0x00000003
#define CHIP_MODE_BIT_GET(x) (((x)&CHIP_MODE_BIT_MASK) >> CHIP_MODE_BIT_LSB)
#define CHIP_MODE_BIT_SET(x) (((x) << CHIP_MODE_BIT_LSB) & CHIP_MODE_BIT_MASK)

#define CLK_REQ_FALL_EDGE_ADDRESS 0x000002ac
#define CLK_REQ_FALL_EDGE_OFFSET 0x000002ac
#define CLK_REQ_FALL_EDGE_EN_MSB 31
#define CLK_REQ_FALL_EDGE_EN_LSB 31
#define CLK_REQ_FALL_EDGE_EN_MASK 0x80000000
#define CLK_REQ_FALL_EDGE_EN_GET(x) (((x)&CLK_REQ_FALL_EDGE_EN_MASK) >> CLK_REQ_FALL_EDGE_EN_LSB)
#define CLK_REQ_FALL_EDGE_EN_SET(x) (((x) << CLK_REQ_FALL_EDGE_EN_LSB) & CLK_REQ_FALL_EDGE_EN_MASK)
#define CLK_REQ_FALL_EDGE_DELAY_MSB 7
#define CLK_REQ_FALL_EDGE_DELAY_LSB 0
#define CLK_REQ_FALL_EDGE_DELAY_MASK 0x000000ff
#define CLK_REQ_FALL_EDGE_DELAY_GET(x) (((x)&CLK_REQ_FALL_EDGE_DELAY_MASK) >> CLK_REQ_FALL_EDGE_DELAY_LSB)
#define CLK_REQ_FALL_EDGE_DELAY_SET(x) (((x) << CLK_REQ_FALL_EDGE_DELAY_LSB) & CLK_REQ_FALL_EDGE_DELAY_MASK)

#define OTP_ADDRESS 0x000002b0
#define OTP_OFFSET 0x000002b0
#define OTP_LDO25_EN_MSB 1
#define OTP_LDO25_EN_LSB 1
#define OTP_LDO25_EN_MASK 0x00000002
#define OTP_LDO25_EN_GET(x) (((x)&OTP_LDO25_EN_MASK) >> OTP_LDO25_EN_LSB)
#define OTP_LDO25_EN_SET(x) (((x) << OTP_LDO25_EN_LSB) & OTP_LDO25_EN_MASK)
#define OTP_VDD12_EN_MSB 0
#define OTP_VDD12_EN_LSB 0
#define OTP_VDD12_EN_MASK 0x00000001
#define OTP_VDD12_EN_GET(x) (((x)&OTP_VDD12_EN_MASK) >> OTP_VDD12_EN_LSB)
#define OTP_VDD12_EN_SET(x) (((x) << OTP_VDD12_EN_LSB) & OTP_VDD12_EN_MASK)

#define OTP_STATUS_ADDRESS 0x000002b4
#define OTP_STATUS_OFFSET 0x000002b4
#define OTP_STATUS_LDO25_EN_READY_MSB 1
#define OTP_STATUS_LDO25_EN_READY_LSB 1
#define OTP_STATUS_LDO25_EN_READY_MASK 0x00000002
#define OTP_STATUS_LDO25_EN_READY_GET(x) (((x)&OTP_STATUS_LDO25_EN_READY_MASK) >> OTP_STATUS_LDO25_EN_READY_LSB)
#define OTP_STATUS_LDO25_EN_READY_SET(x) (((x) << OTP_STATUS_LDO25_EN_READY_LSB) & OTP_STATUS_LDO25_EN_READY_MASK)
#define OTP_STATUS_VDD12_EN_READY_MSB 0
#define OTP_STATUS_VDD12_EN_READY_LSB 0
#define OTP_STATUS_VDD12_EN_READY_MASK 0x00000001
#define OTP_STATUS_VDD12_EN_READY_GET(x) (((x)&OTP_STATUS_VDD12_EN_READY_MASK) >> OTP_STATUS_VDD12_EN_READY_LSB)
#define OTP_STATUS_VDD12_EN_READY_SET(x) (((x) << OTP_STATUS_VDD12_EN_READY_LSB) & OTP_STATUS_VDD12_EN_READY_MASK)

#define PMU_ADDRESS 0x000002b8
#define PMU_OFFSET 0x000002b8
#define PMU_REG_WAKEUP_TIME_SEL_MSB 1
#define PMU_REG_WAKEUP_TIME_SEL_LSB 0
#define PMU_REG_WAKEUP_TIME_SEL_MASK 0x00000003
#define PMU_REG_WAKEUP_TIME_SEL_GET(x) (((x)&PMU_REG_WAKEUP_TIME_SEL_MASK) >> PMU_REG_WAKEUP_TIME_SEL_LSB)
#define PMU_REG_WAKEUP_TIME_SEL_SET(x) (((x) << PMU_REG_WAKEUP_TIME_SEL_LSB) & PMU_REG_WAKEUP_TIME_SEL_MASK)

#define PMU_CONFIG_ADDRESS 0x000002c0
#define PMU_CONFIG_OFFSET 0x000002c0
#define PMU_CONFIG_VALUE_MSB 15
#define PMU_CONFIG_VALUE_LSB 0
#define PMU_CONFIG_VALUE_MASK 0x0000ffff
#define PMU_CONFIG_VALUE_GET(x) (((x)&PMU_CONFIG_VALUE_MASK) >> PMU_CONFIG_VALUE_LSB)
#define PMU_CONFIG_VALUE_SET(x) (((x) << PMU_CONFIG_VALUE_LSB) & PMU_CONFIG_VALUE_MASK)

#define PMU_BYPASS_ADDRESS 0x000002c8
#define PMU_BYPASS_OFFSET 0x000002c8
#define PMU_BYPASS_SWREG_MSB 2
#define PMU_BYPASS_SWREG_LSB 2
#define PMU_BYPASS_SWREG_MASK 0x00000004
#define PMU_BYPASS_SWREG_GET(x) (((x)&PMU_BYPASS_SWREG_MASK) >> PMU_BYPASS_SWREG_LSB)
#define PMU_BYPASS_SWREG_SET(x) (((x) << PMU_BYPASS_SWREG_LSB) & PMU_BYPASS_SWREG_MASK)
#define PMU_BYPASS_DREG_MSB 1
#define PMU_BYPASS_DREG_LSB 1
#define PMU_BYPASS_DREG_MASK 0x00000002
#define PMU_BYPASS_DREG_GET(x) (((x)&PMU_BYPASS_DREG_MASK) >> PMU_BYPASS_DREG_LSB)
#define PMU_BYPASS_DREG_SET(x) (((x) << PMU_BYPASS_DREG_LSB) & PMU_BYPASS_DREG_MASK)
#define PMU_BYPASS_PAREG_MSB 0
#define PMU_BYPASS_PAREG_LSB 0
#define PMU_BYPASS_PAREG_MASK 0x00000001
#define PMU_BYPASS_PAREG_GET(x) (((x)&PMU_BYPASS_PAREG_MASK) >> PMU_BYPASS_PAREG_LSB)
#define PMU_BYPASS_PAREG_SET(x) (((x) << PMU_BYPASS_PAREG_LSB) & PMU_BYPASS_PAREG_MASK)

#define MAC_PCU_TSF2_L32_ADDRESS 0x000002cc
#define MAC_PCU_TSF2_L32_OFFSET 0x000002cc
#define MAC_PCU_TSF2_L32_VALUE_MSB 31
#define MAC_PCU_TSF2_L32_VALUE_LSB 0
#define MAC_PCU_TSF2_L32_VALUE_MASK 0xffffffff
#define MAC_PCU_TSF2_L32_VALUE_GET(x) (((x)&MAC_PCU_TSF2_L32_VALUE_MASK) >> MAC_PCU_TSF2_L32_VALUE_LSB)
#define MAC_PCU_TSF2_L32_VALUE_SET(x) (((x) << MAC_PCU_TSF2_L32_VALUE_LSB) & MAC_PCU_TSF2_L32_VALUE_MASK)

#define MAC_PCU_TSF2_U32_ADDRESS 0x000002d0
#define MAC_PCU_TSF2_U32_OFFSET 0x000002d0
#define MAC_PCU_TSF2_U32_VALUE_MSB 31
#define MAC_PCU_TSF2_U32_VALUE_LSB 0
#define MAC_PCU_TSF2_U32_VALUE_MASK 0xffffffff
#define MAC_PCU_TSF2_U32_VALUE_GET(x) (((x)&MAC_PCU_TSF2_U32_VALUE_MASK) >> MAC_PCU_TSF2_U32_VALUE_LSB)
#define MAC_PCU_TSF2_U32_VALUE_SET(x) (((x) << MAC_PCU_TSF2_U32_VALUE_LSB) & MAC_PCU_TSF2_U32_VALUE_MASK)

#define MAC_PCU_GENERIC_TIMERS_MODE3_ADDRESS 0x000002d4
#define MAC_PCU_GENERIC_TIMERS_MODE3_OFFSET 0x000002d4
#define MAC_PCU_GENERIC_TIMERS_MODE3_OVERFLOW_INDEX_MSB 27
#define MAC_PCU_GENERIC_TIMERS_MODE3_OVERFLOW_INDEX_LSB 24
#define MAC_PCU_GENERIC_TIMERS_MODE3_OVERFLOW_INDEX_MASK 0x0f000000
#define MAC_PCU_GENERIC_TIMERS_MODE3_OVERFLOW_INDEX_GET(x) \
    (((x)&MAC_PCU_GENERIC_TIMERS_MODE3_OVERFLOW_INDEX_MASK) >> MAC_PCU_GENERIC_TIMERS_MODE3_OVERFLOW_INDEX_LSB)
#define MAC_PCU_GENERIC_TIMERS_MODE3_OVERFLOW_INDEX_SET(x) \
    (((x) << MAC_PCU_GENERIC_TIMERS_MODE3_OVERFLOW_INDEX_LSB) & MAC_PCU_GENERIC_TIMERS_MODE3_OVERFLOW_INDEX_MASK)
#define MAC_PCU_GENERIC_TIMERS_MODE3_THRESH_MSB 19
#define MAC_PCU_GENERIC_TIMERS_MODE3_THRESH_LSB 0
#define MAC_PCU_GENERIC_TIMERS_MODE3_THRESH_MASK 0x000fffff
#define MAC_PCU_GENERIC_TIMERS_MODE3_THRESH_GET(x) \
    (((x)&MAC_PCU_GENERIC_TIMERS_MODE3_THRESH_MASK) >> MAC_PCU_GENERIC_TIMERS_MODE3_THRESH_LSB)
#define MAC_PCU_GENERIC_TIMERS_MODE3_THRESH_SET(x) \
    (((x) << MAC_PCU_GENERIC_TIMERS_MODE3_THRESH_LSB) & MAC_PCU_GENERIC_TIMERS_MODE3_THRESH_MASK)

#define MAC_PCU_DIRECT_CONNECT_ADDRESS 0x000002d8
#define MAC_PCU_DIRECT_CONNECT_OFFSET 0x000002d8
#define MAC_PCU_DIRECT_CONNECT_STA_TSF_1_2_SEL_MSB 2
#define MAC_PCU_DIRECT_CONNECT_STA_TSF_1_2_SEL_LSB 2
#define MAC_PCU_DIRECT_CONNECT_STA_TSF_1_2_SEL_MASK 0x00000004
#define MAC_PCU_DIRECT_CONNECT_STA_TSF_1_2_SEL_GET(x) \
    (((x)&MAC_PCU_DIRECT_CONNECT_STA_TSF_1_2_SEL_MASK) >> MAC_PCU_DIRECT_CONNECT_STA_TSF_1_2_SEL_LSB)
#define MAC_PCU_DIRECT_CONNECT_STA_TSF_1_2_SEL_SET(x) \
    (((x) << MAC_PCU_DIRECT_CONNECT_STA_TSF_1_2_SEL_LSB) & MAC_PCU_DIRECT_CONNECT_STA_TSF_1_2_SEL_MASK)
#define MAC_PCU_DIRECT_CONNECT_AP_TSF_1_2_SEL_MSB 1
#define MAC_PCU_DIRECT_CONNECT_AP_TSF_1_2_SEL_LSB 1
#define MAC_PCU_DIRECT_CONNECT_AP_TSF_1_2_SEL_MASK 0x00000002
#define MAC_PCU_DIRECT_CONNECT_AP_TSF_1_2_SEL_GET(x) \
    (((x)&MAC_PCU_DIRECT_CONNECT_AP_TSF_1_2_SEL_MASK) >> MAC_PCU_DIRECT_CONNECT_AP_TSF_1_2_SEL_LSB)
#define MAC_PCU_DIRECT_CONNECT_AP_TSF_1_2_SEL_SET(x) \
    (((x) << MAC_PCU_DIRECT_CONNECT_AP_TSF_1_2_SEL_LSB) & MAC_PCU_DIRECT_CONNECT_AP_TSF_1_2_SEL_MASK)
#define MAC_PCU_DIRECT_CONNECT_AP_STA_ENABLE_MSB 0
#define MAC_PCU_DIRECT_CONNECT_AP_STA_ENABLE_LSB 0
#define MAC_PCU_DIRECT_CONNECT_AP_STA_ENABLE_MASK 0x00000001
#define MAC_PCU_DIRECT_CONNECT_AP_STA_ENABLE_GET(x) \
    (((x)&MAC_PCU_DIRECT_CONNECT_AP_STA_ENABLE_MASK) >> MAC_PCU_DIRECT_CONNECT_AP_STA_ENABLE_LSB)
#define MAC_PCU_DIRECT_CONNECT_AP_STA_ENABLE_SET(x) \
    (((x) << MAC_PCU_DIRECT_CONNECT_AP_STA_ENABLE_LSB) & MAC_PCU_DIRECT_CONNECT_AP_STA_ENABLE_MASK)

