alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw4.0/hw/hw40_rtc_wlan_reg.h
#define THERM_CTRL1_ADDRESS 0x000002dc
#define THERM_CTRL1_OFFSET 0x000002dc
#define THERM_CTRL1_BYPASS_MSB 16
#define THERM_CTRL1_BYPASS_LSB 16
#define THERM_CTRL1_BYPASS_MASK 0x00010000
#define THERM_CTRL1_BYPASS_GET(x) (((x)&THERM_CTRL1_BYPASS_MASK) >> THERM_CTRL1_BYPASS_LSB)
#define THERM_CTRL1_BYPASS_SET(x) (((x) << THERM_CTRL1_BYPASS_LSB) & THERM_CTRL1_BYPASS_MASK)
#define THERM_CTRL1_WIDTH_ARBITOR_MSB 15
#define THERM_CTRL1_WIDTH_ARBITOR_LSB 12
#define THERM_CTRL1_WIDTH_ARBITOR_MASK 0x0000f000
#define THERM_CTRL1_WIDTH_ARBITOR_GET(x) (((x)&THERM_CTRL1_WIDTH_ARBITOR_MASK) >> THERM_CTRL1_WIDTH_ARBITOR_LSB)
#define THERM_CTRL1_WIDTH_ARBITOR_SET(x) (((x) << THERM_CTRL1_WIDTH_ARBITOR_LSB) & THERM_CTRL1_WIDTH_ARBITOR_MASK)
#define THERM_CTRL1_WIDTH_MSB 11
#define THERM_CTRL1_WIDTH_LSB 5
#define THERM_CTRL1_WIDTH_MASK 0x00000fe0
#define THERM_CTRL1_WIDTH_GET(x) (((x)&THERM_CTRL1_WIDTH_MASK) >> THERM_CTRL1_WIDTH_LSB)
#define THERM_CTRL1_WIDTH_SET(x) (((x) << THERM_CTRL1_WIDTH_LSB) & THERM_CTRL1_WIDTH_MASK)
#define THERM_CTRL1_TYPE_MSB 4
#define THERM_CTRL1_TYPE_LSB 3
#define THERM_CTRL1_TYPE_MASK 0x00000018
#define THERM_CTRL1_TYPE_GET(x) (((x)&THERM_CTRL1_TYPE_MASK) >> THERM_CTRL1_TYPE_LSB)
#define THERM_CTRL1_TYPE_SET(x) (((x) << THERM_CTRL1_TYPE_LSB) & THERM_CTRL1_TYPE_MASK)
#define THERM_CTRL1_MEASURE_MSB 2
#define THERM_CTRL1_MEASURE_LSB 2
#define THERM_CTRL1_MEASURE_MASK 0x00000004
#define THERM_CTRL1_MEASURE_GET(x) (((x)&THERM_CTRL1_MEASURE_MASK) >> THERM_CTRL1_MEASURE_LSB)
#define THERM_CTRL1_MEASURE_SET(x) (((x) << THERM_CTRL1_MEASURE_LSB) & THERM_CTRL1_MEASURE_MASK)
#define THERM_CTRL1_INT_EN_MSB 1
#define THERM_CTRL1_INT_EN_LSB 1
#define THERM_CTRL1_INT_EN_MASK 0x00000002
#define THERM_CTRL1_INT_EN_GET(x) (((x)&THERM_CTRL1_INT_EN_MASK) >> THERM_CTRL1_INT_EN_LSB)
#define THERM_CTRL1_INT_EN_SET(x) (((x) << THERM_CTRL1_INT_EN_LSB) & THERM_CTRL1_INT_EN_MASK)
#define THERM_CTRL1_INT_STATUS_MSB 0
#define THERM_CTRL1_INT_STATUS_LSB 0
#define THERM_CTRL1_INT_STATUS_MASK 0x00000001
#define THERM_CTRL1_INT_STATUS_GET(x) (((x)&THERM_CTRL1_INT_STATUS_MASK) >> THERM_CTRL1_INT_STATUS_LSB)
#define THERM_CTRL1_INT_STATUS_SET(x) (((x) << THERM_CTRL1_INT_STATUS_LSB) & THERM_CTRL1_INT_STATUS_MASK)

#define THERM_CTRL2_ADDRESS 0x000002e0
#define THERM_CTRL2_OFFSET 0x000002e0
#define THERM_CTRL2_ADC_OFF_MSB 25
#define THERM_CTRL2_ADC_OFF_LSB 25
#define THERM_CTRL2_ADC_OFF_MASK 0x02000000
#define THERM_CTRL2_ADC_OFF_GET(x) (((x)&THERM_CTRL2_ADC_OFF_MASK) >> THERM_CTRL2_ADC_OFF_LSB)
#define THERM_CTRL2_ADC_OFF_SET(x) (((x) << THERM_CTRL2_ADC_OFF_LSB) & THERM_CTRL2_ADC_OFF_MASK)
#define THERM_CTRL2_ADC_ON_MSB 24
#define THERM_CTRL2_ADC_ON_LSB 24
#define THERM_CTRL2_ADC_ON_MASK 0x01000000
#define THERM_CTRL2_ADC_ON_GET(x) (((x)&THERM_CTRL2_ADC_ON_MASK) >> THERM_CTRL2_ADC_ON_LSB)
#define THERM_CTRL2_ADC_ON_SET(x) (((x) << THERM_CTRL2_ADC_ON_LSB) & THERM_CTRL2_ADC_ON_MASK)
#define THERM_CTRL2_SAMPLE_MSB 23
#define THERM_CTRL2_SAMPLE_LSB 16
#define THERM_CTRL2_SAMPLE_MASK 0x00ff0000
#define THERM_CTRL2_SAMPLE_GET(x) (((x)&THERM_CTRL2_SAMPLE_MASK) >> THERM_CTRL2_SAMPLE_LSB)
#define THERM_CTRL2_SAMPLE_SET(x) (((x) << THERM_CTRL2_SAMPLE_LSB) & THERM_CTRL2_SAMPLE_MASK)
#define THERM_CTRL2_HIGH_MSB 15
#define THERM_CTRL2_HIGH_LSB 8
#define THERM_CTRL2_HIGH_MASK 0x0000ff00
#define THERM_CTRL2_HIGH_GET(x) (((x)&THERM_CTRL2_HIGH_MASK) >> THERM_CTRL2_HIGH_LSB)
#define THERM_CTRL2_HIGH_SET(x) (((x) << THERM_CTRL2_HIGH_LSB) & THERM_CTRL2_HIGH_MASK)
#define THERM_CTRL2_LOW_MSB 7
#define THERM_CTRL2_LOW_LSB 0
#define THERM_CTRL2_LOW_MASK 0x000000ff
#define THERM_CTRL2_LOW_GET(x) (((x)&THERM_CTRL2_LOW_MASK) >> THERM_CTRL2_LOW_LSB)
#define THERM_CTRL2_LOW_SET(x) (((x) << THERM_CTRL2_LOW_LSB) & THERM_CTRL2_LOW_MASK)

#define THERM_CTRL3_ADDRESS 0x000002e4
#define THERM_CTRL3_OFFSET 0x000002e4
#define THERM_CTRL3_ADC_GAIN_MSB 16
#define THERM_CTRL3_ADC_GAIN_LSB 8
#define THERM_CTRL3_ADC_GAIN_MASK 0x0001ff00
#define THERM_CTRL3_ADC_GAIN_GET(x) (((x)&THERM_CTRL3_ADC_GAIN_MASK) >> THERM_CTRL3_ADC_GAIN_LSB)
#define THERM_CTRL3_ADC_GAIN_SET(x) (((x) << THERM_CTRL3_ADC_GAIN_LSB) & THERM_CTRL3_ADC_GAIN_MASK)
#define THERM_CTRL3_ADC_OFFSET_MSB 7
#define THERM_CTRL3_ADC_OFFSET_LSB 0
#define THERM_CTRL3_ADC_OFFSET_MASK 0x000000ff
#define THERM_CTRL3_ADC_OFFSET_GET(x) (((x)&THERM_CTRL3_ADC_OFFSET_MASK) >> THERM_CTRL3_ADC_OFFSET_LSB)
#define THERM_CTRL3_ADC_OFFSET_SET(x) (((x) << THERM_CTRL3_ADC_OFFSET_LSB) & THERM_CTRL3_ADC_OFFSET_MASK)

#ifndef __ASSEMBLER__

typedef struct rtc_wlan_reg_reg_s
{
    volatile unsigned int wlan_reset_control;
    volatile unsigned int wlan_xtal_control;
    volatile unsigned int wlan_tcxo_detect;
    volatile unsigned int wlan_xtal_test;
    volatile unsigned int wlan_quadrature;
    volatile unsigned int wlan_pll_control;
    volatile unsigned int wlan_pll_settle;
    volatile unsigned int wlan_xtal_settle;
    volatile unsigned int wlan_cpu_clock;
    volatile unsigned int wlan_clock_out;
    volatile unsigned int wlan_clock_control;
    volatile unsigned int wlan_bias_override;
    volatile unsigned int wlan_wdt_control;
    volatile unsigned int wlan_wdt_status;
    volatile unsigned int wlan_wdt;
    volatile unsigned int wlan_wdt_count;
    volatile unsigned int wlan_wdt_reset;
    volatile unsigned int wlan_int_status;
    volatile unsigned int wlan_lf_timer0;
    volatile unsigned int wlan_lf_timer_count0;
    volatile unsigned int wlan_lf_timer_control0;
    volatile unsigned int wlan_lf_timer_status0;
    volatile unsigned int wlan_lf_timer1;
    volatile unsigned int wlan_lf_timer_count1;
    volatile unsigned int wlan_lf_timer_control1;
    volatile unsigned int wlan_lf_timer_status1;
    volatile unsigned int wlan_lf_timer2;
    volatile unsigned int wlan_lf_timer_count2;
    volatile unsigned int wlan_lf_timer_control2;
    volatile unsigned int wlan_lf_timer_status2;
    volatile unsigned int wlan_lf_timer3;
    volatile unsigned int wlan_lf_timer_count3;
    volatile unsigned int wlan_lf_timer_control3;
    volatile unsigned int wlan_lf_timer_status3;
    volatile unsigned int wlan_hf_timer;
    volatile unsigned int wlan_hf_timer_count;
    volatile unsigned int wlan_hf_lf_count;
    volatile unsigned int wlan_hf_timer_control;
    volatile unsigned int wlan_hf_timer_status;
    volatile unsigned int wlan_rtc_control;
    volatile unsigned int wlan_rtc_time;
    volatile unsigned int wlan_rtc_date;
    volatile unsigned int wlan_rtc_set_time;
    volatile unsigned int wlan_rtc_set_date;
    volatile unsigned int wlan_rtc_set_alarm;
    volatile unsigned int wlan_rtc_config;
    volatile unsigned int wlan_rtc_alarm_status;
    volatile unsigned int wlan_uart_wakeup;
    volatile unsigned int wlan_reset_cause;
    volatile unsigned int wlan_system_sleep;
    volatile unsigned int wlan_sdio_wrapper;
    volatile unsigned int wlan_mac_sleep_control;
    volatile unsigned int wlan_keep_awake;
    volatile unsigned int wlan_lpo_cal_time;
    volatile unsigned int wlan_lpo_init_dividend_int;
    volatile unsigned int wlan_lpo_init_dividend_fraction;
    volatile unsigned int wlan_lpo_cal;
    volatile unsigned int wlan_lpo_cal_test_control;
    volatile unsigned int wlan_lpo_cal_test_status;
    volatile unsigned int wlan_chip_id;
    volatile unsigned int wlan_derived_rtc_clk;
    volatile unsigned int mac_pcu_slp32_mode;
    volatile unsigned int mac_pcu_slp32_wake;
    volatile unsigned int mac_pcu_slp32_inc;
    volatile unsigned int mac_pcu_slp_mib1;
    volatile unsigned int mac_pcu_slp_mib2;
    volatile unsigned int mac_pcu_slp_mib3;
    volatile unsigned int wlan_power_reg;
    volatile unsigned int wlan_core_clk_ctrl;
    volatile unsigned int wlan_gpio_wakeup_control;
    volatile unsigned int ht;
    volatile unsigned int mac_pcu_tsf_l32;
    volatile unsigned int mac_pcu_tsf_u32;
    volatile unsigned int mac_pcu_wbtimer;
    unsigned char pad0[24]; /* pad to 0x140 */
    volatile unsigned int mac_pcu_generic_timers[16];
    volatile unsigned int mac_pcu_generic_timers_mode;
    unsigned char pad1[60]; /* pad to 0x1c0 */
    volatile unsigned int mac_pcu_generic_timers2[16];
    volatile unsigned int mac_pcu_generic_timers_mode2;
    volatile unsigned int mac_pcu_slp1;
    volatile unsigned int mac_pcu_slp2;
    volatile unsigned int mac_pcu_reset_tsf;
    volatile unsigned int mac_pcu_tsf_add_pll;
    volatile unsigned int sleep_retention;
    volatile unsigned int btcoexctrl;
    volatile unsigned int wbsync_priority1;
    volatile unsigned int wbsync_priority2;
    volatile unsigned int wbsync_priority3;
    volatile unsigned int btcoex0;
    volatile unsigned int btcoex1;
    volatile unsigned int btcoex2;
    volatile unsigned int btcoex3;
    volatile unsigned int btcoex4;
    volatile unsigned int btcoex5;
    volatile unsigned int btcoex6;
    volatile unsigned int lock;
    volatile unsigned int nolock_priority;
    volatile unsigned int wbsync;
    volatile unsigned int wbsync1;
    volatile unsigned int wbsync2;
    volatile unsigned int wbsync3;
    volatile unsigned int wb_timer_target;
    volatile unsigned int wb_timer_slop;
    volatile unsigned int btcoex_int_en;
    volatile unsigned int btcoex_int_stat;
    volatile unsigned int btpriority_int_en;
    volatile unsigned int btpriority_int_stat;
    volatile unsigned int btpriority_stomp_int_en;
    volatile unsigned int btpriority_stomp_int_stat;
    volatile unsigned int mac_pcu_bmiss_timeout;
    volatile unsigned int mac_pcu_cab_awake;
    volatile unsigned int lp_perf_counter;
    volatile unsigned int lp_perf_light_sleep;
    volatile unsigned int lp_perf_deep_sleep;
    volatile unsigned int lp_perf_on;
    volatile unsigned int st_64_bit;
    volatile unsigned int message_wr;
    volatile unsigned int message_wr_p;
    volatile unsigned int message_rd;
    volatile unsigned int message_rd_p;
    volatile unsigned int chip_mode;
    volatile unsigned int clk_req_fall_edge;
    volatile unsigned int otp;
    volatile unsigned int otp_status;
    volatile unsigned int pmu;
    unsigned char pad2[4]; /* pad to 0x2c0 */
    volatile unsigned int pmu_config[2];
    volatile unsigned int pmu_bypass;
    volatile unsigned int mac_pcu_tsf2_l32;
    volatile unsigned int mac_pcu_tsf2_u32;
    volatile unsigned int mac_pcu_generic_timers_mode3;
    volatile unsigned int mac_pcu_direct_connect;
    volatile unsigned int therm_ctrl1;
    volatile unsigned int therm_ctrl2;
    volatile unsigned int therm_ctrl3;
} rtc_wlan_reg_reg_t;

#endif /* __ASSEMBLER__ */

#endif /* _RTC_WLAN_REG_H_ */
